[
{"title": "Pistachio Grill", "description": "We had our anniversary dinner in Pistachio Grill. It's a relatively new establishment, in a unique setting -- it's inside a mall. There may be mixed responses about the mall setting from the other visitors; however, if you're a \"no-frills\" person, you will definitely love this place. The food was beyond amazing -- the chicken was juicy and tender, and...\n\n\n\n\n\nAbsolutely Fantastic, extremely affordable Mediterranean food in Singapore. While the seating area is informal as it is located in a mall, don't let that fool you. The food is excellent. The service is excellent. The owners are extremely friendly. I look forward to my next trip to Singapore, so I can eat here again. Bring your own wine as they...\n\n\n\n\n\nI went to this restaurant not sure what to expect. Sometimes you read glowing reports in TripAdvisor and think, a Mediterranean restaurant set in the middle of shopping mall is a top ten restaurant in Singapore - really!?\nYes - really. The food is beautifully (I would say lovingly prepared). The ingredients are high quality and the flavors and preparation...\n\n\n\n\n\n\nThank you angel, for putting a smile back on our faces with your kind review, it was such a pleasure serving you. It's guests like yourself that make us run the extra mile happily. Have a safe flight home, we look forward to welcoming you at Pistachio on your next trip!\n\n\n\n\n\n\nWe went here because of the TripAdvisor rating. It was out of the way for us in a modern strip mall. Food was quite good and interesting but the seating is just outside in the mall. Not very expensive and the Egyptian owner was very friendly and compted us baklava in a box. But come on, number 1 or 3...\n\n\n\n\n\n\nThank you for your review which we had already anticipated when you said to our staff that we would fall off the Top 10 radar, even before you tasted our food. Guests who have dined at Pistachio were impressed with our food, hence they gave us top rating to express their appreciation. We prefer to be rated for our food...\n\n\n\n\n\n\n1.) Make reservation (way in advance).\n2.) Eat here.\n3.) Let me know if you know anywhere with better middle eastern cuisine.\n4.) If you think you know a better place, proceed to step 5.\n5.) You need to wake up coz you must be dreaming.\nMuch to my embarrassment, I came to know of this place, from visiting friends...\n\n\n\n\n\n\nThank you so much for highlighting the facts about Pistachio in such a concise and interesting manner. It's great to know that your friends from different parts of the Middle East enjoyed our food and found it authentic. We do not serve alcohol but we allow guests to bring their own wine when they celebrate special occasions at Pistachio.\nThank...\n\n\n\n\n\n\nMy friend introduced Paul me to Pistachio. It was the best day ever! The food was scrumptious! I had my birthday celebration there and Chef prepared a feast ! I have since returned numerous times & I was never disappointed with the quality of food! The Tomahawk is worth dieting for! I have introduced many friends & every one loves...\n\n\n\n\n\n\nIt was also our best day ever to have met such a wonderful guest like you; thank you for your continued support and friendship. You are definitely one of our regular guests that we would do anything for because you bring us so much joy with your presence. Thank you also for spreading the word about Pistachio and filling it...\n\n\n\n\n\n\nTook our friends there tonight, we had starters of the yummy dips and each of us had a main course, the mix grill, lamb shanks and moussaka with lamb chops! Every dish was cooked to perfection! Desserts so good!! Highly recommend this place anytime !!\n\n\nWe are thrilled to learn that you had a memorable dining experience at Pistachio. Thank you so much for your feedback. We will continue to do our best in serving quality food to our guests. Hope to see you again soon.\n\n\n\n\n\n\nHad a lovely meal here with friends. It is a laid back, unpretentious cafe located within a mall. The tables and chairs are set up in the atrium area but the food is good. Really really good. It is absolutely necessary to make reservations on the weekend as they have 2 seatings only and are usually full. Alcohol is not...\n\n\n\n\n\n\nWe are glad that you made it to Pistachio eventually despite your busy schedule. Thank you so much for your kind review, we are very happy that our mission to serve quality food is greatly appreciated. You are spot-on in describing Pistachio as \"unpretentious\" as we are confident that the quality of our food speaks for itself. We look forward...\n\n\n\n\n\n\nMy wife and I had a wonderful 1st Wedding Anniversary dinner here. The quality of ingredients, all freshly made from scratch make the difference. The humus was the smoothest we have ever tasted and the home made garlic sauce was very light and goes well with any type of meat, especially the kebabs, as does their home made chili paste....\n\n\n\n\n\n\nThank you for celebrating your wedding anniversary at Pistachio. It's our honour to be a part of your happy occasion. Your sincere appreciation of our food brings us much joy and we look forward to having you and Myla back at Pistachio. We wish you many many more blissful years together!\n\n\n\n\n\n\nAmazing food, good service. Value for money.\nRemmber to book.\nThe lamb shank is super. They have special menu which you can order in advance\nMust try.\n\n\nThank you very much for your kind review. We were equally wowed by your patience in waiting for a table to dine at Pistachio on a busy weekend afternoon. Glad to know that our lamb shank is greatly appreciated. We look forward to seeing you again soon. Remember to make a reservation by phone or via our website for your...\n\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d10460729-Reviews-Pistachio_Grill-Singapore.html", "type": "restaurant", "location": "20 Ah Hood Road Zhongshan Mall | #01-15 Zhongshan Mall, Singapore 329984, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Jaan", "description": "Rising high above Singapore, this is a very special restaurant run by one of the younger generation chiefs that are being drawn to this city. Multi-course with each surprising your taste buds. Impeccable service, wine selections completed a fabulous meal.\n\nI travel a lot and have eaten and generally only eat at fine dining establishments and this restaurant was one of the best I have eaten at. The variety of taste sensations and presentation of food is second to none.\n\nFrom the 75th floor, you will see all of Singapore - if you make sure to book a table by the window. The restaurant set-up is a little impersonal and dark at night.\nFood and service are sophisticated and of very good quality ; for those who like to read and taste there is a beautiful wine list ; the...\n\n\n\n\n\nIt should come without surprise that one of the comments would be that Odette and Jaan are similar in their offerings to diners.\n1) Service staff were excellent and contacted us twice to make sure that our reservation was confirmed and in place. Offered a birthday cake at the end of night.\n$130 for 2 glasses of Krug\n$80 for...\n\n\n\n\n\nMy wife and I had a wonderful time for a birthday celebration at Jaan. It is tastefully decorated and has one of the best views in town.\nThe view was spectacular boasting a panoramic view of Singapore; it added to the dining experience. We had a window seat facing the East Coast of Singapore; we would recommend to arrive before...\n\n\n\n\n\nVisited Jaan to celebrate a birthday whilst in Singapore for a few days. We had the 7 course tasting menu along with the accompanying wine flight. Expensive but worth it.\nThe view from the 70th floor over Marina Bay is great, especially if the evening light show is on during your meal.\nOur only negative comment is that the atmosphere...\n\n\n\n\n\nWe were out for my son's 25th birthday to this french restaurant. The ambience was excellent. The food was different but very delicious. The presentation was awesome.View was superb from the restaurant.Birthday boy received a complimentary chocolate cake and desserts were extremely good. No words could describe...🤗. The price could be considered for review as we find it to be...\n\n\n\n\n\nThere is nothing to criticize on the experience . Welcome food and service is at top level.\nThe Chef has created for this season a fantastic menu. The easiest dish \"Heirloom Tomatoe\" is also so the most complex and difficult to actually do. Amazing taste and complexity! All dishes are great and sure worth to try and to talk about....\n\n\n\n\n\nGreat view and superb food presented from a Michelin Chef. Everything in perfect order.\nAmazing dinner in a great atmosphere.\n\nit is always a memorable and awesome moment at Jaan. Start with the amazing view from the 70th floor. then the service is seamless and down to every details. and of course the magic of the culinary presentation in every dish.\nMy 3rd time at Jaan and every time a new gastronomic experience.\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d807776-Reviews-Jaan-Singapore.html", "type": "restaurant", "location": "2 Stamford Road | Level 70, Equinox Complex, Singapore 178882, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Wing Seong Fatty's (Albert) Restaurant", "description": "This restaurant is strictly no frills but the food is excellent and really cheap. The staff are friendly and helpful. We were recommended to eat there and I was a bit disappointed when I first saw it. Don't be put off by its appearance. Food more than makes up for it.\n\nHere you can have a good chinese dinner. Restaurant is a little busy but this is rather charming. You can enjoy the atmosphere of the chinese cooking. Very fast service and nice variety of dishes, also some less common.\nAnd a nice big bottle of Tiger beer.\nRecommended!\n\nFattys is a Singaporean institution, always pay a visit when passing through Singapore. Clay pot chicken, salt & pepper prawns, fried rice, spring rolls & pak choy, usually with a cold Tiger beer, all for approx S$40 per head. Now being run by Skinny, one of Fatties sons. Fatty used to take left overs to the prisoners of war held...\n\n\n\n\n\nYou wouldn't eat here unless someone recommended it to you as in appearance it does look rough and ready however the food is incredible ! It's the best Chinese/local food I've had and also great value for money.\n\nThis was a very enjoyable evening of fine Chinese cuisine. The roasted pork, duck and Mongolian lamb were all top notch. We sat outside and really enjoyed the ambiance of the street culture. I want to complement the wait staff who were very attentive and made sure that we were well looked after. We drank lemon tea which was also...\n\n\n\n\n\nLooking at all the good review of the restaurant and plus the fact that this is my foreign colleagues' strongly-recommended place, I almost feel sorry to say that I don't like it at all -- and I am local Chinese! But I really fail to see why it is so popular among foreigners. We had our company dinner there so...\n\n\n\n\n\none of the best meals and very inexpensive, plenty of atmosphere and the staff extremely helpful in explaining the dishes etc. $S50 will buy you a great meal for two including beer or soft drinks. only a 15-20 minute walk from Raffles and easy to get to, same menu for lunch and dinner\n\nWe decided to visit here after seeing the good Trip Advisor reviews. We were not disappointed. We were seated immediately, atmosphere was good, the staff helped us choose what to order and when the food came..... it was so delicious! We ordered the Black Pepper beef and the Indonesian Chicken with Rice and Spring Rolls. The food came quickly and...\n\n\n\n\n\nNot to be missed! Great food & fair prices. Excellent!\nEven better if you like 'Tiger' Beer 👍👌\nClay pot Chicken Curry & Peppered prawns would be the two dishes not to be missed.\nDon't be put off by the plastic plates. This wee gem is a must visit while in Singapore 🇸🇬.\n\nI used to live in Singapore and would eat here when visitors came to stay. I always thought there was some connection between Auastaloan soldiers and Fatty's but can't find any information about this. The food is always good. This time We had fried vegetables with oyster sauce (it was kailan) and beef with black bean. Beef and black bean...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d839328-Reviews-Wing_Seong_Fatty_s_Albert_Restaurant-Singapore.html", "type": "restaurant", "location": "175 Bencoolen Street Burlington Square, Singapore 189649, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Skyve Wine Bistro", "description": "Service was good. we requested for another table and the servers were quick to check and respond. Servers were polite and orders were taken correctly. Tried the Crab Soba Salad and i love it! the Galbi Ribs was recommended by many people but i personally think it was alright only. the Beef pasta seems to be lacking some punch.\nwe...\n\n\n\n\n\n\nHi peanutruffie,\nThank you for your kind words and sincere sharing.\nWe are pleased to know that you and your guests have enjoyed your brunch on Labour's Day with us and we can't wait to have you dining with us on another occasion!\nWe have taken note on your feedback on our dishes and have already shared it with our...\n\n\n\n\n\n\nOrganised a small gathering and was given a good corner table. Ample space so you don't feel close your neighbours. Waiters are friendly and attended to our enquiries. Food wise, as we went for the 1-for-1 promotion, main course selection is limited but everyone enjoyed their selections. Appetisers are good as well.\n\n\nHi Zeppelin_Kaiser,\nThank you for your kind words and sincere sharing.\nWe are pleased to know that you and your guests have enjoyed your meal with us and we can't wait to have you dining with us on another day! Our kitchen and service crew would definitely keep up with the good work.\nKindly also add us on our FB...\n\n\n\n\n\n\nNestled in a quiet area of Newtown, i would recommend this place for families with young kids to have brunch. Plenty of space for the kids as well as the adults to have conversations in a nice ambience with a choice of indoor or outdoor setting. Service staff is attentive and accommodating but the food is average that comes with...\n\n\n\n\n\n\nHi alvin_chungwx,\nThank you for your kind words and sincere sharing.\nWe are pleased to know that you and your family have enjoyed your brunch with us and we can't wait to have you dining with us on another day! We have also taken into account your comment about our food prices and have shared it with our management. We...\n\n\n\n\n\n\nRelaxing atmosphere with a spacious and bright interior, good for big groups. Reasonable pricing for food and drinks, especially with Entertainer app.\n\n\nHi GChan1984,\nThank you for your kind words and compliment.\nWe are pleased to know that you have enjoyed your meal with us and we can't wait to have you dining with us on another day! Our kitchen and service crew would definitely keep up with the good work.\nKindly also add us on our FB or Instagram account to...\n\n\n\n\n\n\nQuiet place during weekdays. Food was simply cooked but quality was great! Service was excellent! Will definitely come back again.\n\n\nHi dianakoh,\nThank you for your kind words and compliment.\nWe are pleased to know that you have enjoyed your meal with us and we can't wait to have you dining with us on another day! Our kitchen and service crew would definitely keep up with the good work.\nKindly also add us on our FB or Instagram account to...\n\n\n\n\n\n\nAlways the best place to come with the family and enjoy delicious food. Highly recommend to come with family.\n\n\nHi Wetworks,\nThank you for your kind words and compliment. You are an awesome guest too!\nWe are pleased to know that you have enjoyed your dinner with us and we can't wait to have you and your family dining with us on another day! Our kitchen and service crew would definitely keep up with the good work.\nKindly also...\n\n\n\n\n\n\nOysters were fresh, quality food, big portions, good pricing. Great ambience and attentive waiters throughout the evening! Will be back!\n\n\nHi Ruth T,\nThank you for your kind words and sincere sharing.\nWe are pleased to know that you have enjoyed your dinner with us and we can't wait to have you dining with us on another day! Our kitchen and service crew would definitely keep up with the good work.\nKindly also add us on our FB or Instagram...\n\n\n\n\n\n\nWhile the food here is delicious, I feel that it is slightly overpriced as the restaurant has a more casual feel. Would recommend using the entertainer app\n\n\nHi shadowreaver1315,\nThank you for your kind words and sincere sharing.\nWe are pleased to know that you have enjoyed your dinner with us and we can't wait to have you dining with us on another day! We have also taken into account your comment about our food prices and have shared it with our management. We value our customers...\n\n\n\n\n\n\nfood is average and price is expensive. it was my first time going there. the ambience is ok. but i wont go there to eat again...\n\nThe wait staff were fantastic the food were fantastic .. one of the few fusion restaurants I will go back to ..\n\n\nHi James3821,\nThank you for your compliment and taking off your precious time to write us a second review!\nWe are pleased to know you have enjoyed your meals with us! Our kitchen and service crew will definitely keep up with the good work! We look forward to having you skyving with us soon!\nKindly also add us on our...\n\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d3473502-Reviews-Skyve_Wine_Bistro-Singapore.html", "type": "restaurant", "location": "10 Winstedt Road, | Blk E, #01-17, Singapore 227977, Singapore (Formerly Skyve Elementary Bistro and Bar)", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Din Tai Fung", "description": "Pretty stock-standard at each outlet...I look at it as an Eastern version of a McDonalds....!!\nTheir dumplings are always freshly made and yummy....!\nUnfortunately, Singapore is selling itself short with a real lack of focus on customer service as experienced in all of my dining experiences in Singapore recently...all except for my hotel experience which was flawless....thank goodness...!!!\n\nThis is one of the original outlets in Singapore. Still as popular. The standard remains unchanged with delicious food and Service remains satisfactory.\n\nI have been coming here for the past 7 years .\nI must say the best experience is the customer service and of course the food .\nI always order no 1504 ! The black vinegar and chilli steamed wontons\n, also the crispy pancake duck , the food is as I say excellent along with the cleanliness and the...\n\n\n\n\n\nReally like the dim sum at this place. One of the better dim sum places around. Service is efficient if not so friendly.\n\nI love this restaurant to bits! Everything is delicious here. The price dishes are amazing and the soup dumplings are excellent.\nBe prepared to wait in line as the restaurant gets very busy.\n\nWe had a family dinner with my brother and two kids. I suggest an early dinner before 6pm if you do not want to wait half an hour for a table. Service is great and fast, the food is exceptional and the complimentary tea is above average.\n\nIt is busy as hell and you always have to queue up when ever you go and you would be handed over the menu to do your selection and then while you get seated they would start serving the dishes your ordered. The dumplings are outstanding and the drunken chicken is good. The place is like a synchronised food factory...\n\n\n\n\n\nI love this chain... The crab and pork dumplings are superb. Give a miss to the Indonesian outlets because chicken isn't strong enough to support the dumpling..\n\nIf you want to try local food this is the rigth place. It was a great experience and very tastefull.\nThe tea is refill and highly recomended\n\nThe food was quite great and every food was made out of love, the queues were quite long and the prices are mid ranged\nThe serving for one person is good enough even though if it is a big plate as it is quite easy to finish up one plate of any dish\nSuggestions:\nMake the price of the dishes...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d3855842-Reviews-Din_Tai_Fung-Singapore.html", "type": "restaurant", "location": "252 North Bridge Road Raffles City Shopping Centre | Raffles City Shopping Centre #B1-08, Singapore 179103, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "FOC Restaurant", "description": "This was our second time at FOC, but it seems that the novelty wore off and we were not as impressed as the first time. The food was still good, but there was something missing. We enjoyed our visits to FOC, but alas, the time has come to start exploring other places and satisfying our appetite.\n\nManaged to get a last minute booking on a Thursday night ( at the bar). Food was fantastic, great service. Loved the sauteed cauliflower with pine nuts, in fact loved every dish.\n\nWe enjoyed a fun, relaxed and entertaining evening sitting at the bar for delicious tapas and drinks. The food is gorgeous, drinks delightful, and staff entertaining. A good value and refreshing night out.\n\nGreat food, stunning presentation and very friendly and helpful staff!\nThe perfect place to celebrate a birthday!\nWill definitely visit again :)\n\nWas here on a Wednesday night and the place is fully packed. They captured the true essence of a chic Tapas Bar in Barcelona. Great vibes and great food\n\nExcellent and very attentive service. Restaurant has limited seating capacity located at convenient location. Ambience is vibrant that can be loud and noisy at times. Its either communal tables that you get to share it with others outside your group or the bar seats. So you get to see and hear what every one is eating and conversing.\nRestaurant serves...\n\n\n\n\n\nHad the need for some real Spanish food. This place was no mistake. This is where you should go if you need well served tapas dishes made by a authentic Spanish chef. Brilliant food, fast and perfect service. Will absolutely go again the next time I'm in Singapore.\n\nMy friend and I decided to drop by FOC for desserts after an unsatisfactory lunch elsewhere and boy, were we glad we did! They had an interesting dessert selection and both the Mini Chocolate Burger and Galaxy Bar desserts that we chose turned out to be gorgeous in presentation and taste. The waiter also noted that it was my friend's...\n\n\n\n\n\nWe just visited Spain so when we came back from Spain, we were really craving for Tapas. That's when we noted FOC. Food was authentic but the selection was so little and the price was way overpriced for the portion. For some idea, we had the green chilli tapas which cost us like 12++ but there were only 5-6 green...\n\n\n\n\n\nDining at FOC transported me back to Spain, where the flavours are rustic, bold, and straight to the point. My friend and I ordered 3 tapas and 1 paella, and had room for more. Unfortunately, we had to give up our table when the time was up as it was a busy night. Would have loved to try the desserts...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d7165932-Reviews-FOC_Restaurant-Singapore.html", "type": "restaurant", "location": "40 Hongkong Street, Singapore 059679, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "PerBacco", "description": "I went there one week ago: the ambient is casual but nice, great food and good presentation of the dishes. The pizza with burrata is a must, the tiramisu is dense and yummy. Chef Marco did a good job with his Team. Bravi\n\nSet lunch , Set dinner are super great deal value for $. Food quality is really good. Must try.\nAmbience is good. Romantic dinner or family gathering. Great for all occasion.\n\nPerbacco our local Italian favourite we love the wine,oysters & my favourite Papadella pasta with braised shredded lamb.DIVINE!!\nThen you cannot eat anymore but Wait\nthe panacotta with hazelnuts is delicious & best I've had.. We Take all our friends & visitors here as also the staff are very personal & helpful.\nGreat for a drink at the bar with...\n\n\n\n\n\nGreat food, beautifully presented. Staff were excellent and professional. We had the mussels, sea urchin pasta and lamb - all were excellent.\n\nThis is one of our favourite restaurants. We ordered the roast lamp rack and the sea urchins pasta, plus the charcuterie salad. The ingredients were fresh, well prepared and beautifully presented. Well worth a visit!\n\nI would rate Perbacco with a 3.5 rating. My experience was 'good' but not 'very good' as a 4 rating indicates. It was a dinner for 2 at a nice table in what is a nice bistro. Food was good, though portions weren't the biggest. The lobster pasta was nice, but not great. The cod was good. The panna cotta...\n\n\n\n\n\nThis is one of the rare moments that my family agree to go to an Italian restaurant, and love it too! Perbacco has a very welcoming, warm ambience that relaxes you. My party was warmly welcome by the staff, and service throughout was very good. Our plates were promptly changed every meal, and our water glass never ever 1/2 empty....\n\n\n\n\n\nThat was really a great surprise to find an original italian taste in Spore. Very nice decoration with lots of space and great design. Not a very extensive menu but morr than enough tp give you ad many choices as you need. Also liked the option to have half portion for cases you do not feel really hungry or having...\n\n\n\n\n\nI would classify this as a mid-range restaurant in terms of budget, but the food they serve is definitely not of the mid-range standard - it's comparable to the offerings at higher-end restaurants. We've been consistently impressed with the appetisers, the pastas and the mains, and have comfortably settled for it as our to-go for Italian food in Singapore. Pleasant...\n\n\n\n\n\nThe burrata is to die for. My second time in this restaurant and its impeccable service and delicious food from this place!\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d8287484-Reviews-PerBacco-Singapore.html", "type": "restaurant", "location": "20 Craig Road #01-03 Craig Place | Tanjong Pagar, Singapore 089692, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Wine Connection Tapas Bar & Bistro", "description": "We have to agree with previous comments that the staff are very friendly and helpful. We would like to single one person out for praise, but all the staff were equally helpful.\nWine selection is excellent at very economical prices considering the setting and the ambience.\nThe food was brought to the table very fast, perhaps too quickly for some...\n\n\n\n\n\n\nHi Dale D, thank you for your review. We're glad you had a great experience at Wine Connection, and that you enjoyed our service, wine selection and prices, as well as our ambience. We've taken into consideration your feedback regarding Wi-Fi connectivity and will certainly seek to further improve and cater to more needs. Thanks for recommending us and we...\n\n\n\n\n\n\nLook, it's busy and bustling, I suppose, but it's not a mecca of fine wines - unless, of course your benchmark is a low-level NZ sav blanc. The prices reflect the quality but I was prepared to pay for, and experience, much better.\n\n\nHi Laptop_Dancer, thanks for sharing your honest review with us. Even though we've got a vibrant and bustling atmosphere, we're sorry if our wines didn't meet your expectations. If you have any additional concerns, feel free to email us at fbops@wineconnection.com. We'll share this with the team to see how we can improve on this. We hope to see you...\n\n\n\n\n\n\nI have frequented Wine Connection since it started out as a corner shop of Robertson Walk back in the days when the infamous Double O disco was just next to it. I have witnessed it grow from the corner shop offering free plate of cut french loafs with every purchase bottle of their 'rock bottom, net priced' wines to their...\n\n\n\n\n\n\nHi shaowec2016, thanks for sharing your wonderful story with us. Being a loyal and faithful customer, we're glad you got to see our development over the years. Our thanks for giving us a second chance and noticing how much we improved in the quality of our pizza, in combination with our wine and prompt service. We'd like to thank you...\n\n\n\n\n\n\nWow how to rate this restaurant- a real challenge between staff trying to do the right thing and Mgt failings.\nLet's start with the negatives\n-more than half the beers on tap not available - a key marketing point\n- Key glasses of wines not available\n- hamburger only done medium rather than medium rare as requested ( how hard...\n\n\n\n\n\n\nHi Billrsydney, thank you sharing your valuable feedback. We're glad that our staff was friendly and attentive. However, we're sorry that half our beers were not available, along with key glasses of wine. We're glad that our staff made up for it by offering you a cheaper, yet excellent wine. Our apologies that the hamburger was overcooked and too juicy...\n\n\n\n\n\n\nMilton, the best service staff. We have a great night under his supervision. We will definitely come back for Milton again!!!\n\n\nHi keithq365, thank you for your superb review! We're glad you had a great night at Wine Connection. We definitely look forward to your next return!\n\n\n\n\n\n\nI have to agree with goneftn, that the pizzas are ordinary. Just spent 11 nights in Singapore and visited may restaurants/hawkers for lunch and dinner, all were great meals. We decided to have a night in so I ordered takeaway Hawaiian and before leaving I thought I better check. When I opened the box I was shocked at the amount...\n\n\n\n\n\n\nHi Gav370, thank you for your feedback. We are sorry to hear that the pizza was not up to expectations, and that our second pizza was still not up to expectations. We will escalate your feedback to our management to ensure that our pizza quality is looked into, and we will improve on it. If you do have any further...\n\n\n\n\n\n\nGreat atmosphere and gets very busy. Quick and friendly service at a reasonable price for Singapore. Some of the best pasta I have ever had.\n\n\nThanks for sharing your wonderful review, CWorthy-Crew. We're delighted you enjoy our atmosphere, service and reasonable prices. Also, great to know you enjoyed our pasta! Thanks for the compliments and we look forward to many more returns!\n\n\n\n\n\n\nI have been here for years for their exceptional value for money wine. I must admit i am not a professional wine drinker (can't tell between the good and the very good) but for the price offered, i have no complaints at all.\nTheir food are quite decent as well, and their selection has increased quite a fair bit.\nHOWEVER...\n\n\n\n\n\n\nThanks for sharing your review with us, Jialong. We're happy you see the value you get from our wines, as well as our food menu. We're also pleased you especially like the value of our German and Belgian beers which can't be found elsewhere. We hope to see you back soon!\n\n\n\n\n\n\nAmazing really, so many people, so busy.\nService was great, no complaints here.\nThe people beside me sent their meal back, don't know why, didn't ask.\nI wanted pizza, had read the reviews and it was all good.\nI asked which one to order and I was told Carnivore was the go so I ordered it.\nI got half way...\n\n\n\n\n\n\nThanks for sharing your valuable feedback, goneftn. Even though you enjoyed our atmosphere, great service and value for money wines, we'd like to apologise for the quality of pizza served. Rest assured this is not the standard of food we deliver to our customers. We'll escalate this matter to our team urgently to ensure such doesn't happen again. We promise...\n\n\n\n\n\n\nThis place never fails for a group of fiends to get together over a wide selection of reasonably priced wine!\nShout out to:\nHani who's a great hostess who never fails to great us with her great smile!\nAnother staff to highlight would be Jerriek who's always attentive to our needs and recommends good wine\n\n\nHi nattygab, thanks for sharing your wonderful review with us. Great to know you come here often to enjoy some of our wines with the company of your friends. Thanks for giving dear credit to Hani for her hospitality and great smiles, together with Jerriek for his attentiveness and wine expertise. We look forward to your next visit soon!\n\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d1901137-Reviews-Wine_Connection_Tapas_Bar_Bistro-Singapore.html", "type": "restaurant", "location": "11 Unity Street Robertson Walk Floor 01 Unit 19 20 | 11 Unity Street, Singapore 237995, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Edge", "description": "My wife and I recently ate here and we were very impressed. For a set price we had access to a Surf and Turf buffet that was incredible.We had unlimited amounts of crab, orysters,other sea food and access to 6-7 other food stations serving different types of food. Also,seemingly unlimited amounts of wine was available.The Pan Pacific Hotel is visually...\n\n\n\n\n\nThis is the third time we are having our Annual Company Dinner a the Edge. Never fail to impress us. Excellent Service and vast varieties of foods and desserts. Just cannot finish trying all. Special mention on service staff, Justin who display excellent customer service and respond to our needs appropriately.\n\nAte here 2 times, the food was good both times. Lots of variety and plenty of food at all times. The staff was excellent as well.\n\nGood service and food . Free cake for my birthday . Many varieties to choose . Will bring my family and friends next time.\n\nThe buffet is quite ordinary with mainly local food. Expected better service from a five star hotel but the staff seems to be only keen in clearing table !\n\nGood buffet spread. Different cuisine. Seafood is fresh and dessert is good. I would love to go back again.\n\nTA needs a half rating and this would get between 3.5 to 4.\nI've been to Edge for many years, mostly for buffet dinners and sometimes champagne brunch. Not that I really love it that much. It's more because someone in the dining party requested for it and also I'm on their royalty program.\nThe buffet mostly starts off on...\n\n\n\n\n\nGood selection of food. Nice ambience and attentive service. One of the better buffet places and would definitely be back.\n\nOne of the top restaurants in Singapore, a group of us visited the Edge for buffet. There were many stations with a wide variety of food. The dessert spread was good, especially the durian dessert and cakes. The prawns were very fresh. However, the scallop and other food were disappointing. Probably due to our high expectation, most of the dishes...\n\n\n\n\n\nThe buffet never fails to impress me. This time I went on a Thursday, slightly pricier but quality of food better. Staff were attentive and cleared my plates almost immediately each time. Didn't have the time to go to all stations as I was busy feasting on the crabs. Definitely a good place to get together and have a hearty...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d3567913-Reviews-Edge-Singapore.html", "type": "restaurant", "location": "7 Raffles Boulevard Pan Pacific Hotel | Pan Pacific Singapore, Singapore 039595, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Spago by Wolfgang Puck", "description": "Was a good meal but nothing special that you would expect for this price range. The service was average for quality of restaurant and the food was not up to the standard you would hope for in this price range but still good.\n\nThis was our 5th visit to Spagos - the service is friendly and efficient - the location and views on level 57 of Marina Bay Sands are awesome and the food is delicious and beautifully presented every time - consistency is their thing!!\nCan highly recommend the Executive Lunch, and the new additions such as the Chicken Salad and the...\n\n\n\n\n\nAwful service, Awful food and dirty plates and glasses.\n10 minutes to bring a bottle of water and 20 Minutes to bring 2 cocktails when the restaurant is not even full.\n\nThis place is nothing special. The ambiance is a turnoff, the staff is detached and tries their best to be as American as possible, even though they are locals. And that turns me off completely. The food is nothing too exciting either. Oh an no specially nice views. Safve some money and go somewhere else.\n\nI have no idea why this is so highly rated. It is expensive for what you get - the mains are so small that you'll mistake them for a tasting menu. Some of the starters are like an amuse bouche. You're paying for the location and view. We each had three course and left hungry then got more food elsewhere!...\n\n\n\n\n\nCame for dinner with my mom and had the most amazing meal. We shared the apple and cucumber salad which was so fresh and tangy. I had the monkfish with lobster and my mother had the organic pan roasted chicken with the most unbelievable jus which I drank from the spoon! Excellent service, gorgeous setting. Great menu, excellent wine selection....\n\n\n\n\n\nWe had the fixed price lunch menu which was really good value at 45sgd for 3 courses. The service and food were incredible. We spent the whole day in the area and so I think we were a bit underdressed as I couldn't wear a posh outfit to wander around in all day (we were staying in the Clarke quay...\n\n\n\n\n\nOur 2nd Wolfgang Puck restaurant in 2 nights. Spago was a true delight. A lovely menu. We had the most delicious cucumber and apple salad. Oh my word out of this world. Served with warm bread. I had the chicken. Just unreal. My daughter had the monk fish. Ended off with fresh mint tea. Great meal. So worth every penny\n\nWe were so delighted with a nice breeze and comfy sofas after being in the heat for the whole morning. It felt like being a member of a country club with pool, mason pathways and gardens surrounding the bar. Didn't look like we were high above the ground unless you see the top of some skyscrapers. We had a nice...\n\n\n\n\n\nGreat Service, Great Food, simplicity at its best! Elegant and sophisticated service, the restaurant was set up with care, spot on. The food TOP quality product cooked to perfection. Bravo!\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d8683187-Reviews-Spago_by_Wolfgang_Puck-Singapore.html", "type": "restaurant", "location": "10 Bayfront Avenue Marina Bay Sands | Marina Bay Sands, Singapore 018956, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Blu Kouzina", "description": "An amazing place for the Meat Eaters. Authentic food in a charming surroundings. Can a bit noisy at times so try to sit outside and enjoy particularly on the weekends.\n\nWe booked Blu Kouzina for our 22nd wedding anniversary dinner, and we were not disappointed.The meal was amazing, the staff fantastic - with a little surprise at the end of the night \"on the house\", to say \"Happy Anniversary\" ! We cannot recommend this restaurant enough - and will be back.......soon!!!\n\nWe went as 5 couples ( you need to reserve in advance ) on a weekend. The place was packed to the rafters and that was a part of the problem. It was hot as hell . Not the most pleasant experience eating while mopping the sweat off your face . Upon asking , we were told that the air...\n\n\n\n\n\nFood was excellent. Not more I can say.\nService was just ok. Atmosphere was ok. I recommend Blu if you want good food and not have visit McDonalds to fill up\n\nMy wife and me wanted to have some Greek food, so the choice was Blu Kouzina.\nWe made a reservation online and this went perfect.\nUpon arrival the waiter immediately brought us to our table.\nRestaurant is nicely decorated.\nWe ordered a few starters and two main dishes.\nPresentation and taste of the food is really good.\nThe problem was...\n\n\n\n\n\nOnce they knew it was our Anniversary the service went up several notches. We were given a quiet table, served us compliment Prosecco wine & were unobtrusive but attentive at the same time.\nThe food was amazing. Fresh ingredients, cooked to perfection & oh so tasty.\nDefinitely coming back here.\n\nThe desserts definitely outstanding. Overall, quality food food served. We enjoyed the ambience. It was full house even at 2pm!\n\nI visted this place few years ago when they were located in Bukit Timah. I visited the new place last Sat and it was still very good! The food was really healthy and nice. Of course the atmoshpere is really cool!\n\nLet's just say that this is Singaporean style Greek restaurant... normally Asians may not know how to appreciate Greek food but I must reiterate that this one is a surprise... as I've been to a few Greek islands namely Mykonos & Santorini plus around and about Athens & the Acropolis a few times over my tenure in Singapore Airlines (been...\n\n\n\n\n\nThe food was awesome, service is good, ambience is great! Ordered meat platter, it was grill to perfection. Also ordered the bbq prawn, though expensive but it was very delicious! Would return again to try other dishes.\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d10188367-Reviews-Blu_Kouzina-Singapore.html", "type": "restaurant", "location": "10 Dempsey Road | Blk10, Singapore 247700, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Carousel Buffet, Royal Plaza on Scotts", "description": "Prompt to clear dishes while you replenish more. Good spread with a good handful of seafood ; lobster, oyster , crab. Especially loving the sashimi counter and the desert.\n\ntable service was prompt & efficient. plastic ware & utensils are available for toddlers. Makes it enjoyable for the toddler w/out breaking any of the ceramic ware. typically over subscribed, hence early reservations is usually necessary. That says it all i guess that it's a place in demand.\n\nGood food, good service. Totally worth it with many seafood especially lobsters and oyster and long leg crab. And new ice cream counter with many interestibg flavours you cannot find elsewhere.\n\nfresh seafood, loved the fatty salmon sashimi and the wide variety of spread, my Muslim friend loved it there! :)\n\nI love to dine in carousel. This would be my 4th time to dine there. This time i took my youngest sister to try. They provide wide variety of food. Fresh cold seafood available such fresh oyster, big prawns, crabs etc. You name it! Also japanese food, indian etc and the desserts are to die for. Good service. Best food....\n\n\n\n\n\nThere's nothing negative that I can possibly think of about Carousel. Everything is perfect from the service, to the food, ambiance, sincerity in going above and beyond in making sure the guests have a wonderful dining experience. The surprise birthday song and cake was a nice touch.\nPersonally for me, the one thing that can always bring me back to...\n\n\n\n\n\nthe staff is professional and polite - they even took the effort to perform for those who were celebrating their birthdays in the restaurant that day. The celebration was done sincerely and you could tell everyone was in a good mood because of it. Food: sushi was great. The salads were plated nicely. Loved the pan-fried potatoes in onion-herb marmalade....\n\n\n\n\n\nNot to miss their seafood counter n sashimi counter. Desserts counter could be better, as the taste of the dessert is just average only. But the variety is a lot, from Cakes to bread pudding and waffles plus ice cream.\n\nDelicious seafood and wide selection of dessert. Therese of course food from various different cuisine but my favorite was the seafood and dessert. We came here for my mom's birthday and they made a special celebration by bringing out a cake and the staff sang to all the groups that were there to celebrate. The service was also really great....\n\n\n\n\n\nPretty good and generous buffet with prices to match. Seafood is the star here. Will recommend,especially when there is a promotion on.\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d794086-Reviews-Carousel_Buffet_Royal_Plaza_on_Scotts-Singapore.html", "type": "restaurant", "location": "25 Scotts Road, Singapore 228220, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Cut by Wolfgang Puck", "description": "What a great experience: arguably the best steak I have tried including New York Strip loin and Japanese Wagyu. My husband. Chose a 1 kg lobster. Staff were attentive.\nJust remember to bring your check book as our meal for 3 was just under $1k\n\nCompared to other Michelin star places this place is not worth it. Also compared to other good steak houses they cannot make it if you take into account the price you pay.\nThe steak was nice, nothing wrong but also nothing spectacular compared with other other steak places in Singapore. Not to mention some steak places outside of Singapore. $360++...\n\n\n\n\n\nWas lucky enough to try both of his restaurants. If you are a carnivore lover this is the place to try. You can choose your meat from either Japan,USA and Australia. Be prepared to pay though. Extras are not included. Amazing wine selection. Great ambience in the restaurant. Very atmospheric.\n\nJust really a fantastic meal. Have only the highest of praise. Very nice menu. Not large. Mixed assortment of starters. My daughter had the crab. Served lovely fresh breads. We both had the fillet medium. Cooked to perfection with side onion rings and French fries. Skin on. Served with all the condiments. Large wine list. Some very expensive. Glad had...\n\n\n\n\n\nI had a good chance to experience fine dining in Cut by Wolfgang last night. It was a perfect time to spend with colleagues to celebrate special occasions.\nFirst off, the service was very good. Attentive and warm. From the receptionist to the waiters. From appetizers to desserts. Service was consistent. Food delivery was simultaneously done for everyone in the...\n\n\n\n\n\nWe were invited by a couple of friends. There was a private party and the noise level was so high that we could hardly talk to each other. We chose our cut (average 200 dollars/person) and what was my surprise when the plate arrived. The steak was standing alone.. meaning not even a leaf for deco. We ordered some greens...\n\n\n\n\n\nnice atmosphere, although lightly dark. very friendly staff. meat was fantastic, perfectly cooked and of high quality. assides we had potatoes with garlic (yummie!) and onion rings (not greasy). quite pricy place but its worth it!!\n\nAmazing package of food drinks and service. Yes the price is a bit higher than usual, but as well what you get is a bit more and better than usual! go there, you will not regret it!\n\nI ate here with a friend and the food and cocktails were amazing. The bill for the two of us ran about $400+ but the meal was worth every penny. We ordered quite a bit from a few cocktails each, appetizers (my favorite was the tuna tartar), steaks, brussel sprouts, and mac-n-cheese. Everything had such robust, bright, and clean flavors....\n\n\n\n\n\nCut by Wolfgang Puck is synonymous with quality steaks and wonderful wine pairing.\nThey certainly know where to source and handle the premium steaks the right way. Personally I feel that it's one of the few restaurants in Singapore or in the world, that treat the steak with care and respect. The Blackmore Angus steaks were full of flavour and...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d2002823-Reviews-Cut_by_Wolfgang_Puck-Singapore.html", "type": "restaurant", "location": "2 Bayfront Avenue | The Shoppes at Marina Bay Sands, B1-71 (Next to the Theater), Galleria Level, Singapore 018972, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "The National Kitchen by Violet Oon at the National Gallery", "description": "We booked for the 8.30pm time slot. The restaurant is within the beautiful old gallery building. We ordered a few dishes but the highlight was definitely the beef rendang. It was the best we'd had anywhere. Unfortunately the restaurant is loud so it was hard to have a conversation. Staff apologised over the noise as there was a big table...\n\n\n\n\n\nNice place for dinning. A refreshing approach on how the food is prepared and served. Certain dishes the portions are bit small.\n\nTook a group of friends from overseas to National Kitchen for a taste of Peranakan cooking. Our waiter arranged a perfect sample menu touching on vegetable, fish and meat specialties and tailored to our bespoke spice requests. The food was interesting and delicious. Great and warm staff.\n\nThe chicken satay was delicious alrhough the peanut sauce is unusual. The beef rendang was tender but the gravy was too sweet, so as the sayur lodeh. The dry laksa was okay. The red snapper with pineapple was delicious.\n\nWalking into a gallery was a great start to this meal. And the actual restaurant itself was beautifully decorated. The space was intimate, richly decorated and created a relaxed ambience. Service was mainly good. Our main waiter was great and friendly. The others not so good, on arrival they did not have our table ready and some of the other...\n\n\n\n\n\nIf you are visiting Singapore for a few days, be sure to make a booking at the National Kitchen. Violet Oon now has a few restaurants but this one at the National Gallery is extra special because it it inside the National Gallery and features some beautiful art deco design. Food is spot on (get the Gado Gado, Beef Rendang,...\n\n\n\n\n\nLunch was a birthday lunch and a reward-lunch. Excellent food and service for awardee. This should be an awarding kitchen too!\n\nMade reservation at 2pm. Was told to leave the restaurant by 3pm as they will be having their afternoon tea.\n\nThis is the 2nd time I brought my parents to National Kitchen. Love the ambience, food and service. Beef rendang is a MUST order, Curry Fish head is good too. End off lunch with a cuppa Kopi.. perfect! Definitely 1 of my Favourite restaurants in Singapore.\n\nThe National Kitchen at the National Gallery is a beautiful representation of traditional Peranakan cuisines.\nIt's a popular place among locals and foreign visitors, among them foreign head of state and royalty as invited by the Government.\nMy wife and I came here for dinner and we had a lovely time with the quality of the food and level of...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d9596660-Reviews-The_National_Kitchen_by_Violet_Oon_at_the_National_Gallery-Singapore.html", "type": "restaurant", "location": "1 St. Andrew's Road National Gallery Singapore | #02-01, The National Gallery, City Hall Wing, Singapore 178957, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Wine Connection Bistro at HillV2", "description": "I took my wife here for a surprise dinner, after getting our kids situated at home. Parking is around back and you MUST enjoy the use of the complimentary valet parking!!\nWe called ahead but found out reservations not needed after 7pm...got there at 7:30pm and were seated right away.\nWe found the ambience, food, and service (mainly by Zack)...\n\n\n\n\n\n\nHi minhtranSG, thanks for sharing your review. Thanks for choosing Wine Connection to host a surprise dinner for your wife. We're happy to know you liked our ambience, food and service. Many thanks for recommending the appetizers, steaks and Chateau de Lisse. We're glad you found your evening memorable, and would love to have you over again very soon! Thanks...\n\n\n\n\n\n\nThe sides, mains and desserts here are amazing! Coupled with the good ambience, this is the perfect place for a satisfying dining experience.\n\n\nHi BenjaminLoh, thanks for your great review. We're delighted to hear that you enjoyed our food, along with our ambience that made a satisfying dining experience. We hope to see you again!\n\n\n\n\n\n\nI called up Wine Connection Hillview 2 outlet a while ago ( @ Singapore Time 2135hrs on 24 April ) to make a reservation for coming Saturday (29 April) for 3 persons at 730pm. A male staff who perhaps can't converse in English made me repeat my surname (Chang) 8 times, mobile number more than 10 times till he gave...\n\n\n\n\n\n\nHi Maddy653, thank you for your feedback. We're sorry to hear about your experience with our staff while trying to make a reservation. Do rest assured that this is not the standard of service we are known for, and we are sorry that this caused you to go to another restaurant. We will escalate this to our management and ensure...\n\n\n\n\n\n\nBeen here couple of times. Foods quality and variety was good. Service level was good in general though could be better if the crowd is not big in the restaurant. Wine selection has improved over time. Great place to chill up in the evening. Booking is necessary for weekend.\n\n\nHi KK_YOLO, thank you for your great review! We're glad that you've visited Wine Connection a couple of times, and that you like the quality and variety of our food. We're sorry to hear that even though our service was good in general, that it was not up to expectations when it got crowded. We're glad you like the improvement...\n\n\n\n\n\n\nNice ambient, good service and the food was great! Excellent service, despite the distance away from the city, but this place is worth the visit\n\n\nHi Michelle T, thanks for your lovely review. We're glad you like our ambience, service and food. We hope to see you again soon!\n\n\n\n\n\n\nAmbience is good and is very suitable for couples looking for a place to sit down and chill. friendly and attentive staff.\n\n\nHi myedvin87, thanks for your review. We're glad you like Wine Connection's relaxing ambience that is suitable for couples, and our friendly and attentive staff. Hope to see you back here again!\n\n\n\n\n\n\nThe atmosphere is good and have a wonderful time and enjoy the food. The service is very good and the staff is very friendly\n\n\nHi estherleebp, thanks for sharing your review with us. Glad you enjoyed your time at Wine Connection, with our vibrant atmosphere, quality food and exceptional service. We hope to see you back here soon!\n\n\n\n\n\n\nfood here is pretty decent, but this place is mainly for wine lovers! has an area to shop for wholesale wine as well. good service, and nice relaxing vibes.\n\n\nHi geraldchan, thanks for providing your feedback. We're glad you like our food, good service and relaxing atmosphere. We definitely have retail outlets spread across to cater to all wine lovers around Singapore. Hope to see you again!\n\n\n\n\n\n\nI love going to this place over and over again simply bcos the food, ambience and staff are awesome. The lava cake especially with vanilla ice cream was exceptionally wonderful.\n\n\nHi Wineglass2000, thank you for your great review! We're glad that you enjoy our food, ambience and service, especially our lava cake! See you again soon!\n\n\n\n\n\n\nCosy ambience, great value for money for drinks.\nAttentive service, waitress was knowledgable about the wines on the menu. 'Twas a great help.\nAmazing experience overall.\nWill definitely come back , no doubt.\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d7082243-Reviews-Wine_Connection_Bistro_at_HillV2-Singapore.html", "type": "restaurant", "location": "4 Hillview Rise The Hillier | #02-05/06, Singapore 667979, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Artemis", "description": "We were unfamiliar with this venue but it came highly recommended as an understated restaurant on the rooftop level of CapitaGreen. We managed to secure a table for a dinner taste test.\nThe space was welcoming with simple yet elegant interiors. Nothing too fancy to distract you from the floor to ceiling views of the CBD and beyond. The restaurant...\n\n\n\n\n\nI celebrated my birthday with my Husband at Artemis. We found the appetisers grilled mushrooms, a special item for the day, chargrilled otupus and crab salad really tasty. However, we were disappointed with the mains Hamachi and Venison loin especially the hamachi as the flavours of the fish did not come out very well. We are happy with the generous...\n\n\n\n\n\nHad several times business lunch at Artemis. Bright space, exceptional view and elegant design.\nFood is very good. The design of the dishes, the tastes are excellent.\nThe wine selection has also interesting things.\nThe service is also good.\nThe price is on the high side but it is good product, great dishes and great place.\n\nI enjoy going to Artemis for the fantastic view and the wonderful innovative cocktails. I also love the organic corn-fed chicken infused with different spices and tasty seabass sashimi!\n\nI really enjoyed the starters at this place but I was disappointed by the main courses. They were out of the couple of mains when we dined which was a disappointment, considering we came here mid week and it was not too busy\n\nWe had to wait in the bar area for our table for about 10 minutes and then the service was very slow. The food was fine but nothing special given the price tag of $295 for 4 people with no one drinking alcohol.\n\nCelebrate my GF birthday at there. Overall I am satisfied with their services and food.\nThere are outdoor and indoor in the restaurant.\nOutdoor is more happening (with DJ playing music) and I will suggest your guy having meal indoor if you wish have a environment which can chit chat with your friend.\n\nThis was my third visit and it was a whole different world from the first two (not that they were bad).\nThe views speak for themselves but what really wowed was the impeccable, warm service and excellent food, creatively interpreted by the chef. Some mains were a bit pricey but on the whole well worth the experience.\n\nI went last night for dinner. Food was very good. I enjoyed it very much. The fish was cooked very well. Wine selection was quite good. View was also excellent. Service was not the best. I had to wait 10 minutes for a bill. Plus, seeing people making out at their table is a bit akward.\n\nOrdered the wagyu carpaccio for starters, which was a total miss. There's a reason why regular carpaccio uses the leanest cut. There's simply too much fat in wagyu to make it appetising when eaten raw. Also, the beef slices were presented in rolls, which seems more like a hotpot, and defeats the purpose of having thin slides of beef in...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d9564584-Reviews-Artemis-Singapore.html", "type": "restaurant", "location": "138 Market Street | Level 40 CapitaGreen Rooftop, Singapore 048946, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Basilico", "description": "A little on the pricey side but when you have quality food you don't mind so much. We shared an entree, had our own mains which were absolutely delicious. We had 1 wine each and that was it, the bill was about $170. Staff were attentive. A very nice restaurant, excellent service and food.\n\n@TheKuoKnows\nItalian restaurants don't get much better than this. From the moment you step into Basilico, you have the feeling that you are about to experience something very special.\nThe antipasti buffet is a sight for sore eyes. From cured meats to crisp salads to exotic cheeses, there is something for everyone. There is probably enough on offer without even...\n\n\n\n\n\nWow! What a treat! We booked a table for 3 for their semi buffet dinner extravaganza. It was SG$ 64 per head and add another SG$10 for free flow Prosecco.\nWe missed out on the Wagyu Beef Bresaola which was replaced with duck meat but that was my only grumble. The Chef sent over complimentary tasters of herbed melted cheese...\n\n\n\n\n\nMy wife and family enjoyed coming to Basilico at The Regent Hotel for lunch and dinner. It has a nice ambiance and array of food on offer.\nWe often skipped the mains because the antipasti table had already substantial choices of cheese, salad, cold cut, cured salmon, and bread, which we often came back for more.\nWe loved their dressing...\n\n\n\n\n\nFood was of top quality. The only let down was the lobster and prawns mains. However, the chef immediately changed it which was perfectly cooked. Don't leave without trying all the dessert. It is a must!\n\nThis is one of my favourite restaurants and was looking forward to a long lazy lunch with my family who are in town for the week. Booked in plenty of time but was given a table in an annexe with 4 large tables of families with children under two. The noise was unrelenting as you would expect from a large...\n\n\n\n\n\nPrice was on the higher side for a buffet lunch on public holiday, but the food and service were good, and it was full Italian fare. Worth going once in a while\n\nIt was my second time at Basilico and the food was as good as I remember! The semi-buffet choices were to die for: a wide selection of cheese, salad, carpaccio etc. The main course was fantastic as well; my friend and I had the beef tenderloin and the Tonnarelli with beef and they were both delicious. This place is truly...\n\n\n\n\n\nGreat selection of good\nWonderful desserts\nLove the roast beef with peppercorn sauce\nWe'll be back - highly recommend\n\nThe cheese selection, pastas and pizzas. Everything was amazing. There was a wide variety and options for everyone. Also totally worth the price. Highly recommend it for the ambience, widespread choice and quality. Have been previously for an a-la-carte meal but the buffet is a true steal.\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d1466538-Reviews-Basilico-Singapore.html", "type": "restaurant", "location": "Regent Singapore | 1 Cuscaden Road, Singapore, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "My Awesome Cafe", "description": "Good food in a relaxing and friendly atmosphere,\nThe cheese and meat platter was delicious and reasonably priced.\n\nThat place really deserves its name. Awesome food and awesome staff - we enjoyed a yummy salad and a superb sandwich. Thank you\n\nGreat place! Good service, excellent food with fresh ingredients! Must visit! And a very friendly owner.\n\nMy Awesome Cafe is one of my go-to lunch / drinks / casual dinner spots in Singapore.\nIt truly is awesome by name, awesome by nature!\nThe staff are friendly, welcoming and attentive. Franck (the main man) is often there getting stuck in and being the wonderful man that he is.\nThe menu is epic - so much choice! -...\n\n\n\n\n\nI would highly recommend this cafe, super lovely! Nice salad, it's chicken tastes very soft and easy chewing. Flat white was wonderful as well. Would love to try at night to chill with friends next time\n\nFriendly excellent just awesome! Genuinely caring and very good food using fresh ingredients, great whisky selection.\nFantastic place to chill and have a coffee middle of the afternoon, a drink with friends at night or a nice lunch with colleagues.\nKeep up the amazing work, team!\n\nLove this cafe. Located at the old shop lot- very unique . Food is greta . Ambience cool. Staffs are friendly.\n\nBoth the sallad and The lasagna was amazing! The staff is just the best. If you are nearby you need too eat here! Highly recommend!\n\nService is nice, kind of cool interior design and decoration.\nNot very confortable seat, tables and arragement.\nFood is boring, average, quantity is big though.\n\nI like everything.it is a very good place, great hospitality.Thanks for great food and drinks.When you go to singapore you should visit this place.\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d6405257-Reviews-My_Awesome_Cafe-Singapore.html", "type": "restaurant", "location": "202 Telok Ayer Street, Singapore 068639, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Peach Blossoms (Marina Mandarin)", "description": "Our family had birthday celebration at the restaurant. Good food, great time. Service really good. Environment is clean and great experience Great choice, introduced by the manager Terry Lim. is really value for money. Will visit again\n\nWe have our lunch and delighted by the smiles and attractiveness of the staff which is rare in Singapore.\nLike to thanks these staff: Alden and his team Terryville, Vivian, Munich Finger , Sun Jing, Christine, Douglas and Akira. Kudos!!\n\nI had a wonderful birthday dinner with my family's and friends. The service was excellent, thank you to the staff's who served us well - Alden, Nobel, Terry, Vivian, Mun Fong, Sun Jing, Christine and Sharon. I will come back in September for my friend's birthday.\n\n\nDear Chua L,\nHappy belated birthday to you! Thank you for your reviews of our restaurant. I am glad that you enjoyed your birthday celebration here and I certainly look forward to host you and your friend again for that very special birthday occasion!\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nWent down to peach blossom today to celebrate my birthday. The food is great and the manager, Alden Gan and his team provide excellent service with great food recommendations as well. Thank you guys :)\n\n\nDear juilim,\nHappy belated birthday to you! Thank you for your reviews of our restaurant. I am glad that your dining experience was a special one and I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nExcellent service, delicious food, and wonderful service. The team that attended to my family was very professional and friendly. Honorable mention to Terry, Nobel, Bowei, Mun Foong, Sun Jing, Jeff, Vivian, and Christine. They made the birthday celebration even better, livening up the atmosphere, even singing for us. The salted egg prawns and wagyu beef were the highlights of the...\n\n\n\n\n\n\nDear Ian T,\nThank you for your reviews of our restaurant. I am pleased to be able to host you and your family on this special birthday occasion and I am sure our staff has taken good care of you! I sincerely look forward to be host you on many such occasions in future!\nYours sincerely,\nRyan Chan\nDirector of...\n\n\n\n\n\n\nWe have our birthday lunch at peach blossoms the buffet lunch is really nice good food and the service staff is very friendly and attractive thank to Christina ,Nobel ,terry ,bowie ,Mun Fung ,sun jing will see you'll again\n\n\nDear Sally C,\nHappy belated birthday to you! Thank you for your reviews of our restaurant. I am glad that you chose Peach Blossoms to celebrate this special occasion and am also delighted we didn’t disappoint! Your compliments will be shared with Christina, Nobel, Terry, Bowie, Mun Fung, and Sun Jing and they will certainly be pleased to welcome you...\n\n\n\n\n\n\nHad my birthday lunch at peach blossoms. Nice ambience. Friendly and attentive staff. And not forgetting the food was amazingly good!\nServed by Terry\n\n\nDear darszx,\nHappy belated birthday to you! Thank you for your reviews of Peach Blossoms. I am glad that you enjoyed the food by the Chefs and the service brought to you by Terry. I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nOur family had birthday celebration last weekend at the restaurant. Good food, great time. Service really good. Environment is clean and comfortable. We chosen the sit down buffet. Great choice, introduced by the manager. It is really value for money. Was told the Chilli crab is good there, have not tried it. But will definitely find time to try. $300...\n\n\n\n\n\n\nDear Andrea44sg,\nThank you for your reviews of our restaurant. I am glad our dim sum buffet didn’t disappoint! And yes, you certainly have to try our Chili crabs, and I am sure they are to die for! I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nMy wife and I had dinner when staying at the Marina Mandarin. It was delicious. So tasty and light, not like lots of Chinese meals we have eaten in the past. The staff are very elegant and the restaurant is very relaxing.\n\n\nDear Robert N,\nHappy belated birthday to your dad! Thank you for your reviews of our restaurant. I am heartened by your patronage at Peach Blossoms and am glad we didn’t disappoint. I hope you had a great stay in Marina Mandarin and I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nAt Peach Blossoms tonight. Good services, an enjoyable dining experience. Thanks to the talented Terry, the bubbly joyful Christine, and the other team members Alden, Nobel, Sook Teng, Mum Fang and Akira.\n\n\nHi beesuan,\nThank you for your reviews of our restaurant. I am glad to have brought you an enjoyable dining experience and your compliments will be shared with Terry and team. I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d1007702-Reviews-Peach_Blossoms_Marina_Mandarin-Singapore.html", "type": "restaurant", "location": "6 Raffles Boulevard Level 5 Marina Square, Singapore 039594, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "MTR Restaurant", "description": "MTR lives upto its reputation as one of the top veg options for indian travellers. The bisibele bath is my top pick there. Crowded at peak times but worth the wait.All the dishes are excellent. Closed on mondays.\n\nWent with family for a lunch on a Saturday . Ravi dosa, pudi dosa without masala n filter coffee were excellent. Not to be missed. 12 noon is good time to get table. Beyond that first come first serve.\n\nMy family & I have been to MTR on multiple occasions & have only been delighted by the fabulous food at MTR. The service is very quick, the food quality excellent & the attendants are courteous. It is a place to grab a quick & yummy bite so not a place when you want a fine dining experience but definitely...\n\n\n\n\n\nHas authentic south Indian cuisine. No change in taste as compared to MTR outlets bangalore. One point less for not so good tea.\n\nWe went here based on the tripadvisor reviews and we weren't disappointed. It was extremely busy and the ordering system was a bit confusing. Not sure if we were supposed to line up and order or whether it was table service. There seemed to be a bit of both happening. In any case, we were looked after by a lovely...\n\n\n\n\n\nIf you are looking for authentic South Indian food, then no need to look beyond MTR. It's as authentic as it gets. The taste, the ambience, the ingredients - all excellent. My favourite is the plain dosa, rava idli, bisi belle rice - pretty much everything on the menu is worth coming again and again. The services is courteous and...\n\n\n\n\n\nI'm not the biggest fan of vegetarian but even I found the food here delicious. Just be aware that you need to order and pay at the counter and the front rather than order from a waiter. Prices very reasonable.\n\nExcellent taste .. genuine south Indian restaurant ... A bit crowded in the evening due to small space but worth the wait ... Try their recommended items... Originality presented well.. a must try ..\n\nWe had a lunch here and it was fabulous. It's vegetarian but as a meat lover I wasn't disappointed at all. Everything was tasty and full of flavors. The setting is rather basic but the taste of the food was not.\n\nStayed 7 nights in Little India and we went here for 5 of those mornings for breakfast. The food was yummy. If you want traditional South Indian food, give it a try. My boys are hooked, and I will be back again.\nThanks MTR 😃\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d4304406-Reviews-MTR_Restaurant-Singapore.html", "type": "restaurant", "location": "438 Serangoon Road | #438, Opposite Sri Srinivasa Perumal Temple, Singapore 218133, Singapore (Formerly Mtr)", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Old Airport Rd Food Centre", "description": "Came late at night(around 11pm) to satisfy the hunger. Tried black carrot cake and oyster omelette, taste was nice, and also cheap too(prices around $3-9). Places is quite big for hawker center, with many variations of food stall\n\nCan try many different food. can eat from end to end. So many local foods that can eat! Great place.\n\nEasy to find and tons of option!! We stuck with the safe bet of teriyaki but there was plenty of bits we were scared to try (frog porridge)! Great opportunity to try loads as it's cheap for Singapore!\n\nAll the foods here are very good and afforable !\nBeen here every week twice , its a must visit place for foodies .\n\nWe got here by smrt and a 5 minutes walk.\nAfter finding a table we took off for food.\nLots to try and the food stalls we ate from were really nice.\nNice to sit with locals and get some advise.\n\nI thought before that food in Singapore was lack of flavor, and i was mistaken because usually i ate at food court inside a mall. So, on my last trip there i went to different hawker centre everyday. I go to this place taking a bus from orchard road, no need to change bus. The bus can take me directly...\n\n\n\n\n\nIt offers a lot of food varieties in this massive hawker centre. Good selection of good local food.\nMany stores having long queue. I do not recommend this place for social outing. Queue for food, queue for drinks, queue for dessert, no service. Hate the birds around too!\n\nSO much choice. Love the Wang Wang Crispy Curry Puff here, as well as the oyster omelette, char kway teow and Lao Ban Tau Fa. Too much choice here, oh and the otah is pretty yummy too! Both at lunch and dinner ties, as well as breakfast, this place is absolutely buzzing!!!! Don't miss it - if you do, you're...\n\n\n\n\n\nAlthough this food court is far away from the downtown, you can tried the good food when you see there is long queue, the satay and curry puff are good, the fried noodle is sweet and the seafood inside is fresh and delicious\n\nUsed to stay Old Airport Road during my childhood with my family and aunts.\nLast Saturday night (8 Apr 2017) took my aunts back to this hawker centre for dinner. A place that brought back lots of memories.\nIt was 8.05pm on a Saturday night. The hawker centre was packed with people. Mang patrons waited for seats. Queue at most...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d1146830-Reviews-Old_Airport_Rd_Food_Centre-Singapore.html", "type": "restaurant", "location": "Block 51 Old Airport Road Old Airport Road Hawkers' Centre | Geylang, Singapore 390051, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Aquamarine @ Marina Mandarin", "description": "We had a great dinner last night at Aquamarine. The food was okay but the service was exceptional. The lady who lead us explained the food promotion and credit card promo even though the restaurant was busy hence she has a great smile and shes very patient. The staff who attended were so nice and polite. Thank you guys for...\n\n\n\n\n\nGreat fresh food but service staff better. Ms Linda was so helpful and top notch service. Really truly enjoyed the food and attention given to us on 6 May 2017👏👏👏\n\nHighly impressed with the amazing spread of food and excellent service standards.Many many thanks as well to the good service of Miss Evangeline Lacadin who made our dinner a memorable and enjoyable one..❤❤❤ I came with my friends and indeed we enjoy it..very good food and nice ambience as well...😊😊😊.and one thing my friend really like your ice 🍦 cream.....\n\n\n\n\n\nHad an early Mother's Day celebration with my family of 11 paxs at Aquamarine on 29th April 2017 since i m working oversea. There a great variety of food in Aquamarine catering to different age group. Service is excellent with their attentive staffs. Would like to take this opportunity to thanks Mr Stewart Loh, who goes extra mile to offer...\n\n\n\n\n\nGreat selection of food: seafood, western italian food, japanese food, chinese food, malay food, indian food, local and international sweet food, local fruits, etc. There is durian custard. My friend and I are bewildered by the selection. We spent 3 hours eating.\nGreat service. They cleared your plate away quickly when they saw an empty one.\n\nBeen visiting Aquamarine often due to their halal spread. I must say food are always good and the staff are very friendly. But this time round it was even more better.\nI was serve by a staff by the name of Amandeep. Well she was very effecient in her work. Always smile, and never fail to serve other tables with...\n\n\n\n\n\n\nDear wandysupernova,\nThank you for your kind reviews of AquaMarine. I am delighted that you have been a continuous patron and supporter of AquaMarine and am also glad that Amandeep has made your dining experience here extra special. We’re proud of taking care of our guests and I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector...\n\n\n\n\n\n\nThe ambience was superb. so relaxing and the buffet variety was amazing, The staff was so polite and made my son so happy when they gave him a slice of chocolate cake. Promotion was goos and we had 2 hrs of free parking!\n\n\nDear SakinahDollah,\nThank you for your kind reviews of our F&B quality. I am glad to have brought to you a wide variety of excellent food to you and quality to you, and am glad your son enjoyed his time here with us. I look forward to bring you more offerings and excellent service should you come back again.\nYours...\n\n\n\n\n\n\nBrought family down to celebrate hubby's BD. Didn't expect much as most buffet plcs usually have over rated reviews. However, we were rather suprised by the two very attentive servers who cleared our plates without us having to ask. The best part was every time when they came to clear, they were always in their sweet smiles. With good spread...\n\n\n\n\n\n\nDear Angela C,\nHappy birthday to your husband! Thank you for your kind reviews of our F&B quality. I am glad you enjoyed your time here the restaurant, especially on this special occasion! I certainly am proud to be a part of this memorable occasion and I will share this with the staff. They certainly make a good team! I...\n\n\n\n\n\n\nwonderful service by amandeep.. never fail to say hello to me and my wife whenever we are there... apart from crab.. the cheese pizza was awesome... looking forward to my next visit in mth of Ramadhan.. kudos to the chefs also...\n\n\nDear Nizam N,\nThank you for your kind reviews of our F&B quality and service. Your compliments will be shared with Amandeep and I am pretty sure she will be looking forward to see you again! I look forward to welcome you back again for Ramadan.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\nYours sincerely,\nRyan Chan\nDirector...\n\n\n\n\n\n\nWe were impressed by the wide spread of different cuisines and also the range of nyonya kuehs. Food was above average overall but would highly recommend the sashimi, bee hoon, nyonya chicken, and chocolate butter pudding with vanilla sauce.\nService was average but can't ask more from a buffet. Overall we had a great lunch and would maybe visit again!\n\n\nDear Teoh J,\n! Thank you for your kind reviews of our F&B quality. I glad to be able to make an impression during your dine in here at AquaMarine! I appreciate your reviews and will certainly look to improve on our service levels to our guests. I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector...\n\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d929185-Reviews-Aquamarine_Marina_Mandarin-Singapore.html", "type": "restaurant", "location": "6 Raffles Boulevard Marina Square, Singapore 039594, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "NOX - Dine in the Dark", "description": "I was looking to do something different on a Saturday night out and Nox definitely delivered! The staff were friendly, the cocktails were perfect and the food was great! Definitely recommend for a different yet fun date night!\n\nFun and exciting, waiter and waitress have great service. The 3 course dinner are amazing, good for value\n\n\nHi bl950,\nThank you so much for the review.\nWe are glad that you had and exciting experience and that you enjoyed the service from the team.\nWe hope to have you back again soon! Have a great week ahead.\nKind Regards,\nJose.\n\n\n\n\n\n\nThis is great way to see how good is your sense of taste and how good you are at orientating at dark without any light.\nMust start with saying - we have to wait for a bit and sadly I saw few couples entering before us , even they came much more later than us on our reserved time, but...\n\n\n\n\n\n\nHi Roberts R,\nThank you for the time taken to write this review :-)\nWe are sorry that you had to wait a little longer to go up. Sometimes guests are a little naughty and are a bit late for their bookings, We try our best to not ruin their night and sometimes have to get them up a little...\n\n\n\n\n\n\nMy husband and I went here for dinner recently and thoroughly enjoyed the experience. We opted to have the paired cocktails with our meals and were glad we did. The food was good quality and we enjoyed all our meals, my personal favourites were the pork with crackling and apple and what turned out to be the fois gras, something...\n\n\n\n\n\n\nHi Kim M,\nThank you for the great review.\nWe are glad that you thoroughly enjoyed the experience along with the food and cocktails.\nChef Desmond will be happy to hear you enjoyed the dishes, even the ones you wouldn't normally order :-)\nThank you for the high recommendation as your support means alot to us.\nOnce again thanks for...\n\n\n\n\n\n\nA great evening ironically with friends we have not seen for ages. From the greeting to the moment we left we loved every minute of this experience. I was quite apprehensive before we went and I doubted that I would enjoy it but it was probably one of the most enjoyable meals I have had in Asia. I can't wait...\n\n\n\n\n\n\nHi Benwill79,\nThank you very much for the great feedback!\nWe are glad to hear you had a great time and that you were able to catch up with old friend's.\nWe hope to have you back again soon, We change our menu every 4-5 weeks, Let us know when you are dropping in next :-)\nHave a great week...\n\n\n\n\n\n\nDespite not being able to see anything in the dining room, atmosphere was just like any other eateries that we've been to. We heard families and couples talking(we weren't eavesdropping k haha!) and hosts talking among each other.. The food was amazing, I enjoyed every bowls of my appetizer, main and dessert. Rahamat, our host was very helpful throughout our...\n\n\n\n\n\n\nHi eavesdropper, oops i mean Imaisya :p\nThank you so much for this great review.\nWe are glad that you had an amazing time and that you had the full experience (Tasty Food,Good service and Great Memories).\nThank you for the great feedback about Rahamat. Rahamat is part of the Pioneer team and has been with us since the Opening...\n\n\n\n\n\n\nhi,\ni previously provided a review of this restaurant and at the time, was unhappy about the care taken to cater for my pregnant wife. I have since been in touch with NOX and this appears to have been an individual staff issue rather than a restaurant issue. they have taken this seriously and I would now be happy taking...\n\n\n\n\n\n\nHi matildaness,\nThank you for the time taken to write this review.\nIt has been a pleasure following up on your feedback with you and we hope to have you back again another time.\nHave a great week ahead.\nKind Regards,\nJose.\n\n\n\n\n\n\ni was extremely surprised when i first went in, at first, i had some trouble with my family locating cutlery and other things, but we had a great experience. the food they served was of a great variety, they served different types of tastes for eat course, and even had course-specific drinks(which costs extra) that were suited for each course....\n\n\n\n\n\n\nHi aquinaslek,\nThank you for the review!\nWe are glad to hear that you had a great experience and that you enjoyed the food.\nThe Blind & Visually impaired host's do a fantastic job at taking care of all guest's upstairs in the dark and it is definitely a great experience putting our trust into their hands and stepping into...\n\n\n\n\n\n\nIt was such a wonderful experience. The staff was very friendly. We definitely got what we came for. It was a different world for us. Dining in the dark enhances the taste buds I guess because the food was very delicious. Of course kudos to the chief as well.\n\n\nHi 349incik,\nThank you for the time taken to write this review.\nIt's great to hear that you had a wonderful experience and that you enjoyed the service from the NOX team.\nThanks for the compliment on the food and we will pass it on to Chef Desmond.\nHope you have a great week ahead.\nKind Regards,\nJose.\n\n\n\n\n\n\nThank you for the unique sensory experience of dining in the dark. The flavours and texture of the food were amplified when we could only rely only on our sense of taste, touch, and smell. My sons also enjoyed being exposed to dealing with the pitch black situation new and unfamiliar to them, as well as the Easter Egg Hunt...\n\n\n\n\n\n\nHi Jessica G,\nThank's for the great review!\nThank you for choosing NOX - Dine in the Dark for your special family dinner on Easter Sunday.\nWe are glad that you gained a deeper appreciation of the things that we sometimes take for granted in life as that is also a big part of the NOX experience.\nThank you for...\n\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d4611806-Reviews-NOX_Dine_in_the_Dark-Singapore.html", "type": "restaurant", "location": "269 Beach Road, Singapore 199546, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Rhubarb", "description": "Fantastic little restaurant,we decided on the set menu,exceptional food a wine list to match excellent staff.\n\nIt is only a small restaurant, with only 7 tables on the night we were there. The food though is innovative and presented well. Extensive wine list, and the maitre de was only too willing to assist in recommendations to match the food selection. It is a special occasion restaurant, as it is not a cheap eat, but worth the...\n\n\n\n\n\nI had expected to be wowed, but although I had a largely pleasant meal here, at no stage did I have that feeling you get when you put something in your mouth and it delights, surprises and amazes you.\nThe chef relies on luxury ingredients---caviar, truffle, foie gras, king crab, toothfish. And yet he then detracts from them by combining...\n\n\n\n\n\nPLEASE VISIT MY WEBSITE FOR FULL REVIEW AND PICTURES AS WELL AS REVIEWS OF OTHER TOP RESTAURANTS AROUND THE WORLD\nOverall rating: 7.5/10\nI’m usually a bit skeptical of restaurants that are praised on Tripadvisor, as many ordinary cafes and places that are not even proper restaurants make it to top 10 in a given city. But I was glad...\n\n\n\n\n\nWhat a great little find!\nAmazing Chefs Menu and paired wines were out of this world. Ellie gave amazing referrals for other great local restaurants. Must book (only 7 tables) but so worth it. The service and food were some of the best I have had with awesome presentation!\n\nAlthough the food was good, the prices are very high. Service was OK. Can find better value elsewhere.\n\nSuperb\nThe most delicious food we have eaten anywhere in the world.\nCannot praise this restaurant highly enough. Ambience is calm and comfortable, plenty of space between tables, carpeted floors and beautiful simple elegant decor\nService was exemplary. Waitress knowledgable, friendly, polite but not intrusive.\nWe had the wine pairing menu and found the charming Sommeliers recommendations perfectly complemented the...\n\n\n\n\n\ngood food off the ala carte menu, staff were friendly and prompt, nice ambience, would definitely come back again\n\nA spectacular and reasonably priced lunch at Rhubarb le Restaurant. A french styled Michelin starred restaurant in the centre of Chinatown, Singapore. We did get an amuse bouche and petit fours too and plenty of freshly baked bread.\nUnlike the two other starred restaurants we ate in on this trip, this one was what I'd consider to be a proper...\n\n\n\n\n\nI've tried a lot of French fine dining places in Singapore. I had seen on TripAdvisor that Le Rhubarb was ranked #5 and so decided to go with my boyfriend.\nThe atmosphere is very nice, pure almost minimalistic, Japanese style. The service is really good, Jerome and Francis did a great job at serving us and providing advice on the...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d7060741-Reviews-Rhubarb-Singapore.html", "type": "restaurant", "location": "3 Duxton Hill, Singapore 089589, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Entre-Nous creperie", "description": "As good as in Brittany! Excellent crepes and salted caramel. good cider as well. Nice Brittany pictures in the wall And friendly staff.\n\n\nThank you very much Cecile for this great review!\nWe are very happy that you love our authentic Brittany crepes, homemade salted caramel and imported artisanal cider.\nWe hope to welcome you again soon!\nGeraldine\n\n\n\n\n\n\nMy husband and I first came here in late 2010. It was one of our best dates (also because he is French and I love crêpes). Since then, we came here quite regularly and to dine during special events (Valentine's, Christmas, New Year's and Anniversaries). My favourite crêpe is the Geraldine's Favourite- it is with chicken drizzled with caramelised onions,...\n\n\n\n\n\n\nDear Miza,\nthank you so much for your words that means a lot to us!\nThe best reward in what we do is having guest as you and your husband that keep coming back during years, almost since day 1 and even after moving to Paris you don't forget us.\nAnd you could come back in years, we would still...\n\n\n\n\n\n\nA great recommendation from a French friend. The galettes and crepes were amazing! Even the milkshakes were divine. Will definitely come back!\n\n\nThank you very much Abi for praising our food! we are very thankfull to our regular customers who recommend entre nous to their friends, because we believe that word of mouth is the best advertissment.\nThat's why we appreciate that you also spread the word.\nWe are looking forward to welcome you again soon!\nGeraldine\n\n\n\n\n\n\nLovely family restaurant with a homey kind of vibe. We go there at least once a week ever since we discovered it. It specialises in Crepes, they have savoury crepes, gastronomic crepes if you are looking for more sophisticated flavours and sweet crepes.\nThey also serve great wine, home made cider beer, liqueurs and coffee.\nGreat Service and Value for...\n\n\n\n\n\n\nThank you so much Paulina for this great write up!\nWe are always happy when when we have happy customers leaving our restaurant but even more when they become regular guest.\nWe sincerely thank you for your loyalty!\nSee you again soon.\nGeraldine\n\n\n\n\n\n\nCame here for dinner! Love the pretty quiet environment :D good for conversations! The savoury crepes were awesome and did not disappoint me!!\n\n\nThank you very much for this great review!\nWe are very happy that you love entre nous simple but cosy environment and most importantly that you love our traditional galettes!\nWe hope to see you again soon.\nGeraldine\n\n\n\n\n\n\nSimply the best crepe in Singapore, portion is big, everything was fresh and delicious. Will return in no time\n\n\nThank you very much Cindy for this great review!\nWe are truly happy that you love our crepes that much.\nWe are looking forward to welcome you again anytime soon!\nGeraldine\n\n\n\n\n\n\nIf you want to feel in Brittany, entre nous crepes take you there: the crepes are amazing and the people friendly, like in Brittany.\nSome of the crepes are named after beautiful location, like Glenan and Groix. You should look it up to complete the experience...\n\n\nThank you very much for your kind words Lucille!\nWe are very happy that you love our crepes as well as the authentic Brittany feels that we translate even through the names given to crepes in our menu.\nSee you again soon.\nGeraldine\n\n\n\n\n\n\njust went for dinner last night, the owner was attentive and friendly. crepes were very good, especially loved the crepe with avocado mixed with cream and garlic, with fresh prawns and tomatoes.\n\n\nThank you very much Claire for your kind words!\nWe are very glad that you loved our signature \"entre nous\" savoury crepe.\nWe hope to welcome you again soon to try some more, or to have the same one again ( most of our regular guests eat the same crepes again and again!)\nGeraldine\n\n\n\n\n\n\nRead rave reviews about this place and just had to pay a visit due to my wife's dietary requirements.\nVisited on a Saturday evening and had to sit outside as we hadn't made any reservation.\nReceived a very warm welcome from Geraldine who is a delightful hostess.\nPlenty of fillings to choose from and one crepe is satisfyingly sufficient. You...\n\n\n\n\n\n\nThank you very much for your kind review! We hope that you had a pleasant flight back to Manchester.\nThank you for dining with us twice during your stay here.\nWe are looking forward to welcome you again on your next vacation in Singapore!\nGeraldine\n\n\n\n\n\n\nWe know the creperie \"entre-nous\" for the past 9 years, and we have never ever been disappointed by the quality of their food. Their crepes are just delicious! If you want a cultural and culinary experience made in Brittany, this is the place to go in Singapore. Well done to Stephane and Geraldine!\n\n\nThank you very much for your nice words Celine and for your loyalty over all those years!\nWe are glad that you appreciate our Brittany crepes.\nSee you again soon!\nGeraldine\n\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d1193730-Reviews-Entre_Nous_creperie-Singapore.html", "type": "restaurant", "location": "27 Seah Street | Suite 01-01, Singapore 188383, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Restaurant Andre", "description": "An interesting experience - food was carefully planned and prepared by skilled chefs. A degustation menu was intricate and clever. The matching wine tasting was enjoyable and they presented one of the best champagnes I have ever sampled. Not all meals were to my taste but it was a positive experience. Take your check book. Cost for 3 was $2200.\n\nRestaurant Andre is one of the few restaurants in Singapore that gives that intimate and personal experience through the culinary journey and romantic surrounding; the others I could associate are Odette and Les Amis.\nIts standalone building in the historical location where old shop houses were still preserved gave a sense of nostalgia and romance.\nMy wife and I visited...\n\n\n\n\n\nThis is one of the best and most amazing culinary experience ever. I have been to several Michelin restaurants and top world restaurants; however what set this apart from others is the element/themes chef Andre puts in each of the dish. You can taste not just the elements, but really feel the story and uniqueness behind each dish. Of course,...\n\n\n\n\n\nWe had been looking forward to dining at Andre's since the time of booking, which was well in advance.\nThe whole experience from service to quality of food and the personal attention to detail by the owners was exceptional. Plenty of reviewers have already given details, so won't repeat the accolades.\nWill we be back, definitely.\n\nThis is the second time I've been to restaurant Andre and it didn't disappoint. Granted the last time I was there was three years ago and I had forgotten some of the dishes I was served there. The service was impeccable and the ambiance was lovely. The food was delicious and there was only one dish that I didn't really...\n\n\n\n\n\nI must say that this is the second time, I have been dining at Restaurant Andre. The first time was 2 years ago and I must say I was blown away. The overwhelmingly excellent reviews speak for themselves and Andre is in the top 50 Restaurants of the world not without reason.\nComing back after two years, I was very...\n\n\n\n\n\nI've been to over 30 michelin 3stars restaurant all over the world, Most of Andre dishes are weak and lack in finesse in my opinion, a lot of it is a copy of other michelin restaurant that's presented differently but weak.\nAlso I don't think Andre understand what 3 star michelin service is or he just take advantages of singaporean...\n\n\n\n\n\nProbably one of the best meals I have had in my life! The service, ambience,food presentation and description and taste were unbelievable. This is an opportunity not to be missed by anyone interested in food. Just superb.\n\nDeservingly a 2 Michelin star restaurant, from the concept to the execution with excellent wine recommendations from the in-house sommelier. Worth the reservation waitlist.\n\nwoo super amazing meals ...\nwhat a pleasant surprises in between courses\nxceptional service with very dish beautifully crafted and presented as a work of art. The philosophical menu is based on Chef Andre's “Octaphilosophy” theme of eight dishes, representing Pure, Salt, Artisan, South, Texture, Unique, Memory and Terrior. An Innovative Michelin Stars dinning experience and truly deserving of its...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d2077234-Reviews-Restaurant_Andre-Singapore.html", "type": "restaurant", "location": "41 Bukit Pasoh Road, Singapore 089855, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Colony", "description": "Colony is probably the best buffet line in Singapore now and the crowd is a sure sign that it is. The selections are extensive and the quality great. I seldom say this, but even the Laksa and Burbur Cha Cha, dishes you do not associate with buffets tastes great. The only bugbear is that it was crowded on a saturday...\n\n\n\n\n\nit was our 2nd visit (4 pax) on 5-5-2017 for colony's buffet dinner. food quality & selection still as good . very beautiful and cosy table settings, great atmosphere. staff always friendly and attentive, especially Raj, always making sure everything's well taken care of. we are very happy with his service. very professional.\n\nWas there on e 29h April to celebrate a birthday. Great ambience, good selection of quality food and excellent service rendered by the staff especially Firdausi. Will definitely visit again!\n\nthey have many selections of food for breakfast.\nfor me, their selection for fruit and yogurt made so happy.\nthey have chinese, japanese, and western food also.\n\nNot really a fan of buffet because of the quality of food they are serving - but Colony was an exception! They really have good quality food and a wide variety from Chinese, Western and also local cuisine! Too bad I couldn't try everything! Next time I'm in Singapore, I'll go back and try it again!\n\nSpendid experiences, the service is great, the ambience is very nice, the buffet selection is great and the quality is good!\n\nThere are many variety of food. And the sea food is very fresh. Excellent service. Will visit again.\n\nIt was our 2nd time my family dined at Colony and we are still love it. The spread is awesome, varied and of top quality, They even have a freshly pressed juice station which I relish. The food selection ranges from meats, cold cuts, fresh seafood, sashimi, dessert, local cusine...the list goes on... Service is impeccable as the staff are...\n\n\n\n\n\nMy wife and now count Colony's seafood buffet dinner as one of our best restaurant experiences, and best nights out, in town. The food is great and there's always something new, and we can spend the whole evening there enjoying the ambiance and having a great time away from our daily routine. The wait staff are always top notch and...\n\n\n\n\n\nAwesome food choice and excellent service.\nEspecially from Kethish and Auntie Angie.\nMy favorite would be the raw salmon and the chili crab!\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d8571637-Reviews-Colony-Singapore.html", "type": "restaurant", "location": "7 Raffles Avenue Ritz Carlton Millenia Singapore | The Ritz-Carlton, Millenia Singapore, Singapore 039799, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Fratini La Trattoria", "description": "Our family visited for lunch on a Tuesday, and we were glad we had reservations! This chef-owned restaurant isn't very large, but it's worth the wait! The head chef came to our table several times to help us chose a family-style menu and accommodated the no-shellfish requirement of my sister-in-law while allowing the rest of us to enjoy shrimp. A...\n\n\n\n\n\nWas here on a surprise date. No idea where it was but my heart was beating with excitement as soon as they sat us down. They have a surprise menu, molecular dining. Each course is better than the other. The service is wonderful and the food is phenomenal\n\nAmazing restaurant, with perfect restaurant. And wonderful atmosphere. A offer everyone this restaurant.\n\nIt was a very good experience,their stuffs were very polite and the food was marvelous too. We will hope to go back soon\n\nHad many omakase meals before but italian omakase is a first for me. Chomel was very detailed when explaining the dishes. all the dishes were executed well. will definitely be back again with my family !\n\nWe visited for lunch on a Sunday.\nFood\nThe food lived up to my expectations, and I especially loved the appetizers and dessert. Main course was a tad short, portion a bit big.\nService\nOur waitress served and explained the dishes well, even though she did seem a bit unwilling.\nOverall, I loved the experience and would definitely visit again...\n\n\n\n\n\nThat was really a good surprise to find an original Italian food in Asia.The atmosphere is always great and have yet to find better Italian food anywhere in the city.\n\nWe've been in Singapore 18 months now and can't believe we just now found Fratini La Trattoria. I hesitate to post only because it's a small restaurant and very quaint ... had hoped to keep it a secret. I see how ever that the word is out on Trip Advisor so now I know why reservations were required.\nMy husband...\n\n\n\n\n\nmy first time to dine this Restaurant ..\nfood was Really good ..flavour was perfect .\nI like the cappuccino soup...\nwill definitely Return Back to this place\n\nIf you are someone who appreciates fine food, you'll love this place. A true celebration of exquisite Italian cuisine, prepared by a chef who is passionate about serving and​ delighting​ her guests. This is not a cheap place, nor somewhere to go if you're in a hurry. We went as a celebration for our last night in Singapore and loved...\n\n\n\n\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d4930299-Reviews-Fratini_La_Trattoria-Singapore.html", "type": "restaurant", "location": "10 Greenwood Avenue | Hillcrest Park, Singapore 289201, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "The Curry Culture", "description": "Had a nice meal here as a couple this week. W didn't fancy a starter and just went straight for the main courses. I opted for Bhuna Gosht which was delicious with large chunks of lamb through it. My wife went for Butter Chicken and whilst it was very tasty, the chicken was so tender that it had already broken...\n\n\n\n\n\nthis is only place I have my favourite indian food yummy taste of paprika chat, naan, kebab...wow... I love it,,no other cuisine I found like the taste of indian cusine...place is net and clean,friendly stuff...\n\nLovely Indian food, really tasty and great service. This place is only let down by the toilets which are in a terrible state, ended going to the nearby bar instead!\nSuch a shame but the state of the loos makes you think about the general hygiene.\n\n\nDear Shyman21\nGreetings from the Curry Culture\nSir, thank you for your lovely feedback and for Dining with us- very happy that we were able to live upto your expectations vis a vis the food and service - we try:):)\nSincere apologies on the state of the restrooms - sometimes during busy times we do have issues with the napkins...\n\n\n\n\n\n\nTraveling alone in Singapore, I decided I wanted to eat good Indian food. I love Indian food and eat this cuisine whenever I have the chance when traveling. The food at The Curry Culture was outstanding as was the service. The wait staff made every effort to ensure I ordered well, selected the right level of spiciness and was happy...\n\n\n\n\n\n\nDear Carmen G\nGreetings from the Curry Culture\nMam, such a pleasure to read your feedback - always a great feeling when we get such genuine respect from someone who knows and understands Indian food- Mam , single dining can sometimes be a bit of a bore and I am very happy that the boys took good care of you....\n\n\n\n\n\n\nI'd definitely return to this one. Delicious food, nice atmosphere, warm service. Seems to be equally popular with locals, expats and tourists. Outdoor dining but at this time of year was very pleasant.\n\n\nDear Laptop_Dancer ,\nGreetings from the Curry Culture\nSir, A pleasure and yes, we would love to have you dining with us again:):)Yup , we seem to be fairly popular and I think I can attribute that only one - our genuine passion and the love and respect that we get from all our guests - very very blessed\nAbsolutely...\n\n\n\n\n\n\nThis is my best ever dinner experience. Their Service to customers are awesome which helps to a fine dinning. Mr.Jimmy and Mr.Prashanth, these guys are doing a great job and also other staffs who welcomes us and serves drinks with a smile. A must visit restaurant in Singapore.\n\n\nDear Sonu J\nGreetings from the Curry Culture\nSir, what can I say - honestly don't think we are deserving of such effusive compliments- but thank you very much - Yes, all the boys are superstars:):)- very very passionate with what they( including the Kitchen Team) and I think that I am very blessed that they choose to work with...\n\n\n\n\n\n\nAnd that's saying a lot! I've been lucky to have some incredible Indian meals( my favorite!) on my travels around the world and this is place sets the bar pretty high! First of all, it's a bit pricey, one of our most expensive meals in Singapore. Not over the top, but pricey, but unless you are eating at a local...\n\n\n\n\n\n\nDear elizacass\nGreetings from the Curry Culture\nMam, again, what can I say- huge huge compliments and it is truly a humbling experience when we become your \"best meal ever\" :):)\nMam, have said this before as well - we actually try to keep it very simple - authentic and genuine, that is whole ethos( yes, the boys put in...\n\n\n\n\n\n\nThis is a fun place ... lots of restaurants in cuppage terrace and even on a sunday night most of them were busy.\nWe hadnt booked but the staff were friendly and found us a spot outside\nThe food is amazing - extensive menu and something to suit everyones tastes. really yummy\n\n\nDear emmadar\nGreetings from the Curry Culture\nMam, a pleasure and yes, you nailed it on the head- we do try to have fun , life can be a bit boring if it is cut and dried isn't it?? And nothing better than having guests who like a bit of a laugh and banter :):)\nAlso very passionate about what...\n\n\n\n\n\n\nOn our final evening in Singapore, the hotel concierge suggested we dine at Curry Culture.\nHe phoned through for reservation, but through some miscommunication, we discovered it was closed! It was Robertson Quay that was under renovation.\nThe hotel then contacted them and as an apology, Curry Culture invited us for lunch the following day at Cuppage Terrace with their...\n\n\n\n\n\n\nDear GurdonGolfer\nGreetings from the Curry Culture\nSir, thank you and Apologies for Robertson quay - we are renovating for a better experience :):)\nSir, it is always a pleasure when we can live upto the expecatations ( I must say that the concierge has very good taste though:):)) and especially when the compliments come from someone who has dined...\n\n\n\n\n\n\nWe enjoyed a fantastic meal here in 2013 so it was a no-brainer to rebook for a recent trip to Singapore.\nWe were seated outside & enjoyed another extremely enjoyable evening. The menu and the food were excellent, as was the service.\nIf you like Indian food and are in Singapore, this restaurant is a must.\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d3512529-Reviews-The_Curry_Culture-Singapore.html", "type": "restaurant", "location": "31 Cuppage Road Cuppage Terrace | Cuppage Rd, Singapore 229457, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""},
{"title": "Summer Pavilion", "description": "My wife and I visited Summer Pavilion from time to time and we always found it to be a blissful experience.\nThe high ceiling, the sense of space, tasteful decoration, and the view of the well maintained Chinese garden through the large windows often gave us a luxurious feel and to an extent a modernized interpretation of the gardens in...\n\n\n\n\n\nEverything about this lunch was fantastic. Incredibly good and attentive service, everyone that served me was warm and welcoming. The restaurant is a calm and relaxing place to be.\nI ordered dim sum from the lunch menu and it was all delicious - highly recommend.\nFantastic restaurant, check it out if in Singapore.\n\nWe showed up for a weekday lunch expecting the restaurant to be barely filled. Turned out it was full and I secretly commended myself for almost always making a reservation as long as I know where I'm heading for a meal.\nYes, do note that this Chinese restaurant was filled on a work day afternoon so remember to make a...\n\n\n\n\n\nIt is not only beautiful display but also great food.\nVery special Chinese food as high quality with very fresh.\nWonderful service.\nI really enjoy dinner set menu.\n\nWe were a foursome for lunch at the Summer Pavillion. The couple who were Singapore residents ordered Peking Duck and a wonderful variety of small plates.\nThe staff was attentive, quiet and the service smooth.\nAll courses were based on the very freshest ingredients. All courses were exquisite.\nThe mango, pomelo, sago dessert was new for us and a wonderful...\n\n\n\n\n\nHas been a patron of this restaurant for many years now. They had a recent renovation and have also been awarded with one star Michelin.\nThe short dim sum list is good enough. The fish meat noodle with lobster meat is a must-try!! I can't rave enough about this. I must have this each time I'm there. If I have...\n\n\n\n\n\nOur family like the restaurant very much; we occasionally have our Sunday brunch there. Service staff is great as with most 5-star hotel restaurant.\nThe DimSum selection is very good and some of the items are uniquely prepared by this restaurant’s chefs.\nMy wife and I particular love the ginger-vinegar pork trotters.\n\nThe minute you walk into this beautifully appointed restaurant you know you're in for a special meal. The decor is contemporary and relaxing. The host took us to our reserved table in a booth. It was fully set with dishes of soy and sweet chilli.\nThe waitress came promptly with four separate menus per person. And she took drink orders....\n\n\n\n\n\nWe have eaten here many times before. The setting is refined and is a western style restaurant and the service is very much Michelin. We had three dishes of which 2 were excellent. The first was asparagus wrapped in bamboo and the second a terrific grilled fish from their live fish menu. The third dish was their signature crispy skin...\n\n\n\n\n\nPosh environment. Spacious setting. Exquisite cutlery. Attentive service. Michelin-starred food. What more can I say? I highly recommend for a business lunch.\n", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d796940-Reviews-Summer_Pavilion-Singapore.html", "type": "restaurant", "location": "7 Raffles Avenue | The Ritz-Carlton, Millenia Singapore, Singapore 039799, Singapore ", "image": "", "price": 0, "channel": "", "category": "event", "time": ""}
]