[{"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "北市府慰留簡余晏失敗 傳局長由市府副發言人陳思宇接任", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312664", "time": "2018-01-15 19:04", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_php4WIH7q.jpg", "description": "〔即時新聞／綜合報導〕台北市觀傳局長簡余晏向台北市長柯文哲請辭，柯文哲日前更罕見地要求副市長陳景峻慰留簡余晏，並讓簡余晏休假一個月。不料今（15）日中午，簡余晏突然退出所有北市府公務LINE框，宣告市府慰留失敗。有消息透露，目前觀傳局長的位置，將由市府副發言人陳思宇接任。根據《蘋果》報導，市府在慰留簡余晏失敗後，有市府幕僚透露，觀傳局長的位置，預計將由目前市府副發言人陳思宇接任。該幕僚進一步表示，市長柯文哲已在上週告知陳思宇，請她出任局長一職，接下來只要簡余晏請辭流程跑完，陳思宇就能升任觀傳局長。陳思宇是現任台北市議員陳建銘的女兒，曾任簡余晏的機要秘書，該幕僚指出，陳思宇對觀傳局業務熟悉，轉戰副發言人後，辦理行動市政議會也有不錯的迴響，接任觀傳局長的可能性高。但市府發言人劉奕霆表示，目前簡余晏的辭呈仍在副市長陳景峻手上，柯文哲認為急事緩辦，陳景峻也持續與簡余晏溝通，因此目前並沒有所謂局長接任人選的討論。陳思宇則表示，她目前沒有接獲柯文哲的徵詢，一切尊重長官決定。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "立委選區重劃 中選會：選區劃分方案最晚5月底提出", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312671", "time": "2018-01-15 19:03", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_phpUl1ZLi.jpg", "description": "〔記者陳鈺馥／台北報導〕中選會主委陳英鈐今日表示，中選會明日將召開委員會，討論第10屆立法委員名額分配及選舉區，關於席次增減目前尚未定案，中選會更沒有拖延情事，最晚是在今年5月底以前提出選區劃分方案。陳英鈐指出，新竹縣若採第7屆選區方式計算將多一席，若按照第4屆選區方式計算，立委席次將維持不變，中選會都還沒定案，須在委員會上進一步討論，上週新竹縣曾來拜訪，已向其說明清楚。陳英鈐強調，外界似乎有些誤解，認為新竹縣是要採第7屆選區方式計算，所以會多一席，但完全不能這樣解讀，中選會提及第7屆，是指以第7屆立委名額113席的人數及規模為主，並非已決定採第7屆選區方式計算。陳英鈐提及，選區席次調整會根據各縣市人口變動來計算，中選會近期有部分縣市意見，有桃園市、台中市、台南市、高雄市、彰化縣、宜蘭縣6個縣市希望採第4屆選區方式計算，新竹縣、南投縣及嘉義縣則認為要採第7屆選區計算方式。陳英鈐說，各縣市意見都會在委員會上加以討論，再進一步決定要採取什麼選區劃分方案，結果絕對是公平公正。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "金介壽參選新北市長 周錫瑋：應該支持", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312694", "time": "2018-01-15 18:56", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312694_1.jpg", "description": "〔記者何玉華／新北報導〕國民黨前新北市議員金介壽今天在媒體刊登半版廣告宣布參選新北市長，文中質疑高民調的侯友宜與綠營關係，要求國民黨初選要納入黨員民意，另一爭取提名的前台北縣長周錫瑋稍早也發表聲明表示，金介壽的參選理念應該支持，不能視為破壞國民黨的團結。周錫瑋稍早透過LINE的媒體群組發表對金介壽刊登廣告宣布參選的看法，文中提到，非常樂見金介壽共同參與，提升國民黨新北市長的能見度。真正的民主精神是選賢與能。但是今天大家憑靠的是「知名度」，無法了解候選人的賢與能。還說，國民黨目前的提名辦法更是沒有「初選」只有「民調」，2月27日參選人資格審查過接著3月2日就開始民調，為的就是表面的和諧和怕輸的團結，完全扼殺了選民和黨員知的權利。周錫瑋辦公室認為，除了金介壽的質疑外，侯友宜也會面臨有沒有以副市長的身分，利用政府資源拉抬聲勢和民調？這些侯友宜都必須要面對澄清。強調和諧是良性的競爭，不是偏袒的鄕愿，團結是理念的認同，不是矇騙過關。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "由兒子接棒？ 南市議長賴美惠說出心內話", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312682", "time": "2018-01-15 18:54", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312682_1.jpg", "description": "〔記者蔡文居／台南報導〕今年台南市議員選舉，不少資深議員決定交棒，由第二代接手參選。其中，議長賴美惠的兒子李宗翰近來勤跑基層，也引起外界臆測。賴美惠今天下午在議會對媒體公開說出她內心的想法。她說，她尊重兒子的決定，今年過年前，也會邀集所有親友商討是否由兒子接手投入參選議員。賴美惠的兒子李宗翰今年27歲，曾擔任立法院副院長蔡其昌的國會助理，去年因賴美惠先生、前後壁鄉長李本源過世，李宗翰在該期間返鄉協助其母親賴美惠跑行程，而引起外界臆測，認為他將接棒參選。賴美惠連任6屆議員，原為台南後壁、白河及東山區選區，今年則與新營、鹽水、柳營區合併為一選區。現有席次為民進黨3席、國民黨2席、無黨籍1席。賴美惠表示，由於去年他兒子剛好回來幫忙跑行程，大家看到他口條、台風穩健，也無政二代的氣習，認為他是可以栽培之才。之後，開始有人放出他將接棒風聲，而她也是被外界詢問後才開始思考這問題。她說，政治是很辛苦的一條路，無法像一般人一樣陪伴小孩、家人，因此當初，她從政時，他兒子才3、4歲，就懷疑是否媽媽不愛他，所以沒有陪他。這次，他返鄉自己實際跑行程也才體會到政治人物沒有時間，甚至沒有自己的空間，也化解他自己內心多年來的疑慮。賴美惠說到昔日種種，不禁感傷，眼眶泛紅。賴美惠說，政治很辛苦也很險惡，得面對各種挑戰，這是很慎重的選擇，現在讓他自己去跑、去闖，她以媽媽的角度，孩子有這孝心，也體會媽媽的辛苦，是否接棒？就讓他好好去評估，他的抉擇她會尊重，也會全力以赴來協助。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "大動作批侯友宜 金介壽這麼說…", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312641", "time": "2018-01-15 18:49", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312641_1.jpg", "description": "〔記者何玉華／新北報導〕前國民黨新北市議員金介壽今天以半版廣告宣布參選2018新北市長，內文質疑向來高民調的副市長侯友宜與綠營的關係，金介壽受訪表示，他與侯友宜無仇，是站在捍衛藍營最後一都的理念，希望朱立倫放手，慎選接班人。金介壽說，「民調可信嗎？」指現在的民調可以花錢、人為操作，「沒有藍綠，只有向錢看」；他說，國民黨要拿下其他都都是作夢，只有新北這一都有可能。金介壽也坦承，去年11月29日自稱「決戰2018深藍聚落聯盟」及「反對諸侯綠化國民黨聯盟」在媒體刊登「吳主席您該上手了！朱市長拜託放手吧！」的半版廣告，是他所為，他質疑朱立倫識人不明，先有許志堅、再有王如玄，不希望再有侯友宜。對於之前曾表態參選市議員，金介壽說，議員選不選不重要，市長選舉是大是大非的問題，他有個人的理想，不是個人的打手，而是中華民國、中國國民黨的打手；並說侯友宜參選，他也將參選到底。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "傳與花媽團隊有協議？ 趙天麟：充滿問號", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312659", "time": "2018-01-15 18:46", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312659_1.jpg", "description": "〔記者王榮祥／高雄報導〕民進黨立委劉世芳退出下屆高雄市長黨內初選後，傳出菊系支持能量可能移轉立委趙天麟﹖甚至在市府人事也有了默契﹖還有人猜測趙可能跟另名參選人整合﹖趙天麟今表示，對相關說法充滿問號﹗趙天麟進一步指出，如果有同志願意整合，他也願意考慮，但前提是別提派系，要把重點放在勝選﹔他認為外界老是談派系，講到市民都膩了，現在的選舉應該講政見，清楚告訴市民朋友參選人的理念，他的理念就是要帶領高雄市民，在經濟上衝出一條活路。儘管間接否認與菊營團隊有默契，但今天趙天麟團隊動員傍晚舉行誓師大會上，有2位曾擔任陳菊後援會的幹部現身，分別是許文欽與黃信學。趙天麟則說明，陳菊是高雄共同的領航員，2位陳菊後援會的大老，同時也是他競選立委時的後援會幹部，今天純粹來替團隊加油打氣。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "傳菊營轉支持趙天麟？ 花媽幕僚否認、批有心人士放話", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312672", "time": "2018-01-15 18:42", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_phpRvQhvW.jpg", "description": "〔記者王榮祥／高雄報導〕針對外界指稱劉世芳宣佈不登記市長初選後，陳菊團隊將與趙天麟合作﹖高雄市政府幕僚今鄭重否認，並強調此為有心人士刻意放話，同時強調市長祝福每一位願意為高雄付出的參選人，期勉共同為高雄努力打拚，亦盼透過黨內民主制度完成選舉提名。地方人士則分析，劉世芳不登記初選後，已能凸顯、保全陳菊的高度，真的沒必要在此時又表態挺誰，陳菊跟劉世芳沒那麼沒原則﹗"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "「蔣公」銅像見證！台東「最後黨國學校」走入歷史", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312658", "time": "2018-01-15 18:40", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312658_1.jpg", "description": "樂山國小「蔣公」銅像今移除，見證「黨國學校」拆除。（記者黃明堂攝）［記者黃明堂／台東報導］樂山國小堪稱台東「最後的黨國學校」！廢校25年，幾乎完整保留復興民族思想教育的標語及圖騰，今天拆校，將片瓦不留，土地還給大自然。從標語、漫畫到銅像，國民黨黨國教育的樣板在台灣各校園已消失幾乎殆盡，樂山國小得天獨厚，一來早在82年即廢校，二來隱身山林，思想教育遺跡得以低調保留了25年。昔日進大門就是每天思想教育的開始，蔣公銅像微笑問早，到校舍中央的中走廊，兩側各有「置個人死生於度外、以國家興亡為己任」的標語，這副對聯不只在這裡，在邊牆，甚至教室的黑板上方都無所不在。學生們接受思想教育，也要付諸行動，於是，中走廊的牆上有自強救國畫報，以漫畫表達「滅共匪，為民族除害」；學校面向道路的外牆也有大中國地圖，寫著「實行三民主義，復興中華民族」，讓路過的民眾也能接受黨國洗禮。一層樓的校園建築平實無華，但「黨國色彩」成為山中小學的一大特色，很多民眾到此秘境，都少不了跟這些政治圖騰合照。今天校門口的民族救星基座先被打掉，「蔣公銅像」拆下放到工程車上，見證因「他」而起的黨國學校走入歷史，標語圖像則化為瓦礫，在民眾腦海成為回憶。樂山國小今起拆除，在瓦礫堆前還可見「以國家興亡為己任，置個人死生於度外」標語。（記者黃明堂攝）樂山國小牆上的自救救國畫報有「減共匪為民族除害」漫畫。（記者黃明堂攝）教室窗戶抬頭也見標語。（記者黃明堂攝）樂山國小外牆的大中國地圖，及「實行三民主義，復興中華民族」標語。（記者黃明堂攝）"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "陳師孟：國民黨撥2千兩黃金 給王惕吾創辦聯合報", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312115", "time": "2018-01-15 18:00", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_phpiJdnEy.jpg", "description": "立法院院會「行使監委同意權案」詢答，監察委員被提名人陳師孟。（記者王藝菘攝）首次上稿 10:49更新時間 18:00（補聯合報說法）〔記者林良昇、楊明怡／台北報導〕立法院臨時會今處理「行使監委同意權案」，監委被提名人陳師孟在回應時代力量立委林昶佐詢問時表示，蔣介石下野後，收了國庫署撥的9萬兩黃金，其中2千兩撥給前國民黨中常委王惕吾創辦聯合報，他說，聯合報第一桶金也來自黨產，黨產會要加以注意。立法院臨時會全院委員會今早進行「行使監委同意權案」，對陳師孟、楊芳玲、楊芳婉、趙永清、蔡崇義等5位監委提名人進行詢問。陳師孟在回應民進黨立委蘇巧慧時表示，馬政府執政8年，才看出監察權的重要性，監院不該成為行政院的干擾，台灣司法過去有不中立和不自主，監院的剩餘利用價值來自於制衡司法，他若成為監委，要「三分打老虎，七分打恐龍」。陳師孟強調，他若成為監委，調查的案件會有三種，第一是過去司法對於綠營總統、政務官的追殺，司法用了很多不合實質正義的手段；第二是過去司法對於藍營的總統、政務官的縱放行為，例如前總統馬英九洩密案，一、二審法官很多莫名其妙的法律見解。陳師孟指出，第三則為過去對於國民黨黨產的處理，國民黨將黨產會案件提到法院來拖延時間，有些法官也順從國民黨想法，對黨產會做出不利的判決，這都是他會注意的。林昶佐則一起詢問5位監委被提名人，未來要如何處理個人或組織在戰後趁亂將國家財產登記在私人名下的案例；陳師孟回應時指出，有本叫做「黃金往事」的書，書中寫蔣介石下野後收了國庫署撥的9萬兩黃金，其中的2千兩撥給王惕吾，聯合報的第一桶金來自黨產，這些案例黨產會要加以注意。對於陳師孟稱聯合報是黨產的說法，國民黨發言人鍾沛君回應表示，民進黨政府的不當黨產處理條例，已被高等行政法院認為恐有違憲之虞，現在陳師孟看本書也能當指控的證據，讓人憂心未來監院辦案品質。聯合報是不是國民黨產，民眾沒有這麼好唬弄，倒是華視快要成為民進黨產，全民都看在眼裡。鍾沛君也說，過去陳師孟數度公開表示司法「辦綠不辦藍」，踐踏司法人員尊嚴，甚至以「廢物利用」形容彈劾權，國民黨對蔡政府執意提名如此輕賤五權分立的人選感到遺憾，國民黨會更加努力拿回政權，才能杜絕這種荒唐人事禍亂台灣。聯合報稍早則以聲明回覆，陳師孟的說法「僅憑一本書中推測，未見任何確切證據，本報深表遺憾。」聲明也提及，聯合報草創之初，由王惕吾結合民族報、全民日報、經濟時報三報成立「聯合版」，日後發展而為聯合報，當年曾四出奔走借貸，以籌發員工薪水。「陳師孟指聯合報資金來自黨產，誠屬無稽。」創報第一桶金是黨產？ 聯合報：誠屬無稽"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "竹縣爭取立委多1席 中選會：尚未定案", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312600", "time": "2018-01-15 18:00", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_phpt5zLKp.jpg", "description": "〔記者陳鈺馥／台北報導〕中選會明日將開會討論國會選區席次，新竹縣長邱鏡淳今日先大動作召開記者會要求，新竹有55萬縣民應多1席立委；對此，中選會副主委陳朝建今日表示，中選會為法定獨立機關，不會預設任何立場，且目前尚未定案。陳朝建指出，中選會委員依法獨立行使職權、合議討論及決定選務重要事項，關於國會席次的名額分配問題，為國會保留事項，中選會依法只有建議權，最終決定權限屬於國會所有。陳朝建強調，本案目前中選會並未定案，將在1月16日的委員會議，才會繼續討論。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "挺侯友宜參選 葉毓蘭LINE設友誼連線", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312567", "time": "2018-01-15 17:20", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312567_1.jpg", "description": "〔記者何玉華／新北報導〕新北市副市長侯友宜雖未明確鬆口說參選新北市長，但後援已經展開！前警察大學教授葉毓蘭在臉書發文宣布設立LINE@「葉毓蘭友誼連線」，將每週固定分享41年來他對侯友宜的近距離觀察，以私房小故事，讓大家從同學、同事、友人、長官、部屬、學生們和侯友宜的互動中，讓外界認識侯友宜。葉毓蘭在臉書寫道，她到紐約過耶誕，貪婪的大口呼吸乾淨的空氣，而當時台灣正受紅害紫爆肆虐。讓她思考，還能受不了限電、空汙時就往國外跑，置身事外、逃避現實嗎？她認為，侯友宜是有能力為台灣解決問題、為台灣找出路的人，所以為了台灣，她決定「出賣」好朋友侯友宜。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "金介壽表態選新北市長 李乾龍：樂觀其成", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312558", "time": "2018-01-15 17:13", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312558_1.jpg", "description": "〔記者何玉華／新北報導〕前新北市議員金介壽今天在媒體刊登半版「決戰新北市長參選宣言」廣告，表態參選新北市長初選，並指這是一場「警察」與「罪犯」的對決，強力質疑副市長侯友宜與綠的關係，並要求國民黨初選納入黨員民意；國民黨新北市黨部主委李乾龍表示，初選方式不會因為個人而改變，只要符合資格的黨員都可以參加初選。人在海外的李乾龍受訪時表示，希望黨員同志不要砲口對內、互揭瘡疤，而是以闡述理念的方式爭取選民認同；初選方式已經決定，不會因為個人而改變，只要符合參選辦法的黨員，都可以參加初選，樂觀金介壽參加初選。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "德處理獨裁政權基金會訪台 將拜會黨產會", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312516", "time": "2018-01-15 16:55", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_phpajZBv9.jpg", "description": "〔記者呂伊萱／台北報導〕德國「聯邦處理東德獨裁政權基金會」今訪台，本週五將拜會不當黨產處理委員會，並透過直播與座談活動，分享德國轉型正義經驗。外交部今天表示，轉型正義為我政府施政重點之一，此訪團來訪有助於我借鏡德國經驗，以宏觀角度推動社會和解。德國國會於1998年通過決議成立「聯邦處理東德獨裁政權基金會」，宗旨在於澄清歷史真相，扎根人權教育。基金會董事長耶朋曼（Rainer Eppelmann）在東德獨裁政權時期及1989年政權和平轉變中追求民主與自由，並在東西德統一後致力處理轉型正義，因而於2009年榮獲「對抗遺忘–爭取民主獎」（Gegen Vergessen-Für Demokratie）殊榮。耶朋曼率「聯邦處理東德獨裁政權基金會」中專研政權和平轉變研究的副執行長格林堡（Dr. Robert Grünbaum）與展覽及國際關係部門組長庫德（Dr. Sabine Kuder）博士，一行3人今起應我外交部邀請訪問台灣。外交部今天發布新聞稿指出，該訪團將在台灣停留5天，在台期間將拜會內政部、文化部、陸委會、不當黨產處理委員會、德國在台協會、台北歌德學院與台灣民主基金會等單位，並接受外交部款宴；訪團也將參訪故宮、中正紀念堂、台北二二八紀念館、國家人權博物館籌備處與台北101大樓等文經建設。基金會也將於本週五下午兩點參加不當黨產管理委員會主辦的沃草網路直播公開座談，分享德國轉型正義經驗。外交部也表示，轉型正義為我政府施政重點之一，訪團來訪，當有助我借鏡德國經驗，以宏觀角度推動社會和解。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "林佳龍：沒入酒駕車輛   江啟臣批「口號」", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312532", "time": "2018-01-15 16:51", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_phpIXn6V1.jpg", "description": "〔記者歐素美／台中報導〕台中市長林佳龍今天在市政會議中指出，酒駕的車輛已成為犯罪工具，將促請中央儘速修法，對酒駕車輛予以沒入；有意參選台中市長的立委江啟臣則批評民進黨中央、地方處理酒駕的態度不同調，再多提案及呼籲都將淪為口號。江啟臣表示，市長林佳龍「沒入酒駕車輛」等重罰概念，立法院早已有動作，立法院法制局過往在防範酒駕的建議報告中已評估過相關作法，包括多位民進黨立委也有相關提案，但多數束之高閣。他說，他曾在2012年提過仿效歐美經驗，開發類似「酒測鑰匙」等法案，他也有進一步連署曾銘宗委員所提的酒駕防範措施的法案。江啟臣表示，「酒駕已讓許多人付出代價，包括我的堂叔，自然深刻體認，我一貫的態度就是對酒駕零容忍」，過去立法院無論哪一黨委員提案，主要阻力來自行政機關的阻擋與壓力，現在的執政黨掌握行政機關，行政院長是賴清德，林市長如果知道問題的癥結，該呼籲的不是立法院，而應該在行政院會當面向賴清德院長問清楚，行政機關的態度是什麼？同黨執政的行政機關若不同調，再多提案與呼籲，恐怕都會淪為口號。江啟臣並說，立法雖是中央責任，但台中市政府也必須思考，其他五都跟台中市面對一樣的中央法令，也都在積極取締，為什麼我們台中市去年酒駕件數卻最高？林市長除了呼籲中央立法外，似乎也應該向其他五都市長虛心求教，市府的實際作法，是否有未顧及的盲點？台中市政府表示，市府積極取締酒駕，去年規劃取締酒駕專案勤務86場，動用警力4萬5千人次，取締件數高達1萬3037件，六都最多，也讓肇事案件與傷亡人數持續下降，酒駕傷亡人數105年較104年減少20.3%，106年較105年再減少25.9%，警察局取締酒後駕車執法計畫，也榮獲內政部警政署評比第2名。警察局長楊源明並在市政會議中表示，酒駕需從嚴處罰，中央現正研議修法，對酒駕肇事造成死亡或重傷的案件沒入肇事車輛，市府也贊同這樣的作法。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "96歲大壽 李登輝盼台灣成為一個偉大的國家", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312522", "time": "2018-01-15 16:51", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_php7tsONO.jpg", "description": "今天是李前總統的96歲大壽。（記者張嘉明攝）〔即時新聞／綜合報導〕今天是前總統李登輝96歲大壽，稍早前總統陳水扁赴翠山莊為他祝壽。李前總統隨後也在臉書發文，表示今年的生日願望，期望「召喚台灣所有可團結的力量，使台灣成為一個偉大的國家。」李前總統說，有人問登輝今年的生日願望是什麼？面對亞太的新形勢及兩岸的不穩定，期望「能召喚台灣所有可團結的力量，捐棄成見，拋開藍綠，合而為民、協同為國，使台灣成為一個偉大的國家。」李前總統在文章中感謝眾多親友的陪伴及外界祝福，特別感謝陳前總統偕兒子致中，帶了攝影集，遠從高雄前至翠山莊問候。李登輝再次感謝大家的祝福與關心，也祝福台灣及全體國人平安幸福。李前總統感謝陳前總統偕兒子致中，前來祝壽。（圖擷取自李登輝臉書）陳前總統祝李前總統「萬壽無疆」。（圖擷取自李登輝臉書）李前總統感謝陳前總統偕兒子致中，前來祝壽。（圖擷取自李登輝臉書）"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "翁章梁明赴民進黨中央 登記嘉義縣長初選", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312515", "time": "2018-01-15 16:36", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312515_1.jpg", "description": "民進黨嘉義縣長擬參選人翁章梁（前左）到義竹修緣禪寺參拜。（記者蔡宗勳翻攝）〔記者蔡宗勳／嘉縣報導〕民進黨嘉義縣長初選擬參選人翁章梁，明天上午9點半將北上民進黨中央黨部辦理黨黨內嘉義縣長初選登記。登記前一天，翁章梁從故鄉義竹出發，今天先到義竹修緣禪寺及慈化寺參拜，接著前往朴子市配天宮、新港鄉奉天宮、民雄鄉大士爺廟祈求眾神保庇選務順利。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "饒慶鈴縣政請益之旅 首站到台東市", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312501", "time": "2018-01-15 16:35", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312501_2.jpg", "description": "議長饒慶鈴拜會市長張國洲。（記者張存薇攝）〔記者張存薇／台東報導〕台東縣議長饒慶鈴為參選縣長布局，展開縣政請益之旅，今天下午首站台東市，與市長張國洲討論觀光夜市規劃、鯉魚山整理等議題，針對民生最相關的垃圾問題，張國洲提出現有垃圾掩埋場再擴充想法，饒慶鈴表支持。饒慶鈴將代表國民黨參選台東縣長，為了做好縣政願景規劃，將前進16鄉鎮市請益，今天首站到台東市拜會張國洲，希望與爭取連任的張國洲一起努力。饒慶鈴指出，包括鯉魚山環境整理、觀光夜市規劃都是台東市重要發展方向，其中觀光夜市及美食小吃更是吸引遊客的關鍵，未來希望結合鐵花村等特色商圈、提出整體規劃。張國洲則提醒饒慶鈴注意垃圾問題。張國洲表示，焚化廠設置地點不當，因此民眾反對啟用，建議現有垃圾掩埋場經活化後，能再擴充使用，至少可以再撐個5、10年。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "勞基法修法北市提建言 勞動部：感謝", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312503", "time": "2018-01-15 16:28", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312503_1.jpg", "description": "〔記者李雅雯／台北報導〕台北市政府勞動局長賴香伶今天上午針對勞基法修法內容提出施行細則訂定建言，勞動部發言人陳明仁下午回應，目前施行細則配套條文正在擬訂中，將會審慎研酌。賴香伶上午在勞動局成立30週年記者會上，針對勞基法修法內容提出四項建議，包括「加班換補休應設立期限」、「每3個月加班時數如何計算週期」、「備查期限如何設定」、「事業單位行業別由中央目的事業主管機關認定」，認為勞動部在訂立施行細則時應該要說清楚。陳明仁指出，配合勞基法修正，勞動部正在研擬施行細則配套條文，將會審慎研酌，包括其他未來落實勞基法相關作為，會與地方政府討論、共商，「感謝台北市勞動局賴局長的建議」。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "立委關切台中科大南屯校區開發 促加速開發加強產學服務", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312494", "time": "2018-01-15 16:08", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312494_1.jpg", "description": "〔記者蘇孟娟／台中報導〕台中科技大學南屯校區開發案經費已核定2年餘，但地方屢有「只聞樓梯響、不見人下來」疑慮，立法院教育文化委員會今日前往台中科大考察，委員會召委、立委張廖萬堅盼學校加速開發時程，並結合長照定位，提供更多社會服務。台中科大目前學校師生及教職員數多達2萬餘人，但現有三民校區約5.7公頃，早就發展飽和，另雖有民生校區，僅有0.87公頃，也不敷使用，張廖萬堅指出，該校南屯校區多達7.7公頃，校方規劃興建第一期工程「中護健康學院綜合大樓」，但行政院已在104年核定9.62億元，卻遲未見動工。出身西、南屯區的張廖萬堅指出，多年來地方均殷切期盼台中科大能加速開發南屯校區，希望引進大學城的活力，繁榮地方。此外，台中市也在附近開發精密機械科技創新園區，不少業者希望台中科大能同時發展精密園區產學合作平台，張廖萬堅另指出，且附近勞工住宅興建中，但生活機能尚嫌不足，地方莫不深盼藉大學城的開發活化地方，更帶動當地生活機能發展。張廖萬堅另指出，台中科大有護理系、老人照護系，也能配合政府長照工程，加強規畫長照園區。教育部技職司副司長謝淑貞指出，該校南屯校區規劃歷經包括少子化趨勢下相關開發必要性、台中科大與台中護專合併磨合及南屯校區發展定位規劃等，再到委託內政部代辦相關工程，以致相關開發規劃一波三折。台中科大校長謝俊宏指出，目前南屯校區第一期工程中護健康學院綜合大樓工程已委由營建署代辦，預計一一二年開始使用，另針對學生宿舍及運動館配套，相關經費目前中央未有補助，校方也加緊規劃中。張廖萬堅與參與考察的立院內政委員會立委林麗蟬均認為時程太長，希望學校跟營建署再研商縮短期程，林麗蟬指出，願代向校方與內政部溝通。此外，立委高潞．以用也指出，台中市老年人口約有卅萬人，長照需求迫切，台中科大是國立科大，更可扮領頭羊，加速發展長照教育及照護資源，有需要也會全力支持。謝俊宏說，因應長照產業興起，南屯校區除教學研究外，校方目前也積極規劃發展長照產學合作，包括與長照機關或醫院合作，除服務地方外，也提供學生實習甚至就業之路。"}, {"category": "event", "type": "politics", "channel": "", "location": "", "price": 0, "title": "搶頭香！嘉義縣議長張明達登記縣長黨內初選", "link": "http://news.ltn.com.tw/news/politics/breakingnews/2312484", "time": "2018-01-15 15:59", "image": "http://img.ltn.com.tw/Upload/liveNews/BigPic/600_2312484_2.jpg", "description": "嘉義縣議長張明達（右三）由縣長張花冠（右二）等人陪同到配天宮參拜。（記者蔡宗勳翻攝）〔記者蔡宗勳／嘉縣報導〕民進黨縣市長黨內初選登記今天起展開，嘉義縣議長張明達在夫人黃瓊賢丶太保市長黃榮利丶議員陳柏麟丶黃嫈珺等人陪同搭乘高鐵北上，搶在第一天到中央黨部登記參與初選。出發前，張明達由縣長張花冠以及初選幹部陪同前往朴子市配天宮參拜，祈求一切順利。另一位擬參選人翁章梁預計明天早上9點半至10點之間到中央黨部辦理登記。"}]