[{"description": "I have been here two times and enjoy it more and more.They offer great wine at decent prices and nice food with variety of options.\nHi ingridshemberas, thanks for giving us your feeeback. We're glad that every Wine Connection experience is a treat, with us serving value for money wines and great quality food with a variety of options each time. We hope to see you again soon!\n\n\n\n\n\n\nOne of my top dinning place in Singapore.Great food,ambiance and good value for money.The wine is amazing and the staff friendly.\n\n\nHi Benjamin R, thanks for your great review. We're pleased to know our restaurant is one of your top dining destinations in Singapore. We're delighted to know that you like our quality food and wine, ambience, value for money deals and friendly staff. We look forward to more of your visits!\n\n\n\n\n\n\nIt's always a pleasure to meet people with a passion for their work. Jerriek at Wine Connection Tapas Bar made such great recommendations of wine and food and that made our weekend evening extra lovely! Thank you Jerriek!\n\n\nThanks for sharing your experience with us, Priscilla_Paul. Thank you for your complimentns towards our staff Jerrick for his knowledge and passion for wines, giving you the perfect recommendations not just on wine but food too. We're happy to hear this made your weekend, and will be sure to convey the feedback to him. Have a good day and see...\n\n\n\n\n\n\nVisited Wine Connection during the week for dinner and found a very nice atmosphere, cozy terrace, nice people, interesting international wines on the list and good to go menu to eat. Service in fact is quite good.\n\n\nHi marcobattaglini, thank you for your positive review. We are delighted to know that you found our ambience lovely, with interesting wines from all over the world and great-tasting dishes on our food menu, and great service! We hope to have you back again soon!\n\n\n\n\n\n\nVisiting our son in Singapore and the first night when we arrived he took us to Wine Connection... so much so after a visiting a few other restaurants over the past few days we decided to have dinner tonight again as we had found other places didn't provide the customer service.... Jerrick and Stella were outstanding tonight-very impressed with the...\n\n\n\n\n\n\nHi dhashy, we are extremely pleased to know that you thoroughly enjoyed your meal, and were impressed with our impeccable service, extensive selectin of food and delectable wines! We look forward to have you back with us again soon!\n\n\n\n\n\n\nIf you are looking for a reasonably priced place for a fine selection of food and wine then this is the place for you. it is very popular and the service is friendly. These is a great selection of Tapas. A great place to hang out with friends for a lazy afternoon drinks.\n\n\nHi puja m, thank you for your review. We're glad you enjoyed our selection of tapas, food, wine and service. We're also happy that you find us reasonably priced and we hope to see you back here soon!\n\n\n\n\n\n\nThere are many restaurants in the Clarke Quay area, but this has to be one of the best, very popular, friendly service and a fine selection of food and wine at reasonable prices (for Singapore) The tapas selection is very tasty.\n\n\nHi craghopper1, thank you for your review. We're glad that you enjoyed our service, as well as our food and wine selection! It's great to hear that you enjoyed our tapas and we're also happy that you find our prices reasonable. We hope to see you back here soon!\n\n\n\n\n\n\nPopped to Wine Connection with my daughter and her hubby. What a really nice place. Great as always to eat outdoors in Singapore. Food was really good and quick to arrive. Beer and wine was excellent value. Staff were really friendly and all in all a great night.\n\n\nHi 59Davef, thank you for your review. We're glad you enjoyed our food and good to hear that it arrived quickly. We're also glad that you found our beer and wine of great value. Finally, we are glad that our staff was friendly! Hope to see you back here soon!\n\n\n\n\n\n\nGreat location and atmosphere. Perfect restaurant for evening drinks and dinner! Very good selection of wines and excellent service. We visited the place on a Sunday evening and it was very busy but the service was quick and friendly.\n\n\nHi Elga T, thanks for your great review. We're glad that you find us the perfect place for dinner and drinks! We're also happy you enjoyed our selection of wines and excellent service. Even though it was a busy night, we're glad our service was quick and friendly. We're also happy to hear that you find our location and atmosphere...\n\n\n\n\n\n\nAfter browsing the choice of restaurants at Robertson Quay, we were attracted by the contemporary decor of this restaurant, together with the lunch deal promotion on offer.\nThe two Course Meal was outstanding as was the Beer and Wine selection on offer at reasonable prices, the service was exceptional, we were very impressed and would not hesitate in recommending.\nWould...\n\n\n\n\n\n\nHi LIMPIT, thanks for sharing your review with us. We're glad our decor and lunch deals attracted you to dine with us! We're delighted you enjoyed your two course meal alongside our reasonable prices of beer and wine. Thanks for complimenting our exceptional service and recommendations given to you. We hope to see you try our selection of Tapas soon....\n\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d1901137-Reviews-Wine_Connection_Tapas_Bar_Bistro-Singapore.html", "title": "Wine Connection Tapas Bar & Bistro", "type": "restaurant", "channel": "", "category": "event", "location": "11 Unity Street Robertson Walk # 01 19 20 | 11 Unity Street, Singapore 237995, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/c1/a9/fa/the-cream-cheese.jpg"}, {"description": "Love the ambience of the place. Service crew is very professional and helpful. Highly recommend!!!! Food is fantastic and value for moneyAmazing food, outstanding service, great ambience and feel to it.\nGreat space at a very unassuming and quiet location.\nWent for brunch and as am pregnant they took special care of, gave me a comfrtable seat with a cushion and later delughted me with a compimentary dessert congratulating me for having a baby.\nMust try for everyone, I am waiting...\n\n\n\n\n\n\nHi smilyshilpa,\nThank you for your kind words and sincere sharing.\nWe are pleased to know that you have enjoyed your meal with us and we can't wait to have you and your little one dining with us soon. Our kitchen and service crew shall continue to work hard and keep up with the good work. :)\nKindly also add...\n\n\n\n\n\n\nWe wish that we could give this place zero stars. The bottle of wine that we ordered taste like vinegar - I kid you not. The staff was indifferent and the food less than acceptable. We hope that this review makes one think again about eating here. Just awful!!\n\n\nDear penny529,\nThanks for taking your time to share your feedback with us.\nWe are very sorry to learn about your unpleasant dining experience and our management had conducted an investigation with various departments to have a better understanding of the situation.\nWe understand that before the commencement of your dinner, there was request to taste our three housepour red...\n\n\n\n\n\n\nGreat service, quiet atmosphere and good food and beverage menue. We tried a few snacks/appetizers and they were all good and the portions generous.\n\n\nHi capron,\nThank you for your kind words and sincere sharing.\nWe are pleased to know that you have enjoyed your meal with us and we can't wait to have you dining with us soon. Our kitchen and service crew shall continue to work hard and keep up with the good work. :)\nKindly also add us on our FB...\n\n\n\n\n\n\nFood was very good and the ambiance was equally as good. Hopefully the standard would maintain during our wedding\n\n\nHi Junxian,\nThank you for your kind words and sincere sharing.\nWe are pleased to know that you have enjoyed your food tasting with us! Our kitchen and service crew will definitely keep up with the good work! Look forward to your wedding event with us soon! Cheers!\nWarmest Regards,\nMaggie Yeo\nMarketing Manager\nSkyve Wine Bistro\n\n\n\n\n\n\nWe walked quite a long way from our hotel to this bistro that we saw with a quite a high ranking! We took the signature dishes, the grilled pork rib and the cod fish... both are very tasty with good portion of side dishes...Overall is good but deco and the live music are so so...\n\n\nHi Kitty C,\nThank you for your kind words and compliment.\nWe are glad to have the chance to host your dinner and we are pleased to know that you have enjoyed your meal with us! Our kitchen and service crew will definitely keep up with the good work!\nKindly also add us on our FB or Instagram account to...\n\n\n\n\n\n\nDid not expect such a posh restaurant to be tugged in such a quiet lane in Newton. The ambience is nice and the deco tastefully done.\nThe food is only average but the desserts are really nice.\nNice for hanging out with friends after work if you dun like crowded places.\nPrices are on the high side though.\n\n\nHi Keith S,\nThank you for your kind words and sincere sharing.\nWe are pleased to know that you have enjoyed your meal with us! Our kitchen and service crew will definitely keep up with the good work! We have also taken into account your comment about our food prices and have shared it with our management. We value our...\n\n\n\n\n\n\nVisited on a Friday evening. Live music provided by a duo was playing in the background and was very pleasant. The food was great. In particular the hibachi pork was succulent and flavoursome and overall was an excellent dish. The duck legs were also full of flavour and well cooked. The dessert of molten chocolate pudding was also above average....\n\n\n\n\n\n\nHi richard h,\nThank you for your kind words and sincere sharing.\nWe are pleased to know that you have enjoyed your dinner with us and we can't wait to have you dining with us on another Friday night with our live band performance soon. We have also taken into account your comment about our service and have shared it...\n\n\n\n\n\n\nI used to be a regular at Skyve for the quirky creative menu and ambience, but the kitchen and waiters have become complacent. Menu has been shortened, dishes taste bland and service is haphazard. Still a good place for wine though, with good selection of bottles economically priced.\n\n\nHi Mr Peter,\nWe thank you for taking your time to drop us a review and sincerely sharing your thoughts with us.\nFirst of all, we are sorry to hear about the experience you had at Skyve recently. We have taken into account your comments about our food and services and have shared it with our team. We value our...\n\n\n\n\n\n\nFood was great! The cosy ambience made all the invited guests felt comfortable and the bunch of service crew were very attentive. Definitely worth the subsequent visits.\n\n\nHi xinying_29\nThank you for taking your time to drop us a review!\nWe are pleased to have the opportunity to host such an important event for you and Jayden! Our kitchen and service crew will definitely keep up with the good work! We look forward to having you skyving with us soon!\nKindly also add us on our FB...\n\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d3473502-Reviews-Skyve_Wine_Bistro-Singapore.html", "title": "Skyve Wine Bistro", "type": "restaurant", "channel": "", "category": "event", "location": "10 Winstedt Road, | Blk E, #01-17, Singapore 227977, Singapore (Formerly Skyve Elementary Bistro and Bar)", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/df/8f/5a/skyve-elementary-bistro.jpg"}, {"description": "We have eaten here many times before. The setting is refined and is a western style restaurant and the service is very much Michelin. We had three dishes of which 2 were excellent. The first was asparagus wrapped in bamboo and the second a terrific grilled fish from their live fish menu. The third dish was their signature crispy skin...\n\n\n\nPosh environment. Spacious setting. Exquisite cutlery. Attentive service. Michelin-starred food. What more can I say? I highly recommend for a business lunch.\n\nBeen here a few times recently and the dim sum are always made from very fresh ingredients and of high quality. They do not have all the traditional dishes (i want egg tarts with my dim sum), impeccable service and they give you fresh tea leaves. Love the bright dining room and cute plates.\n\nAtmosphere was great and the food was excellent. One of the best places for chinese cruisine and get-together with family and friends!\n\nLoved the place to be, got a real good dinner and a perfect waitress who given us real good recommandations!\n\nThis restaurent situated within the Ritz Carlton hotel offers great Dim Sum lunch as well as fine dining . The decor has a Chinese touch , view overlooking the entrance lobby area , pretty spectacular especially holidays time with decorations . We been here many times , everytime we visited the city , we dined here .( 20 plus times...\n\n\n\n\n\nThis is truly heavenly.\nFantastic Chinese food.\nGreat service - attentive and charming. Open - and good conversation.\nGo there.\nA dessert with macrones can be recommended - try the green and yellow :-) :-).\n\nThis restaurant is good but the atmosphere is so so. If you are in a big group it is ok otherwise you need to go elsewhere.\n\nOn the whole service was excellent and food very good, one very minor criticisms is pace at which the food was served felt a bit rushed. On the whole though very good restaurant and I would definitely visit again\n\nWe were staying at the Ritz so we decided to try the Summer Pavilion since it has a 1 Michelin star. We tried a few dim sum dishes. The food was just average. The service was excellent. The price was very expensive.\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d796940-Reviews-Summer_Pavilion-Singapore.html", "title": "Summer Pavilion", "type": "restaurant", "channel": "", "category": "event", "location": "7 Raffles Avenue | The Ritz-Carlton, Millenia Singapore, Singapore 039799, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/86/0e/5c/summer-pavilion-main.jpg"}, {"description": "Last night in Singapore after a 3 day stop over. Was looking for something special and FOC didn't disappoint. Sat at the bar and was entertained by Juan - head chef. He was engaging but not intrusive. He Recommended courses to match and they were delicious. Highlight was the piña colada dessert but everything was beautiful. Can highly recommend.Another place we have been many times already simply because the tapas are excellent. Some of them can be relatively heavy on the stomach afterwards (don't have too many patatas bravas) but the overall quality is great. I remember on previous occasions they always tried to move us to a less attractive table and I really don't understand why. Also...\n\n\n\n\n\nTitle says it all... Great evening out at FOC. Highly recommended for any situation occasion. Spanish food at its best, comparable to some of the good ones I've tried in Spain.\n\nA large selection of gluten free food. Though one item soy caviar labelled gluten free seems to contain soy sauce, which is usually non gluten free.\nThe slow cooked octopus is wonderful, so is the squid ink paella\n\nLoved the ambience, loved the food, loved the friendly staff. Shout out to the head chef (I think) for going the extra mile to explain to us the dishes and mix 2 foods (which were supposed to serve in 2 different dishes) in 1 dish so that we could taste both with the price of one. I take one star...\n\n\n\n\n\nVery good-- excellent food variety. Service ok but not best but overall a great experience. To return\n\nmy friend had told me about this place.\nbut my experience there left me disappointed. The service was not outstanding, even lacking, as my hot water was not topped up even though I was sitting right in front of them at the bar seats. My friends who ordered the bottled still water had their glasses continually topped up!\nFood was...\n\n\n\n\n\nI choose this restaurant to celebrate our anniversary And I we were not disappointed by the food, good wine selection and informal atmosphere.\n\nhave been here twice so far, food is consistently good, staff are very friendly and prompt with their service, and the ambience is relaxing. would come back again\n\nMy first visit to this restaurant. Quality of food was good with nice ambiance! Will definitely come back again with friends.\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d7165932-Reviews-FOC_Restaurant-Singapore.html", "title": "FOC Restaurant", "type": "restaurant", "channel": "", "category": "event", "location": "40 Hongkong Street, Singapore 059679, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/f7/c9/d7/yummy-octopus.jpg"}, {"description": "The wait is long 90% of the time but it is worth it. My favourite DTF in the city. Love the dry noodles in special sauce, spicy cucumber appetiser, free flow of tea and greens. Totally worth the wait and the calories.I know that this is a chain restaurant with locations all over Asian, it is still one of my favorite places to eat. You do have to look past the fact you're eating in the mall and you will enjoy the food. I have been to the one in Taiwan before and now in Singapore. Both times were consistently good....\n\n\n\n\n\nThis is truly one of the gems of Singapore. Originally from Taiwan, Din Tai Fung brings taiwanese food to multi-cultural mouths. Their mouth-watering dumplings are enough to satisfy even the most ravenous stomach (like my brother!).\nMy least favourite part of Din Tai Fung is either waiting in line to get in (that's why I usually go early) or when...\n\n\n\n\n\nThis place is difficult to get into....you have to register, stand in line, try and choose what you want to order while waiting, but it is all worth it! Efficient and excellent service, fine dining at fast food speeds, exquisite tastes and flavours at surprisingly reasonable prices....overall an experience to remember. Without hesitation would rate it as one of the...\n\n\n\n\n\n~parked directly under DTF, that Paragon carpark locations is just perfectly positioned where the escalator leading right up to it's entrance\n~dinner with family 2016May with all our favorites and the Paragon only Premium dishes as well\n~consistently enjoyable, this time my daughter had her fill of vegetables\nStir-fried Spinach with Garlic - SUPER YUMz x2\nStir-fried Qing Long with...\n\n\n\n\n\nCan never go wrong here. Everything was perfect. The noodles were so fresh you could feel it with its texture and flavor. The dim sum is also perfect. Loved the crab one in particular. Mango pudding is still my favorite. Love going back here and never get disappointed\n\nThe decor isn’t the most refined, the tables are small, the chairs not particularly comfortable and the ceiling is low, but we’d been recommended this place so we disregarded all of the above.\nWe didn’t wait to be seated though it was early afternoon. The waitress brought jasmine tea, the menu and a curious contraption on legs with a cover...\n\n\n\n\n\nStopping for one night in Singapore on the way to Japan I made sure we went for lunch to this restaurant. As always very busy we had to wait few minutes for the table. The dumplings were delicious, my favourite ones steamed pork to die for.\nStir-fried vegies with garlic very tasty.\nJasmine tea is seved all the time.\n\nMy boyfriend introduced me to this branch because the quality of the food there is consistent and the ambience is good. On top of that, it is relatively big and quieter. The queues are long but not if you come around early weekday evenings (i.e. around 530pm). The service is excellent and you have an additional basket to place your...\n\n\n\n\n\nTaiwanese xiao long bao is very well know especially with their pork base and crab base . Do try their dou miau veg , it is amazing.\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d794014-Reviews-Din_Tai_Fung_Paragon_Branch-Singapore.html", "title": "Din Tai Fung (Paragon Branch)", "type": "restaurant", "channel": "", "category": "event", "location": "290 Orchard Road #03-06 the Paragon, Singapore 238859, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/cf/15/d4/fried-rice-with-egg-and.jpg"}, {"description": "I love this chain... The crab and pork dumplings are superb. Give a miss to the Indonesian outlets because chicken isn't strong enough to support the dumpling..If you want to try local food this is the rigth place. It was a great experience and very tastefull.\nThe tea is refill and highly recomended\n\nThe food was quite great and every food was made out of love, the queues were quite long and the prices are mid ranged\nThe serving for one person is good enough even though if it is a big plate as it is quite easy to finish up one plate of any dish\nSuggestions:\nMake the price of the dishes...\n\n\n\n\n\nReally good restaurant inside the Raffles City mall. A huge variety of dim sums and other Chinese specialties.\nNothing to criticize and I just explain the fact I didn't rated this place excellent because it lacks the atmosphere of a typical Chinese restaurant.\n\nSuper great service, food looks very fresh and nice! Much satisfied after a long journey from London\n\nThese were some of the best Shanghai soup dumplings I have had. The outside skin of the dumpling was just right in texture and the soup filling was delicious. Highly recommend a dining visit.\n\nSo the March special menu item may have contained a pork dumpling with black truffle - so not sure if this special will go into April. However, let me say that this was GENIUS and well worth the little extra they were charging.\nWith regards to the normal menu and the restaurant - the place was extremely busy for a...\n\n\n\n\n\ngrt vegetarian dumplings with medium price range. ambiance is good and delicious dumplings ever had in the decade. we went to city square mall. grt food.\n\nIt's been a killer experience where the food is as lapped up by crazy speed that all I could share the empty plates and menus. Crab & Pork dumplings, pork dumplings, Kallang, shrimp fried rice and Taiwan beer. Gosh it all rocked.must must indulge ....\n\nI had a lovely dinner at Din Tai Fung with a friend a week ago. All of the dumplings are hand made and fresh and it's really hard to chose something that you might not like. There's a bit of a wait (about 20 min or so) because the place is very popular. There's a smart ticketing system so you...\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d3855842-Reviews-Din_Tai_Fung-Singapore.html", "title": "Din Tai Fung", "type": "restaurant", "channel": "", "category": "event", "location": "252 North Bridge Road Raffles City Shopping Centre | Raffles City Shopping Centre #B1-08, Singapore 179103, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/d8/3c/7f/dim-sums-and-more.jpg"}, {"description": "You can't fault the cheese. I've been living somewhere you can't get French cheese and I forgot how good they are. 3 cheeses come with bread and fruit so you could get a decent meal for $19. Plus a big range of wines. Service tries to be snootily efficient but isn't very good - sometimes you have to shout to...\n\n\n\nWe first saw this bar on a Friday night - it was buzzing and had a great atmosphere. We called in the next day for a quick lunch. The service was very slow..... in fact we had to ask 3 times for a drink and then chase up to order the food. This aside the goats cheese salad was excellent,...\n\n\n\n\n\n\nHi welshman279, thanks for sharing your review. Our apologies for the slow service you experienced, but in return we're glad that you liked the buzzing atmosphere and enjoyed the goats cheese salad and Riesling wine. Do visit us soon to try our cheese and cold cut platters when you return! We hope to see you soon!\n\n\n\n\n\n\nTry wine & cheese and also tapas bar\nBest sausages and beers\nI tried it in Singapore unity street.\ndon't forget to reserve for best sit.\nhappy hour for only 18$ a main course and a salad or soup\n\n\nHi Kayvan_Z, thanks for sharing your review. We're glad you like our wine, cheese, beers and the sausages from our Tapas Bar. Thanks for spreading our happy hour promotionos for our food too. Hope to see you again!\n\n\n\n\n\n\nWe always come to this place very often, always enjoy the service, on this day, a Saturaday evening, we didnt make reservation and wanted wine and cheese impromptu. Understand that its crowded, we saw an empty space with laptop and papers on the bar counter near facing the cashier, able to accomodate for 2, though it was just nice for...\n\n\n\n\n\n\nHi tubbybelly, thank you for your review. We're glad that you're a regular at Wine Connection, and that you have always enjoyed our service. We're sorry to hear about our staff's reply to you this one particular time, but we're happy to hear that another staff immediately attended to you and rectified the issue. We hope to see you back...\n\n\n\n\n\n\nI love all cheeses and raclette cheese is one of my favourites. This restaurant does a mean raclette set that comes with bread cornichons and everything. It was quite good value and especially since we were given a table right in the cheese room itself. Fabulous fabulous choice!\n\n\nThanks for sharing your great review, Rosetravelstheworld. We're pleased you loved our cheese and it's great that you find us of good value. Hope to see you again!\n\n\n\n\n\n\nWould usually move to the Cheese bar if the Tapas bar nearby is full. As with the Tapas bar, the wines here are relatively cheap. Good selection of cheese. Recommend the raclette cheese.\n\n\nHi Zac_Wang, thanks for sharing your feedback with us. Great to know that you find our wine prices reasonable, and that you find that our cheese selection is good. Thanks for recommending the raclette in particular. Have a nice day!\n\n\n\n\n\n\nI have been here a couple of times now in the past few weeks and I must say I totally enjoy the place. There are many different ways to select your cheese, but my favourite is to get a couple of cheese and meat selections. The cheese goes from the normal cheddar type, through the soft cheese up to a...\n\n\n\n\n\n\nHi Martyn K, thanks for sharing your review with us. We're glad you had a good experience at Wine Connection, especially our selection of cheese and cold cuts to accompany our large array of wines. Have a good day and we look forward to many more of your returns!\n\n\n\n\n\n\nI visited twice in one day, for lunch and dinner. The wines were the cheapest that I'd seen at any restaurant in Singapore with good New Zealand Marlborough Sauvignon Blanc ranging from $35- $40. This was less than half the price charged by other mid range restaurants.\nThe lunch range is good and reasonable with an average price of $19...\n\n\n\n\n\n\nHi jeremymoorman, thanks for your valuable feedback. We're delighted to know you enjoy our affordable wines and lunch menu. Great to hear you liked the cheese and would recommend it to other cheese lovers out there. However, our apologies on the average service you received on both occasions. We'll escalate your feedback to the management to ensure that our service...\n\n\n\n\n\n\nThis little wine bar has a huge collection of wines at exceptionally good prices. Many bottles starting around the S$30 mark (about £17) and terrific cheese list. We went for a bottle of Valpolicella Ripasso, excellent value at S$41.\nHouse specialty is raclette - a type of melted cheese fondue. This was widely ordered and seemed to be going down...\n\n\n\n\n\n\nThanks for sharing your review with us, Joe_and_Fizz. We're glad you like our large collection of wine bottles,and our prices. We're also pleased that you've recognised our Raclette house specialty, and thoroughly enjoyed a selection of our wine european cheeses, especially the Brie de Meaux. It's great to hear that our staff were friendly and attentive. We look forward to...\n\n\n\n\n\n\nPopped in one afternoon for a quick glass as only round the corner from our hotel the have a good choice of wine with various prices also a great selection of cheese from all parts of the world a great visit\n\n\nHi terry g, thanks for giving us your review and popping by for a wine. Glad you like our choice of wines and selection of cheese from all over the world. Thanks for recommending us, and hope to see you again!\n\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d4079480-Reviews-Wine_Connection_Cheese_Bar-Singapore.html", "title": "Wine Connection Cheese Bar", "type": "restaurant", "channel": "", "category": "event", "location": "11 Unity Street Robertson Walk | #01-05 Robertson Walk, Singapore 237995, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/e4/c7/2d/caption.jpg"}, {"description": "The view is amazing day & night !Restaurant under refurbishment so restricted menu which suited are needs albeit a little over priced ! Staff friendly and efficient !\nWhilst in Singapore I had to visit Marina Bay sands hotel.\nI couldn't resist the chance for a drink in the sky bar. The very helpful staff presented me with a corner spot, overlooking the city, just about the best view there.\nAmazing place to enjoy a couple of hours viewing the city at night, with good food and drink...\n\n\n\n\n\nWith limited time on a business trip, the bar was great for a drink and some snacks to take in the view. No problem for a single traveller to get an outdoor seat; service was friendly and efficient.\n\nEnjoyable with great views.\nWe booked a table outdoors for a flight and to watch the sunset over Singapore. We enjoyed cocktails and bar snacks. Ambience and wait service excellent.\n\nA few of my colleagues recommended this place, so spent a couple of evenings here. Both times the menu disappointed and the cocktails failed to live up to the price tag. View great, but so are many other rooftop bars. Music and vibe was the highlight of the visit.\nSignificantly better alternatives locally.\n\nMenu is extremely limited. Does not cater for Vegetarians or Muslims.\nExtremely overrated!\nExtremely pricey.\nA hawker centre is far better.\n\nWe went there for late Sunday lunch. It wasn't busy so we got a table . The place was bright and cheerful. Lots of glass all around with fantastic view from the top of MBS.\nSet lunch offered good selection to choose from. Food was extremely good. Enjoyed it very much and will return to try others on menu.\n\nMy Wife and I decided to bring my mum for her 62nd birthday , lunch at Sky on 57 at Marina Bay Sands Hotel and I must say, the food and service were excellent!!!\nWe each ordered the business luncheon 4 course meal , with starters, soup, mains and dessert and what surprises me is the variety of the Menu!...\n\n\n\n\n\nAttop the buzzing Marina Bay Sands Hotel (Tower 1) this boutique restaurant has the view as its USP. Booking usually essential especially for dinner, the welcome and service is immaculate with super-attentive staff. Food is sort of Asian fusion but small portions. Well presented and immaginative if limited choice. Enormous drinks menu, though.\nBut, the price you pay for all...\n\n\n\n\n\nTotally not impressed with the food and even less with the journey there on foot.\nFreaking bad signage from carpark to restaurant.\nTook us 20 minutes to get from carpark to restaurant.\nDo NOT follow signs to SkyPark because it could take you to Towers 2 and 3.\nI'm amazed at how bad signages are.\nYou need to go via...\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d2010882-Reviews-Sky_on_57-Singapore.html", "title": "Sky on 57", "type": "restaurant", "channel": "", "category": "event", "location": "10 Bayfront Avenue Marina Bay Sands | Marina Bay Sands, Singapore 018956, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/08/d2/9f/b2/sky-on-57.jpg"}, {"description": "If you come to Singapore dont miss this restaurant. Good food, good staff, good service , good music . We will come back for sure .Enjoyed the ambience and most of the dishes, in particular the chicken satay, dry laksa, and beef rendang. Pity it's a small place, so reservation is required.\n\nMet friends here to introduce them to quality Singaporean food. Booked table some days in advance and it was full. Old style colonial decor with photos of old Singapore on the walls. Excellent service with explanation of dishes. Coronation chicken is not the English version - much tastier. Black noodles better than expected and the Buah Keluak ayan using candle...\n\n\n\n\n\nWe ate here on a recent visit to Singapore and the food was excellent.\nThe menu has some good options on this although some may find it limited I enjoy smaller menus.\nWe started with the coronation chicken and chicken wings which were both well presented and cooked.\nWe then shared a dry laksa and beef rendang which were again...\n\n\n\n\n\nWe were introduced by a friend to this charming old style colonial restaurant. We had a great supper sharing dishes.\nThe table booking system is fairly strict as it is clearly in great demand. The waiting staff were very helpful showing us pictures on their phone of the foods and the ingredients but also rather busy so needed to be...\n\n\n\n\n\nMy 4th time dining here and the food quality still remains consistent. Portions are a little small for the price thats paid and service is a little slow as always. But still a restaurant i would visit for the quality of food.\n\nThere you get all the best dishes that the kitchen of Singapore can offer you.\nIt is a very stylish and classy restaurant.\nThe service is top class!!\nHowever, you need reservations- and you have to reserve weeks before you are going.\n\nFortunately we booked a table for 6pm on a Sunday evening arriving slightly early to beat a thunder storm. Somewhat surprised to find a number of others already waiting for opening time, 6pm sharp.\nThe Service is excellent, as is the food. We shared an entree (satay chicken) as we also wished to be sure of making it to desert....\n\n\n\n\n\nHere for dinner with a friend recently. Had the coronation chicken, kueh pie tee and tahu goreng to start and then garam Assam fish, Sayur lodeh and nasi lemak for mains. The fish and the tahu goreng were particularly tasty. I ordered the Haliatini cocktail which was really delicious. Including tax it worked out to about SGD 90 each.\nFor...\n\n\n\n\n\nWe had visited the National Gallery and were looking for lunch. We found our way to the National Kitchen and what a wonderful hour or two we had there. Even as we sat down, it was apparent that people had come there to enjoy themselves and were quietly doing just that. You knew that you had made a good choice....\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d9596660-Reviews-The_National_Kitchen_by_Violet_Oon_at_the_National_Gallery-Singapore.html", "title": "The National Kitchen by Violet Oon at the National Gallery", "type": "restaurant", "channel": "", "category": "event", "location": "1 St. Andrew's Road National Gallery Singapore | #02-01, The National Gallery, City Hall Wing, Singapore 178957, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/cd/bf/75/national-kitchen.jpg"}, {"description": "Carousel is is always one of my top go-to buffet place be it during a special occasion or not. The service and the quality of the cuisines keeps me coming back for more! Special shoutout to Chef Robert for his undying passion in cooking and also for serving one of the best Aglio Olio I have ever had! Must try...\n\n\n\nGreat dining place as usual .It is one of our favourites as always...love the varieties of food esp the seafood n salad section...but I must say the ambience can be improved .The seating in the resturant is pretty cramp so probably ,not so ideal for catching up but good n delicious food ,you are in for it!\n\nMake a reservation on the weekend for our anniversary celebration. Friendly and approachable staff. Wide variety of food. Totally impressed with the food. Awesome dining experience. Highly recommended.\n\nA bit more expensive than other buffets but the choice on offer is splendid. Seafood counter was fabulous. So many food varieties available and staff very friendly\n\nHas always been the go to place for halal buffet. Dare to say that this is the best halal buffet restaurant in Singapore. Highly recommended especially for the dinner. Variety of food and service of all the staffs are superb.. Bread pudding and the creme brulee fantastic..\n\nAlways great food, great service. Had a wonderful experience. Lunch, hi tea or dinner, Carousel always delivers. Our family 1st choice of restaurant in Singapore.\n\nFood: Wide spread of food varieties with simply delicious dessets.\nAmbience: Spacious floor and seating arrangement. Classy decoration.\nPrice: Value for money.\n\nStayed at the Hotel and the food here was absolutely amazing - daughter is a bit of a fussy eater in what she can eat or likes to eat - but here there was plenty of choice - Mmmmm - wish I could visit again - one day maybe\n\nMake a reservation on the weekend for my boyfriend birthday. The staff was amazing, they surprise us with the cakes and to everyone who celebrate their birthday on that day..they were dancing,clapping and cheering.. Awesome stuff,awesome service and awesome food.. Love love loveee the chocolate fondue and Caviar !\n\nMade a reservation for weekday lunch, was promptly directed to our table.\nFirst visit here, so i'm quite impressed by the spread. Personal favourites:\nThe sashimi counter, teppanyaki, western cuisine, indian cuisine, desserts section (with the chocolate fondue fountain!)\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d794086-Reviews-Carousel_Buffet_Royal_Plaza_on_Scotts-Singapore.html", "title": "Carousel Buffet, Royal Plaza on Scotts", "type": "restaurant", "channel": "", "category": "event", "location": "25 Scotts Road, Singapore 228220, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/fc/06/f5/carousel-buffet-seafood.jpg"}, {"description": "Had breakfast on 3 days. Staff hassled and stressed. Loads of people, too many for me to be comfortable. Food is good, lots of different cuisines and most items were tasty. Service was just OK.I have been a regular customer with the Edge restaurant in Pan Pacific Hotel Singapore because I enjoyed their wide range of food served in the buffet lunch or dinner. Another reason is the excellent service provided by the staff ranging from the higher level Managers to the lower level cleaners. However recently I found that the quality of some...\n\n\n\n\n\nService good, nice view, food okay, only crab is raw, online shown hv lamb chop and wagyu. So sad didnt have this\n\nNot for Americans. Too much local food and not our taste for $150US. Very little real seafood, except for King crab legs. Not very friendly front desk staff.\n\nSundays or weekends there is an all you can eat buffet night, and you will eat all you can. It's varied - literally an entire restaurant full of food - with food from Europe, SEA, East Asia etc. plus an amazing dessert area. Felt like rolling out after about 9 plates each.\n\nThe best buffet in the world. Fresh made to order juices. Fresh omeletes made to order. Everything tasty. Huge selection.\n\nNice ambience with quality foo. It's a place suitable not only for business purposes, nice nice for family or friends gathering\n\nThis place has the best Buffett I have ever eaten at and this includes 3 trips to Vegas!\nAll the Vue Cliqout Champagne you can drink we tried to empty every bottle until we ran out of time. The menu included all types of food sea food,Italian ,Asian, prime rib,rib eye you name it they had the price was probably...\n\n\n\n\n\nHaving Friday brunched in Dubai many a time, we didn't think we could visit Singapore without giving their Sunday offering a go. It was the same concept, 4 hours of all you can eat and drink, this particular one including Veuve Cliquot champagne, which was a plus.\nThere was a wide and varied selection of food, from breakfast items, to...\n\n\n\n\n\nGreat spread, comfortable seats. Seafood offered was definitely on a higher quality compared to most buffet restaurants.\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d3567913-Reviews-Edge-Singapore.html", "title": "Edge", "type": "restaurant", "channel": "", "category": "event", "location": "7 Raffles Boulevard Pan Pacific Hotel | Pan Pacific Singapore, Singapore 039595, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/05/79/29/23/edge.jpg"}, {"description": "A little quirky seating outside but comfortable enough and the food was excellent!!I have been and enjoyed this new venue (from old Bukit Timah) a few times and was so pleased that the food had if anything this time stepped up.Greek wines only but with a little of their help we were not disappointed there either. Great evening!\n\nThe vibe is great on a Sunday - the restaurant is full and bustling with people. The food is always good and the Greek wines on offer have something for everyone. Make a booking and enjoy the Greek cuisine and hospitality. Enjoy.\n\nBlu Kourzina is the best Greek restaurant in town. Make sure to reserve your table a week in advance as it's always full. Scrumptious food, good service.\n\nWent for lunch with my family. It is our second time there. The last time was more than a year ago. Despite the time that has passed, the experience was equally enjoyable if not better!! The food was amazing good, especially the Greek salad, Mousaka and Grilled Seafood. Had a wonderful time. Too bad no space for dessert!! Will definitely...\n\n\n\n\n\nThe restaurant changed its location to a new place into the center of Singapore, it became more louder and more cramped in the restaurant, and the tables are quite close together now. However the food as usual is great and a very nice variety of Greek wines.\n\nThe food was awesome, the service staff not exactly very attentive (although there were many of them standing around), the music too loud which resulted in most customers having to shout to talk to each other. Felt more like a market place than a nice restaurant. But the food will make me want to go back.\n\nVery good service and the place is really pretty and impressive! The staffs are very friendly and it can get really crowded during the lunch hour, even on the weekend.\nFood was good but a little oily in my opinion. Coffee was great. Will definitely visit again!\n\nHaven't been to Greece, tried Greek food in Sydney and Malta, but first time exploring Greek food in Singapore with my 2 foodie pals...this restaurant at Dempsey has a \"tavern\" look and very cozy..my pal said Greek food is healthy and hearty...so we ordered the following:\n(1) pita bread with various dips as starter (2) Greek salad (3) spanakopita (like...\n\n\n\n\n\nBlu moved fairly recently from its quaint, narrow dining experience on Bukit Timah Road to a more convivial setting atop Dempsey Hill, but luckily for all of us the food, service & drinks remain exceptional.\nRun by a Greek family who own an olive grove in Greece, the olive oils and some cheeses are imported from home.\nBlu has a...\n\n\n\n\n\nAmazing food, staff and place! Can't wait to come back! The new restaurant is much bigger than the other but still is very cozy and nice.\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d10188367-Reviews-Blu_Kouzina-Singapore.html", "title": "Blu Kouzina", "type": "restaurant", "channel": "", "category": "event", "location": "10 Dempsey Road | Blk10, Singapore 247700, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/eb/50/47/blu-kouzina.jpg"}, {"description": "The cheese selection, pastas and pizzas. Everything was amazing. There was a wide variety and options for everyone. Also totally worth the price. Highly recommend it for the ambience, widespread choice and quality. Have been previously for an a-la-carte meal but the buffet is a true steal.So little Italian buffets in Singapore, but when there's Basilico, does it matter?\nMost buffets in Singapore are heavy on the South-east Asian and Japanese offerings, and they all get boring really quickly. Quality is generally subpar for most items too.\nThankfully, there's Basilico to offer a different variety of food - authentic Italian, with acceptable, if not excellent, quality...\n\n\n\n\n\nWent there for dinner and was pleased with the experience. The ambience was rather good and the risotto was done very well. Hearty serving that was full of flavour. To my surprise, there was a 15 percent discount for CitiBank credit cards. However, the wait was a tad too long, especially since we showed up on time for our 1830...\n\n\n\n\n\nStaff is super friendly and accommodating, food is superb! Ambiance and the crowd is fun and vibe is very enjoyable! We'll be back for sure!\n\nThe restaurant treated us perfectly well! Upon confirmation of our booking, they found out that we were celebrating our 17th wedding anniversary and gave us a prime seat in the house. Followed by a lovely slice of cake with wishes written in delectable chocolate sauce. Thank you! Our 17th anniversary has been made perfect by you!\n\nThis was my third visit and this visit was to introduce my family to this wonderful, Practical restaurant! \"Practical\"? The buffet starters has a selection of Italian soft and matured cheeses (and one soaked in red wine as well), cold cuts of Ham cappciios Salami cold cuts , large green olives, greens and veggies eggplant, asparagus and many more..\nSo...\n\n\n\n\n\nGood spread of quality food and service. The only minus point is the slow service in free flow of wine.\n\nI've tried quite a few of the Singapore brunches and this has to be one of the best!!! The cheese room is incredible, great range of hot food and seafood. Not a huge dessert range but that was fine for me. There are 2 packages $165 for free flow champagne Perrier Jouet or $135 for prosecco. I had the champagne...\n\n\n\n\n\nMid week lunch with Husband. Delicious anti pasta, salads, mozzarella and cheeses.\nThere is more than enough in this part of the buffet to satisfy but Basilco also offers a good range of Italian dishes and a selection of Asian dishes( in my opinion not needed) something for everyone!\n\nBasilico is strong value, food is high quality and service very high level.\nThere were little less choice than in the past ( or it gave this impression), I regret the truffle risotto was missing again.\nElse excellent\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d1466538-Reviews-Basilico-Singapore.html", "title": "Basilico", "type": "restaurant", "channel": "", "category": "event", "location": "Regent Singapore | 1 Cuscaden Road, Singapore, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/0b/d1/d7/antipasti-buffet.jpg"}, {"description": "My wife and I had dinner when staying at the Marina Mandarin. It was delicious. So tasty and light, not like lots of Chinese meals we have eaten in the past. The staff are very elegant and the restaurant is very relaxing.At Peach Blossoms tonight. Good services, an enjoyable dining experience. Thanks to the talented Terry, the bubbly joyful Christine, and the other team members Alden, Nobel, Sook Teng, Mum Fang and Akira.\n\n\nHi beesuan,\nThank you for your reviews of our restaurant. I am glad to have brought you an enjoyable dining experience and your compliments will be shared with Terry and team. I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nWe have double birthday celebrations for my dad and myself at Peach Blossom Restaurant.\nThe staff, Terry, Soon Teng, Akira and Christine served our table with utmost sincerity and earnestness to let us feel welcome. We let off our guards and spoke freely with them as if I had been a regular customer. But this was my first time there...\n\n\n\n\n\n\nHi Irene T,\nHappy belated birthday to you and your dad! Thank you for your reviews of our restaurant. I am pleased that you enjoyed yourself at the restaurant on this special occasion and I hope to be able to bring you such honor again for your future visits!\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nWe are really enjoyed our birthday dinner. The food and service were excellent. special thank you to all the staffs at Peach Blossoms. Mr Alden, Terry, Nobel, Sook Teng, Mun Fung, Christine and Akira. They have made a memories dinner for us.\n\n\nHi Lay Hoon S,\nThank you for your reviews of our restaurant. I am glad that you had an enjoyable birthday celebration here at Peach Blossoms and made some memories along the way! I look forward to hosting you again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nMum’s birthday dinner recently at Peach Blossom, Marina Mandarin was very pleasant one. The food was delicious and staff was very warm and friendly.\nThey helped with the Peking duck so presentable with the side sauce. The rest of the duck meat cooked with dried chilies and cashew nuts – bot crispy and tasty! Other dishes includes vegetables with scallops...\n\n\n\n\n\n\nHi 868unal,\nHappy belated birthday to your mom! Thank you for your reviews of our restaurant. I am heartened by your compliments of our staff, as well as the special treats, the excellent dining experience and service that you had. I will certainly share with my staff and I am sure they look forward to serving you again. I look...\n\n\n\n\n\n\nI have dined in this restaurant 2 years ago and the quality is very good.\nThis time when I went there for dim-sum again, found out their quality deteriorated a lot.\nAll the dim-sum are pre-made and pre-steamed, after we placed order within 5 minutes all the dim-sum is served on our table. By the taste you can tell they...\n\n\n\n\n\n\nHi Minion326,\nThank you for your reviews of our restaurant. I am disappointed that your dining experience here with us was not up to expectations and we could have certainly done better. Your feedback is greatly appreciated and will be shared with our culinary team. I hope to be able to change your mind should you decide to come by...\n\n\n\n\n\n\nLast night I and my siblings took my mum to marina mandarin peach blossoms to have dinner and celebrate her birthday.We order poach silver cob fish,coffee spare rib,seafood claypot and other dishes …my mum like all the food and the service is excellent,Christine is very cheerful and friendly,Alden the restaurant manager and Jeff thank you for the warm service.And Terry...\n\n\n\n\n\n\nHi Kim kiok,\nHappy belated birthday to your mom! Thank you for your reviews of our restaurant. I am heartened by your compliments of our staff. I will certainly share with them and am glad that you enjoyed your dining experience and food here at Peach Blossoms. I look forward to welcome you back again to the restaurant!\nYours sincerely,...\n\n\n\n\n\n\nThe Husband (he has been given an upgrade) and I brought his family there for his father's birthday celebration.\nExpectedly, the food was flavourful and did not fail us. But what really got our notice was their service (or should I say, relationship) to their diners.\nFrequent diners, I assumed, were called by their first names. One service staff even...\n\n\n\n\n\n\nDear Yolanda T,\nHappy belated birthday to your dad! Thank you for your reviews of our restaurant. I am glad that you enjoyed this special occasion at Peach Blossoms. We take pride on our service excellence, making our guests feel at home and of course, our F&B quality as well! Your compliments will certainly be shared with Terry and team...\n\n\n\n\n\n\nDear officer in charge,\nPlease help me to thank them for their wonderful service.\nMr Terry and his team service with their hearts and make sure our needs were taken care of promptly.\nThey also proactively ask for feedback with regard to our dishes.\nDefinitely indispensable assets to Peach Blossoms\nWe really feel at home eating.\nRegards,\nEric Chin\n\n\nHi Eric C,\nThank you for your reviews of our restaurant. I am heartened by your compliments of our staff. I will certainly share with them and am glad that you enjoyed your dining experience.I look forward to welcome you back again to the restaurant!\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nWebt back to celebrate my dad's birthday. As usual my family came here because of the excellent service Terry gave to us. Dad was extremely happy with the food and the special cake arrangements. Thank you Terry for giving us a wonderful dining experience!\n\n\nDear Bernardina S,\nHappy belated birthday to your dad! Thank you for your reviews of our restaurant. I am glad that you enjoyed this special occasion at Peach Blossoms. Your compliments will certainly be shared with Terry and I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d1007702-Reviews-Peach_Blossoms_Marina_Mandarin-Singapore.html", "title": "Peach Blossoms (Marina Mandarin)", "type": "restaurant", "channel": "", "category": "event", "location": "6 Raffles Boulevard Level 5 Marina Square, Singapore 039594, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/b0/99/45/peach-blossoms-marina.jpg"}, {"description": "A great place to start the day by the pool overlooking the city eating amazing food. You can't beat the views or the variety. Service is great too.Cant go wrong with this spot! Always great service and food and the view doesn't hurt! Must do in Singapore!\n\nIt's still the case that this place has a great view, but in all honesty, the food is mediocre and the service is terrible. Unless the view is all that matters, grab a drink at the Flight Bar instead and save your stomach for a Hawker stall.\n\nExpensive but very good restaurant right in the heart of Marina Bay Sands. The menu is really amazing. The dinner was really perfect, food was really good, fresh and tasty. The chefs creations was really extraordinary.\n\nPerched 57 stories above ground, you are part of the clouds! What a glorious setting for this restaurant with fabulous views.\nThis is enhanced by your dining experience.. sparkling glasses, crisp linen and shining cutlery set off with mini arrangements of orchids.\nOne can dine here for S$45 per person for the set menu, wherein you get a choice of...\n\n\n\n\n\nI was visiting singapore and wanted to have a memorable dining experience, decided to book a table at Spago. It is an expensive affair but the food was simply unbelievable. We ordered the pan roasted chicken, the lamb chops and the short ribs. The lamb chops and the ribs are the best I've eaten so far. Great ambience as well.\n\nGreat food, with beautiful presentations and extremely attentive and discrete waiters.\nI had dinner outside, enjoying the marvellous view on Marina Bay.\nVery expensive, but no regrets: it was definitely worth it.\n\nOne of the best restaurant in Singapore which served the Californian Asian Crossover Cuisine by the renowned celebrity chef, Wolfgang Puck. You should be here at least once in a lifetime. It only costs you $45 to enjoy a fabulous 3 courses lunch menu in the celebrity chef restaurant with the stunning infinity pool and skyline view. Chicken 'Laksa' Spring...\n\n\n\n\n\nIt was not my fav so far but still will recommend it to others since my friends like it here.\nGood service\n\nHad breakfast here while staying at the Marina Bay Sands. Must say I was quite impressed- comprehensive spread, excellent service and great tasting food. The waiters even went out of their way to make my toddler a fresh stack of blue berry pancakes. The views are sensational to you look out into their infinity pool and beyond on 57th floor.\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d8683187-Reviews-Spago_by_Wolfgang_Puck-Singapore.html", "title": "Spago by Wolfgang Puck", "type": "restaurant", "channel": "", "category": "event", "location": "10 Bayfront Avenue Marina Bay Sands | Marina Bay Sands, Singapore 018956, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/09/35/4a/e8/spago.jpg"}, {"description": "It is located at the 4th level of Marina mandarin Hotel. It's a halal buffet restaurant.Throughout my 2 hours dining there, I observed that all the staff were very attentive and polite. I was very impressed after we were seated and the staff, Ms Laurietta explained to us that the food theme changes ever month and this month was...\n\n\n\n\nVisit this exceptional restaurant and enjoy a variety of delicacies. The beautiful environment and quality of service will always make you come for more. Enjoy ur meal...\n\nWe just visited Aquamarine to have a sumptuous dinner with my colleagues because we wanted to celebrate my Promotion at work and it was indeed a good place to have a great dinner with friends and colleagues. The buffet spread is really has a wide variety of range to choose from. One of your lovely employee explained that it is...\n\n\n\n\n\nFood was great and up to expectation for promotional price paid. Special mention to Soo Im for her ever-ready to serve attitude. We were seated in a corner and we were never neglected in any way. My friend and I had a great timing dining at aquamarine. Keep up the good work!\n\nNot much variety and choices for the price paid. Not much staples. Chef carrying food refills spilt water onto the floor without realising, causing slipping hazards to guests. Waiting staffs were very attentive especially Ms Amandeep, who attended to us during our dinner.\n\n\nDear Nur Safura I,\nThank you for your kind reviews of AquaMarine. I appreciate your comments on our buffet selection and our Chefs handling of food on the restaurant floor. Your feedback is important and I will share it with my team. Your compliments will be shared with Amandeep and I look forward to welcome you back again.\nYours sincerely,...\n\n\n\n\n\n\nAs regular patrons of Aquamarine, we are delighted that the restaurant continues to live up to its name of providing great food and great service. Special mention to Rachel Bong and Deep for being attentive to our needs as well as going the extra mile. Kudos and keep up the good work.\n\n\nDear Iwan Kurniawan A,\nThank you for your kind reviews of our F&B quality. I am glad to have brought to you excellent service and F&B quality to your continuous patronage with us. I look forward to bring you more offerings and excellent service should you come back again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nSo much choice. I really recommend the Nasi Lemak and curries. Plenty of fresh fruit and tasty pastries too. Friendly service from Lauretta.\n\n\nDear Kazlet,\nThank you for your kind reviews of our F&B quality. I am pleased that you enjoyed your dining experience with us. I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nThis was the first time i visited for lunch with my family. The food was great, the service staffs are very polite and well disciplined. Furthermore i would like to mention about the staff Mr. Raj we had a great service from him and another i would like to share the way he explained about the promotion going on in...\n\n\n\n\n\n\nDear ctan3274,\nThank you for your kind reviews of our F&B quality and service. Your compliments will be shared with Raj and I am pretty sure he will be flattered by it! I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\nYours sincerely,\nRyan Chan\nDirector of Food & Beverage\n\n\n\n\n\n\nOur second visit at the restaurant on 1 Apr 17. Our choice to celebrate my boy birthday as we love the wide spread of good foods. The foods were replenished rather fast. The staff was friendly and super attentive! We r especially impressed by two of the crews -\nMr Vikram - I just asked for a candle so that...\n\n\n\n\n\n\nDear Kelvin L,\nHappy Birthday to your little boy! Thank you for your kind reviews of our F&B quality. I am pleased to be able to bring you great F&B quality and service to you. Your compliments will certainly be shared with Vikram and Razak. I look forward to welcome you back again.\nYours sincerely,\nRyan Chan\nDirector of Food...\n\n\n\n\n\n\nThis is my first time here with my colleagues for dinner. Great food, The service staffs are polite and well manner especially Mr. vickram, when we reached at our reserved table, that time we were waiting of staff for serving water.\nBut until 5 minutes no body attended to us. Your staff vick... came and asked to us about warm...\n\n\n\n\n\n\nDear sheefasgp,\nThank you for your kind compliments of our restaurant. I am glad that you enjoyed your evening with us. As VIP guests, we had certainly up the ante as our way of thanks for your continuous patronage of AquaMarine. I am also pleased that we made your friend’s birthday extra special with our service and offerings. I look...\n\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d929185-Reviews-Aquamarine_Marina_Mandarin-Singapore.html", "title": "Aquamarine @ Marina Mandarin", "type": "restaurant", "channel": "", "category": "event", "location": "6 Raffles Boulevard Marina Square, Singapore 039594, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/b0/97/f4/aquamarine-marina-mandarin.jpg"}, {"description": "Been to Pistachio Grill for a couple of times already. Chef Khaleed and Agnes are always providing their best food and service. They never fail to bring a smile to people whom I've brought here so far.Personal favourite is the Tomahawk steak which you have to order in advance. The rest of the menu is equally top quality.Agnes...\n\n\n\n\n\n\nWe're so glad to see you again at Pistachio, we missed you! Thank you so much for your continued support and for recommending Pistachio to your friends and family. We hope we don't have to wait too long to welcome you back.\n\n\n\n\n\n\nIt has great food and it's very unique (obviously in a good way). I really recommend this restaurant. The pizza has great dough and everything was perfect. I don't regret anything about going to this restaurant.\n\n\nThank you so much for your stamp of approval. We look forward to your return visit, we have more items on the menu to please your discerning tastebuds.\n\n\n\n\n\n\nWent there for lunch on Sat with friends - quaint and unassuming place, with a very casual vibe. Didn't have any expectations but came recommended from word of mouth.\nWere we surprised when the food arrived - We had chicken wraps, Lebanese and Turkish Platter and the Lava cake and a filo pastry dessert that wasn't on the menu..must say...we...\n\n\n\n\n\n\nWe are so thrilled to learn that you came without any expectation and left impressed enough to write us this wonderful review... thank you so much! We look forward to welcoming you back at Pistachio as we have many more items waiting for you to discover.\n\n\n\n\n\n\nThe Tomahawk steak did not disappoint. It was HUGE and excellent. The beef ribs we had was also great tasting with a generous serving of long grained basmati rice. The fish was a big red snapper and also really fresh and tasty. Then their desserts were all Super delicious and real great value for money. Didn't mind paying for the...\n\n\n\n\n\n\nThank you for taking time to write this wonderful review. Our aim is to serve honest good food to our guests, so we are glad to know that you and your family had a memorable dining experience. We look forward to seeing you all again at Pistachio!\n\n\n\n\n\n\nIt is nice to meet the friendly owner and chef Khaled who is so generous to share with us his secret recipe of the yummy soup we have tasted. It is also good to get to know him and hear about his passion for food and learnt of the great effort he puts into creating every dish with wholesome ingredients...\n\n\n\n\n\n\nThank you for dining at Pistachio and for taking time to write us a review. We are thrilled to know that every item served on your first visit was well-received. Hope to see you again real soon!\n\n\n\n\n\n\nWe tried the Pistachio Grill based off positive reviews in Trip Advisor. Initially we were a little hesitant as it appeared the restaurant was merely a Take-Away, and then surprised that the seating was in front, but in the middle of the mall. That hesitation quickly passed as were warmly greeted by our hostess, Agnes, owner of the Pistachio Grill....\n\n\n\n\n\n\nIt was a great pleasure having you and your family at Pistachio, and thank you so much for your well wishes. We're very happy to hear that our food won your attention, that's most important to us. We look forward to seeing you again, and shall certainly work towards the opening of a bigger, fine-dining Pistachio Grill!\n\n\n\n\n\n\nHe's a big fans of Middle eastern and Mediterranean food that's why I'm trying to give him a surprise. And We have to say the experience is FABULOUS. We totally feel the patience, love and passion in every dish Chef Khaled made. The hummus and the pita bread are incredibly tasty and freshly prepared. The creamy mussels and the mixed...\n\n\n\n\n\n\nThank you so much for findling us online and travelling all the way to give us a try, we are glad that we did not disappoint you. Nothing makes the chef happier than having guests who truly appreciates his passion. Thank you for being such wonderful guests, we look forward to seeing you again!\n\n\n\n\n\n\nDelicious, unpretentious and heartwarming food was what we had when I brought my family to Pistachio Middle Eastern & Mediterranean Grill last Saturday evening. Not only were our stomachs well taken care of, Chef Khaled, Agnes and their team ensured that we had a enjoyable dining experience with their great hospitality. Will definitely be back again!\n\n\nThank you for trying us out and for taking time to write us a review. We are glad that you and your family had a memorable dinner. Hope to have the pleasure of having you all back at Pistachio.\n\n\n\n\n\n\nFood that is absolutely fresh and made simple. Fact is simple dishes are the most difficult to stand out. I must say the chef here put his heart and soul into his food served. Simple deco and no flashy decorations. The food served does the talk. A must try.\n\n\nThe greatest compliment to a chef is the sincere appreciation of his food, and not the peripheral elements. Thank you so much!\n\n\n\n\n\n\nNot your usual Orchard Road or trendy hip location downtown but in the middle of a shopping centre concourse off Balestier Rd. It seems an unlikely place to find an authentic Middle Eastern restaurant owned by Egyptian chef Khaled who is a charming soft spoken man and his lively Singapore wife Agnes. Make a point of ordering the Roast Short...\n\n\n\n\n\n\nThank you for taking time to write us this review. Yes, Pistachio is a place where you can expect the unexpected. We're glad you enjoyed the Angus beef ribs that Chef Khaled took 3.5 hours to prepare. We hope to have the pleasure of welcoming you back soon.\n\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d10460729-Reviews-Pistachio_Grill-Singapore.html", "title": "Pistachio Grill", "type": "restaurant", "channel": "", "category": "event", "location": "20 Ah Hood Road Zhongshan Mall | #01-15 Zhongshan Mall, Singapore 329984, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/be/33/6a/pistachio-restaurant.jpg"}, {"description": "We had a great time with friends, experiencing an alternative to a normal dinner out. We received a warm reception upon arrival and a chance to have several cocktails (no prices!) before we preceded to the dinner which was located upstairs. The management was very accommodating as my wife was in a wheel chair and was very patient and supportive...\n\n\n\nRight from the moment I stepped into the restaurant, I was warmly received by the receptionist and waiter. The ambience is romantic as the place is dimly lit and the place is scented with fragrance, perfect for celebrating my anniversary with my love one.\nWe got to experience fine dinning in the full darkest which is something you don't get...\n\n\n\n\n\nIf you are visiting Singapore (or live there) this restaurant HAS to be on your itinerary. Great food, Attentive and humorous service and a very unique dining experience.\nDon't try to read up on all the details and don't try to figure out what it's all about beforehand. It's much more fun if you go there and let the whole...\n\n\n\n\n\nThe staff here are really helpful and the service is great. I came here alone as I was using a gift voucher and it was still a very fun experience alone but coming here with someone else or in a group would give a different experience as you can discuss the meals as you are eating them. Without giving anything...\n\n\n\n\n\nMy partner and I received this as a gift. I was quite hesitant at first but it was so much fun! The staff were great, the food was so unique and it was enjoyable to have different flavours and textures in each dish. Would highly recommend this!\n\nOur date was perfected by the friendly staff, Debbie. A laughter filled birthday night with her service and passion. Will definitely revisit again for the memorable & sensible experience. Food is undeniably good. Thanks, NOX.\nXian Cong & Ginie - Visited on the 7th April 2017\n\nOverpriced (at ~300 SGD for 2 people) for the quality of the food (mediocre) wine (the same), service (asked to leave the dark room 3 times and still had to wait around 10 minutes until they took everyone in the room to the exit all at once). You are better off drawing the curtains, switching off the light, and dining...\n\n\n\n\n\nI've been to other dining in the dark restaurants elsewhere in the world, but NOX stands out for one major reason-- the food is actually really good. I highly suggest this restaurant for both the food and the experience. The wait staff are all visually impaired, but are absolutely fantastic and attentive.\n\nMy son and myself were there recently to celebrate his 10th bday and i think there couldn't have a better way to celebrate. The place gave us a great sense of privilege and inspiration. Food quality is good, it is a bit pricey but the experience you get is priceless. Concept is outstanding. Leo our server (visually impaired) was friendly,...\n\n\n\n\n\ni really enjoyed every moment of my night at NOX. my fiance and i are not frequent customers of fine dining as we are quite thrifty. however, i decided to surprise him with this experience though i was unsure myself if i could be functional in the dark. he turned out extremely impressed with NOX.\nwe were about 15mins late...\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d4611806-Reviews-NOX_Dine_in_the_Dark-Singapore.html", "title": "NOX - Dine in the Dark", "type": "restaurant", "channel": "", "category": "event", "location": "269 Beach Road, Singapore 199546, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/56/fe/e0/nox-dine-in-the-dark.jpg"}, {"description": "Cocktails are definitely a MUST try! Not watered down or served in mini scale proportions! Which makes the price justifiable!Nice view, good food and excellent service. Was there to celebrate my wife birthday and we had enjoyed the view, food and ambience.\n\nGood ambience with a great view for dinner. The bread is good; we had the crab salad and octopus as appetisers. Main courses were slow cook pork and Angus tenderloin. All tasted great. The draft beer was ok only.\n\nBoth of us enjoyed the cuisine except for the Duck Tartar. The lighting could be slightly brighter. Will recommend friends.\n\nBesides the modern stylish ambience and the cool outdoor bar with stunning views over the Spore bay, the food is the most exciting entertainment in this upscale but easy going gourmet heaven. Even the \"have seen and tasted it already\" tongues under us will get surprised faces when they go through the courses. Top meat and seafood quality prepared to...\n\n\n\n\n\nAmazing food, great service and very attentive staffs. My Mother enjoyed the terrific view of Singapore. So much attention to details including food and drinks. We LOVE IT!\n\nCertainly a great place for business lunch. At the top of the newly opened CapitaGreen building near Raffles Place, this French Mediterranean inspired cuisine is really unique in Singapore. Great views towards Marina Bay and the city skyline while very fine dining but not at excobitant prices. Set menu is reasonable. Dishes very much on the creative side but maybe...\n\n\n\n\n\nI had a pleasant dinner there with my wife to celebrate her Bday.\nWindow seat is arranged and we enjoyed the wonderful view in the whole dinner experience.\nThe service and food is great, but just a bit overpriced, to be frank.\n\nI love trying new restaurants or gastronomic events in Singapore as I am quite a foodie. After the Sustainable Seafood Dinner of last night, Artemis has really become one of my favorites! Not only was the food unusual (razor clams & sea urchin pasta, smoked eel & white asparagus...) but it was truly excellent! The Chef must have spent a...\n\n\n\n\n\nOrdered the steak, came done perfectly medium rare. Loved the potato sides. All in all, about what I expected, pricey, but then Singapore restaurants are always overpriced. One of the better meals with a view in center of business district\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d9564584-Reviews-Artemis-Singapore.html", "title": "Artemis", "type": "restaurant", "channel": "", "category": "event", "location": "138 Market Street | Level 40 CapitaGreen Rooftop, Singapore 048946, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/8d/5b/7f/artemis.jpg"}, {"description": "Although this food court is far away from the downtown, you can tried the good food when you see there is long queue, the satay and curry puff are good, the fried noodle is sweet and the seafood inside is fresh and deliciousUsed to stay Old Airport Road during my childhood with my family and aunts.\nLast Saturday night (8 Apr 2017) took my aunts back to this hawker centre for dinner. A place that brought back lots of memories.\nIt was 8.05pm on a Saturday night. The hawker centre was packed with people. Mang patrons waited for seats. Queue at most...\n\n\n\n\n\nUndisputed king of Hawker centres. Largest variety of food choices. My favourite is the prawn noodles. Of the few stalls available, my vote goes to the Whitely prawn noodles. Also a favourite is the chay Kway teow. Ng to be missed is the Hougang wanton noodles. Finish your meals with freshly made curry puffs that are generous with stuffing.\nOne...\n\n\n\n\n\n100+ stalls, each with exotic & extraordinary delicious food sold by passionate sellers! I enjoy:\n1. Nam sing hokkien fried mee (4/5)\n2. Toa payoh rujak (4/5)\n3. Wangwang crispy curry puff: blackpepper flavor (4/5)\n4. Sugar cane water (5/5)\n5. Soursoup juice (5/5)\n6. Selera Rasa nasi kebuli (4.5/5)\nYou can get Sugarcane water everywhere in this Foodcentre but...\n\n\n\n\n\nWide selection of food for any time in the day. Hardly any tourists. Highly recommended, go for the stalls with queues like any good Singaporean does! :)\n\nA favourite haunt, always good food with plenty of choice. Recommend the popiah on the front row and curry puff's on the back row. Sit at the edge as cooler than inside.\n\nMy all time favourite hawker centre. There's so many diff local food to choose from and most of them are really good!\n\nVery good with a wide range of local Singaporean food, but sometimes have to wait for at least half an hour especially Sat and Sun Evening. But’ it’s worth going there. We were so glad to experience so much local food culture here.\n\nThis place have so many choice of food, and many of the look and smell tasty.\nI tried fried wonton noodle on #2 stall, prawn noodle on #10. The wonton noodle is yummy, and the prawn is fresh.\nThis is recommended place for hawker food hunter.\n\nWhere do the locals go to avoid the tourists? Here. When my wife and I arrived about 7.00pm the centre was packed , but hardly a non Asian in sight. There are well over one hundred stalls offering everything Asian, all at very reasonable prices. My minced chicken with chilli (lots) and basil was $5.00, my Carlsberg beer was $7....\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d1146830-Reviews-Old_Airport_Rd_Food_Centre-Singapore.html", "title": "Old Airport Rd Food Centre", "type": "restaurant", "channel": "", "category": "event", "location": "Block 51, Old Airport Rd | Geylang, Singapore 390051, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/4a/93/85/kallang-airport-food.jpg"}, {"description": "The food is awesome at MTR. Specially their rava idly and podi dosa. Coffee is good and so is the badam milk shake.Beware of over crowding and Long queues during peak hours.\nAlmost all South Indian tiffin items are available. Except their 'pongal' everything tastes good. Especially the aromatic coffee. The waiters can behave pleasantly to the customers. The way they serve can be a little polite and pleasant.\n\nGood food and good service. A must try is the Ragi Dosa, Pudi Dosa and the Rava Idli. Of course, the filter coffee is a must try too. The staff is friendly and attentive. Do take the time to read the history of MTR restaurant as well as the story behind some of their signature dishes.\nOverall, a super culinary...\n\n\n\n\n\nSmall place, but clean & efficient service. Probably the best southindian tiffin joint in Singapore. We also tried the place next door but it was average at best.\nThis place is much better than even then lots of south indian eats in Mumbai.\n\nWe just absolutely love this place.. we bring our 10 year old daughter here and hope that we can bring our grand kids someday as well :). Building memories.. The food is amazing and payasam is to die for. Every time we visit this place, we wonder why we didn't come earlier. The staff are lovely- very attentive and the...\n\n\n\n\n\nAmazing Indian food. Wonderful flavours, generous helpings. You truly can't go wrong here.\nAs a western person I really like the dosa masala and bisibele bhath.\nBut the set meal is a steal at 12 dollars, as you get a bit of everything!\n\nWe were there on a Sunday and there were lots of people and a long queue but surprisingly we got a table immediately.\nWe tried the weekend Menu and a few other dishes all of which came with surprising tastes and sometimes quite spicy but still good for our taste.\nWe really liked it and price was very good. Also...\n\n\n\n\n\nMTR is in little india . Food was good . They have an system of pay and go sit - they serve you ... liked the food . Coffee was not upto the bengaluru MTR flavour ... packed during weekends ...\n\nMTR is a must visit during a visit to Serangoon road . The authentic South ka khana is delight especially the Ravi Idli and the masala dosa. Very pocket friendly + clean ambience + fast service . Must visit in little India\n\nIf you haven't been to MTR then you are missing the best vegetarian Indian food in Singapore. Go there and order the sambar idly and the dosai. Go now!\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d4304406-Reviews-MTR_Restaurant-Singapore.html", "title": "MTR Restaurant", "type": "restaurant", "channel": "", "category": "event", "location": "438 Serangoon Road | #438, Opposite Sri Srinivasa Perumal Temple, Singapore 218133, Singapore (Formerly Mtr)", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/bd/3b/2c/mtr-singapore.jpg"}, {"description": "food here is pretty decent, but this place is mainly for wine lovers! has an area to shop for wholesale wine as well. good service, and nice relaxing vibes.\nHi geraldchan, thanks for providing your feedback. We're glad you like our food, good service and relaxing atmosphere. We definitely have retail outlets spread across to cater to all wine lovers around Singapore. Hope to see you again!\n\n\n\n\n\n\nI love going to this place over and over again simply bcos the food, ambience and staff are awesome. The lava cake especially with vanilla ice cream was exceptionally wonderful.\n\n\nHi Wineglass2000, thank you for your great review! We're glad that you enjoy our food, ambience and service, especially our lava cake! See you again soon!\n\n\n\n\n\n\nCosy ambience, great value for money for drinks.\nAttentive service, waitress was knowledgable about the wines on the menu. 'Twas a great help.\nAmazing experience overall.\nWill definitely come back , no doubt.\n\nGreat place, location & prices. food is good and prices are reasonable\nwill surely return again. escpecially for dinner. ambienece is great\n\nFood, service, and wine is good. Nice atmosphere. Very helpful waitress who was knowledgeable about the wines. Only wish it opened till later.\n\n\nHi Nah C, thank you for your review. We're glad you enjoyed our food, service, wine and atmosphere. We're happy to hear that our staff was helpful and knowledgeable about the wines! Do come down to Wine Connection earlier in the future! We hope to see you back soon!\n\n\n\n\n\n\nCosy ambience, attentive service and great value for money for food and drinks!\nAlways love coming back!\n\n\nHi HUI Z, thank you for your review. We're glad you enjoyed our ambience, service and that you find our food and drinks of great value. We'd love to have you back soon!\n\n\n\n\n\n\nThe food was good. The service was great. It was an overall pleasant lunch. We had the paella which was very tasty. The fish and chips and chicken parmigiana were well made.\n\n\nHi Roland P, thank you for your review. We're glad you enjoyed our food and service. Hope to see you back here soon!\n\n\n\n\n\n\nI took a friend for her birthday dinner to Wine Connection at HILLV2. The service was horrible. Alrhough I had made reservations, we waited at the entrance for the staff to notice us. The staff did notice us standing there for quite sometime but chose to ignore us. Finally, we were seated. When I questioned one of the service staff,...\n\n\n\n\n\n\nHi Malar007, thank you for providing your feedback. We're sorry to hear about the service our staff provided. Please be assured that this is not the standard of service we are known for and that we will escalate your feedback to the management to ensure this does not happen again. If you have more information to share, please email us...\n\n\n\n\n\n\nIt's a great place for dinner. This was recommend by my Singapore friend, never disappoint me! My last dinner at Singapore with full of memory. Thanks to everyone, service is excellent!\n\n\nHi MagnusManh, thank you for your great review. We're glad that you had a memorable experience for your last dinner in Singapore at Wine Connection. Special thanks to your friend for recommending us! Do come back to Wine Connection the next time you're in Singapore!\n\n\n\n\n\n\nto rate this place as an italian cuisine restaurant is an insult to italy culinary culture ! poor quality iningredients very bad\n\n\nHi Hoanghai B, thank you for your feedback. We're sorry to hear that our food ingredients was not up to expectations. Do kindly email us at fbops@wineconnection.com with more information as we would like to hear more from you. We hope you have a nice day.\n\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d7082243-Reviews-Wine_Connection_Bistro_at_HillV2-Singapore.html", "title": "Wine Connection Bistro at HillV2", "type": "restaurant", "channel": "", "category": "event", "location": "4 Hillview Rise The Hillier | #02-05/06, Singapore 667979, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/06/91/09/6b/getlstd-property-photo.jpg"}, {"description": "I recommend this restaurant to everyone and would like to visit again. A good selection also for vegetarians.Great to return to this little gem. The servers are SO good and nothing was too much trouble. They even remembered my partner from last year.\nThe butter chicken was hiked up just right the garlic naan one of the best I've had for a while and he even cooked me some french fries(I know I'm a heathen!) Thee whole...\n\n\n\n\n\nPlenty of good authentic Indian food at a reasonable price. Plenty of seats even during lunch time. No ambience as it's set up like a canteen\n\nI did a good choice. The food is very tasty and the service very kind and fast. I have ordered the Lamb Vindaloo and I was very satisfied. I have ordered \"spicy level 4\", too much for me. The owner (I think he was) was there looking at the customers and he realized it was to strong. Without asking, he...\n\n\n\n\n\nSituated at Orchard Street this was a blessing to our hungry belly while shopping. Expensive if you are comparing with India or even some shops @ Little India, but worth it. We paid 110 bucks for a lavish meal with non-alcoholic drinks.\n\nWe had the prawn stuffed with crabmeat. It sounds better than it tastes and was probably overcooked. The chicken vindaloo could have been hotter, but that's because the very friendly waiter advised us to order only a 2 out of 10 on the spiciness scale. He had good intentions, I guess. We were there for lunch on a Monday, so...\n\n\n\n\n\n\nDear Dan d\nGreetings from the Curry Culture\nSir, it was a pleasure to serve the two of you -a little surprised with the feedback - thought you actually enjoyed the entire meal :):)\nBut feedback takenand in good faith, and I am happy that the service upto the mark -I think the server was more concerned about your health...\n\n\n\n\n\n\nThe 3 starter sauces with the papadams are awesome. However the papadams themselves were a bit hit and miss, some were cracking, some were softer. Furthermore we had great garlic naan, chicken tikka was pretty good, the bhindi (ladyfingers, okra) were excellent. The dhal was a bit too thin for myself. Service was good and friendly. Would definitely come back!\n\n\nDear Oliver V\nGreetings from the Curry Culture\nSir, a pleasure to serve the both of you - it was nice to have a bit of a laugh as well:):)\nVery happy that we were able to match your expectations , on the food as well as the service. Sometimes people can get caught up in the hype of everything...\n\n\n\n\n\n\nI just ate the best lamb vindaloo curry that I've ever eaten. The service is exceptional, the food is superb and the atmosphere is very pleasant. My second time here and the consistency is obvious. If you like curry and are in Singapore The Curry Culture is a must do.\n\n\nDear Joelstravelreviews\nGreetings from the Curry Culture\nSir, a pleasure - it was actually nice to have met up and have a bit of a chat with you as well:):).Lunch times are generally nice and relaxed\nSir, very happy that you enjoyed the vindaloo - the boys in the kitchen take great pride in their cuisine and , very pleasing...\n\n\n\n\n\n\nWe ordered food through Deliveroo. The order came on time but when we opened the food, the food was inedible as it had hair in it. Not one by mistake but few. I complained thru Deliveroo but there was no response.\nI hope the restaurant improves its food quality.\n\n\nDear Cpktn\nGreetings from the Curry Culture\nSir, this is a shocker for us as well - very very disappointed to know that something like this has occurred and I totally understand and sincerely apologise- we order and eat food ourselves as well and can be a big downer for sure\nSir, we have been in business for a long...\n\n\n\n\n\n\nSorry to say that we weren't impressed with this place, due to the cost of the meals and the small nature of the dishes. We had chicken curry and lamb biriyani with a couple of drinks plus a child's meal and it came to around 145 Singapore dollars. Really not good value especially given the size of the portions which...\n\n\n\n\n\n\nDear J01976,\nGreetings from the Curry Culture\nSir, was a pleasure to serve the 3 of you - sense your dis appointment but also happy that , at least the food and service was upto your expectation .We do try though:):)\nYessir , I do understand your dis appointment with the pricing in Singapore but yes, the drinks are a...\n\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d3512529-Reviews-The_Curry_Culture-Singapore.html", "title": "The Curry Culture", "type": "restaurant", "channel": "", "category": "event", "location": "31 Cuppage Road Cuppage Terrace | Cuppage Rd, Singapore 229457, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/f6/25/f2/the-curry-culture.jpg"}, {"description": "We made a reservation by mail in advance and the restaurant replied immediately. They even asked for special occasion...I asked for a romantic table for two, which we got.It was a very nice atmosphere with dimmed lights.\nService was great and attentive.\nThe food was ok. Hand cut fries weren't very delicious, also the grass fed beef steak...\n\n\n\n\n\nI visit Cut Beverly Hills whenever I'm in LA so when my wife and I found there was a Cut near our hotel it was a no brainer!\nThe feel of the place is similar although darker and the menu familiar. We both opted for the wagyu fillet with a variety of side dishes. The food was very good but...\n\n\n\n\n\nLate booking didn't work here, but I'm not surprised. It's a superbly presented, professional set-up - and expensive even for Singapore.\nI made the walk-in and sat at a table in front of the bar. The staff was clearly accustomed to welcoming and serving sad, sole, business clients. They were excellent!\nThis was my treat night, so I stuck to...\n\n\n\n\n\nWe came by only for drinks and i ordered the house speciality , Rough love. It came with campagne inside it.( forgotten the coction) had a nice little raspberry balanced on top of a big ice block. Great presentation and taste! Fruity taste. Not cheap at sgd 26 but worth a try at least once!\n\nPart of the \"celebrity restaurants\" area in the Marina Bay mall. Happy to take a walk in, very friendly staff.\nI had the Tuna Tartare and the Baby Chicken. Tuna was fabulous, amazing flavour combination, with the sweetness of the tuna and avocado being balanced by the heat in the sauce, the peppery crisp and thr mellow wasabi aioli\nThe...\n\n\n\n\n\nThe service was not outstanding, but good. The atmosphere from the outside looks a bit uninviting and sterile, but as you delve deeper into the restaurant there is a lovely buzzing ambiance.\nThe food itself has a nice range of starters, but for main courses expect nothing but steak--understandably. The prices are expensive ranging from around $80 for the cheapest...\n\n\n\n\n\nAttended a private event here. My first time at the restaurant and I was amazed by the ambiance of the restaurant and the service of the staff here - really courteous and professional. We had the Wagyu beef and it was simply excellent!\n\nThe restaurant looks unappealing on the outside but the inside is a very signature style of Wolfgang Puck's restaurants. Sam gave really awesome recommendations and we had no regrets with the food! Jerry had a great sense of humour and our overall dining experience was an incredible one! Service is prompt, faster than we expected. Price point was very reasonable,...\n\n\n\n\n\nCut isn't an ordinary steakhouse. The hostesses are friendly the service is impeccable, the cocktails are out of this world (they have their own cocktail program), music is cool, and the food of course is rock solid! As soon as you walk into the restaurant, you feel special, funny enough one of the best things on their menu is the...\n\n\n\n\n\nWhat a memorable steak dinner from a renowned celebrity chef! The breads and starter were perfect pre-cursors to the entrees. We made sure not to stuff ourselves too much. The steaks were divine! Service was also superb. Kudos to Nickson, Ryan, and especially Angeline for the warm and hospitable service!\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d2002823-Reviews-Cut_by_Wolfgang_Puck-Singapore.html", "title": "Cut by Wolfgang Puck", "type": "restaurant", "channel": "", "category": "event", "location": "2 Bayfront Avenue | The Shoppes at Marina Bay Sands, B1-71 (Next to the Theater), Galleria Level, Singapore 018972, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/ca/89/38/cut-by-wolfgang-puck.jpg"}, {"description": "Although the food was good, the prices are very high. Service was OK. Can find better value elsewhere.Superb\nThe most delicious food we have eaten anywhere in the world.\nCannot praise this restaurant highly enough. Ambience is calm and comfortable, plenty of space between tables, carpeted floors and beautiful simple elegant decor\nService was exemplary. Waitress knowledgable, friendly, polite but not intrusive.\nWe had the wine pairing menu and found the charming Sommeliers recommendations perfectly complemented the...\n\n\n\n\n\ngood food off the ala carte menu, staff were friendly and prompt, nice ambience, would definitely come back again\n\nA spectacular and reasonably priced lunch at Rhubarb le Restaurant. A french styled Michelin starred restaurant in the centre of Chinatown, Singapore. We did get an amuse bouche and petit fours too and plenty of freshly baked bread.\nUnlike the two other starred restaurants we ate in on this trip, this one was what I'd consider to be a proper...\n\n\n\n\n\nI've tried a lot of French fine dining places in Singapore. I had seen on TripAdvisor that Le Rhubarb was ranked #5 and so decided to go with my boyfriend.\nThe atmosphere is very nice, pure almost minimalistic, Japanese style. The service is really good, Jerome and Francis did a great job at serving us and providing advice on the...\n\n\n\n\n\nThis is one of our favourite restaurants. The food is amongst the best I have ever had. Having been quite a number of times, and tried many different dishes, I have yet to have one that is not exceptional .\nJerome and the team deliver warm service that set's it apart from many restaurants with great food. You really feel...\n\n\n\n\n\nAs others have said there are limited covers, approx 20. We visited mid week and the restaurant was almost full. The food is really really good. Tastes are superb. Service excellent. A great night. Not inexpensive. Our 3 course meal for 2 with tip was around 500 SGD. But worth it.\n\nThe most perfect setting for a romantic valentines meal. My partner can be a bit resistant on the “marketing machine” of special days, however when he launches himself into the sensational food at Rhubarb, he mysteriously ends up being quite content and happy to be celebrating - just as you want him to be!\nThis is our second dining at...\n\n\n\n\n\nOwned and run by a conscientious and very capable Englishman - this place has lots of good things to offer.\nWe had the set menu for the evening for 4 people - on a Tues night - it was a handful of tables in a very intimate setting (about a dozen tables). Food was superb. There were ingredients I don't...\n\n\n\n\n\nAs it was for a special occasion we decided to go for the 5-course set menu and it was superb. Special mention for the foie gras and the venison, very nicely prepared and accommodated. Based on advice we had the meal washed down with a Saint-Joseph an excellent Côte-Rôtie, reasonably priced for the quality it offered. Service was professional yet...\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d7060741-Reviews-Rhubarb-Singapore.html", "title": "Rhubarb", "type": "restaurant", "channel": "", "category": "event", "location": "3 Duxton Hill, Singapore 089589, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/07/48/fa/6e/rhubarb.jpg"}, {"description": "Was there last Sunday and everything was excellent. The varieties, the ambience, and the service were so impeccable. Chef Sky and chef Alex were so attentive to our request and thumbs up for them !! Definitely will b back !!Was there in Dec with colleagues to celebrate long service award.\nThe food spread was really good, fresh seafood cold dish, freshly juice from selection of fresh fruits, slated egg pork rib was good and the dessert was replace by seasonal cakes like Christmas log cake, pudding and etc. Wide range of teas and coffee to end the sumptuous meal....\n\n\n\n\n\nI went to The Colony for a buffet dinner and I enjoyed it. It was a bit unusual having the buffet spread out throughout the restaurant and I was maybe expecting more options in terms of desserts but everything else was top notch. Service staff was also quite attentive. I would definitely go back again.\n\nI can say this is my favourite buffet in singapore. The seafood variety is amazing, the chicken rice is great! Leave space for Desserts!\n\nFour varieties of fresh oysters and the most delectable spread of salads - this was how I started my buffet dinner at Colony. I must say that the seafood served here was quite all encompassing: baked lobster, sashimi, chili crab, crayfish, grilled fish, etc etc. you are really spoilt for choice!\nDesserts - all the usual could be had, but...\n\n\n\n\n\nImpressive as always. Very high quality food for a buffet spread of this size. Despite a full restaurant, the service staff were attentive and extremely pleasant.\n\nA good place to chill and catch up with friends and colleagues. Nice atmosphere. Food wise, the selection is a bit limited and quality of food is just a little above average, but they have good pastries through!\n\nFood is consistently good with all the usual buffet favorites and then some. The venue itself is beautiful and service always impeccable. I find it excellent value for the price and would not hesitate to return.\n\nExcellent Service and dinning atmosphere was great! In love with the variety and quality of food served.\n\nThe newly revamped Colony not only looks beautiful, but is also THE place to have a great buffet.\nThe stations are endless, and you do need lots of stomach space to be able to try everything, which is not possible in one visit.\nNot only does it win on variety, but on quality as well. The Indian food corner, where...\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d8571637-Reviews-Colony-Singapore.html", "title": "Colony", "type": "restaurant", "channel": "", "category": "event", "location": "7 Raffles Avenue Ritz Carlton Millenia Singapore | The Ritz-Carlton, Millenia Singapore, Singapore 039799, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/09/09/6c/6d/colony.jpg"}, {"description": "I was expecting the experience at Restaurant Andre to be exceptional, but I didn't expect it to make me this emotional. I literally had to pause to recover from the assault of flavours to my senses (in a good way). Perfect for a special occasion meal, or just because you can and want to.After reading so many good reviews of Restaurant Andre, I decided to have dinner there with my friends, although I was quite reluctant to spend much money on French food. As my preference was Chinese OR Japanese food. I was prepared to complain what so great about the food, especially we have gone through such a long wait for the...\n\n\n\n\n\nThe food and everything there are extraordinarily designed, creative, beautiful and unique until I don't want to have. The taste is also very delicious and worth trying at least once in your lifetime!\n\nMy wife and I first went to Andre three years ago and with high expectations and I was surprised to find that the menu and service exceeded my expectations. I thought \"OK high end French food, a lot of drama with less substance\" but we enjoyed every course. Each time something new came to the table it was an experience...\n\n\n\n\n\natmosphere was serene and charming\nfood was marvelous\nservice was personalised , great attention was given by the team to us.\n\nFood was really good, a real dining event, not for the faint of heart! Chef Andre personally comes out to meet you and tell you a little bit about how the dishes came to be.\n\nHard to add new descriptors of the meal and experience that haven't already been shared. From arrival to departure 3.5 hours later, the service and ambience created was almost faultless - a warm and chatty welcome from Chef Andre, a knowledgeable sommelier and wait staff, perfect pacing of the meal, beautiful presentations, clever ingredient combinations, uses and techniques. Yes, it...\n\n\n\n\n\nA friend treated me to dinner at Andre recently. Over 20 items in \"small\" portions so we ended up very well fed. The food and philosophy place this restaurant along the top in Singapore if not in the region. Chef Andre wasn't there (he was on his way back from Taiwan where he has another restaurant) but things were humming...\n\n\n\n\n\nthe experience dining at Restaurant Andre would've been better and this couldve been a 5-star instead. There is no doubt that the food that was created by Chef Andre was phenomenal, I especially liked the edible charcoal! The foie gras chawanmushi (Chef Andre's signature dish) was a little overwhelming...\nOther than that, excellent appetizers & desserts. Would go back once...\n\n\n\n\n\nThe food and service is amazing... they serve a set menu and bookings are months in advance. Everything is well thought out, from the furniture (my table is sanded by hand regularly by Andre himself) to the service. The tables are well set apart on two floors. The food is imaginative - think chocolate + garlic served as 'dirt' with...\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d2077234-Reviews-Restaurant_Andre-Singapore.html", "title": "Restaurant Andre", "type": "restaurant", "channel": "", "category": "event", "location": "41 Bukit Pasoh Road, Singapore 089855, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/d8/3d/69/restaurant-andre.jpg"}, {"description": "Food is yummy, everything is fresh, portions are generous and the interior is really well thought through! Just what you need to conclude that this is indeed an awesome place.Place you dont want to miss, awesome food, great to socialize and have fun. Vodka selection is amazing.\n\nThanks so much to all the staff at My Awesome Cafe for hosting our football clubs post charity event food and drinks on Sunday 9th April.\nThe service was fantastic throughout the day, with all guests especially loving the food platters and signature drinks!\nVery impressive to see the cafe still cater for other guests as well, squeezing tables in...\n\n\n\n\n\nSingapore is a bustle - let's face it. To be immediately welcomed and made to feel as though your are part of the family from the moment you sit down till the moment you lick the plate clean (as the food is to die for) makes visiting My Awesome Café one of my first things to do every time I...\n\n\n\n\n\nFirst of all, food is terrible. we ordered a sandwich set and the bread was hard and dry, ham was tastless. basil chicken was nice however.\nand the coffee they make us was terrible, bitter like Chinese medicine (maybe they did it to match the deco of this place?)\nthe deco is AWESOME tho. we and my girl had a...\n\n\n\n\n\nAlways there for the Awesome Salad, which is my favorite Item on the menu. We are generally not a salad country, so whenever I chance upon a restaurant that offers a great salad, i get excited! Owner Franck also brings in specialty tequila and Whiskies that you won't find elsewhere, we tried one of the tequila's (can't remember what it...\n\n\n\n\n\nI've been here a couple of times and I always liked the vibe. My most recent experience included a freshly baked slice of pineapple upside-down cake and Baileys on coconut ice-cream that is to-die-for. Highly recommended for a relaxed evening with friends.\n\nIts rare for me to come in to Town on a Sunday but I must say today's trip was worth it as I enjoyed their Breakfast set . Nice coffee and excellent service! Recommending to everyone!\n\nAwesome isn't strong enough for this fantastic lively restaurant. Crawling with both visitors and youngish business people from the surrounding area, this place has friendly servers and great food. Highly recommend the \"awesome salad\" where they fly in five types of mesquite salad from Australia twice a week. Includes chicken, duck and smoked salmon; I added prawns. My wife had...\n\n\n\n\n\nThis cafe is a must do when in Singapore. Without a doubt it has the best atmosphere you can find in the whole city. Franck and his team are the best in the business and everything is done with love and care. Not to mention, the pesto is insane!!!\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d6405257-Reviews-My_Awesome_Cafe-Singapore.html", "title": "My Awesome Cafe", "type": "restaurant", "channel": "", "category": "event", "location": "202 Telok Ayer Street, Singapore 068639, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/09/c5/ae/93/our-historical-facade.jpg"}, {"description": "If you are someone who appreciates fine food, you'll love this place. A true celebration of exquisite Italian cuisine, prepared by a chef who is passionate about serving and​ delighting​ her guests. This is not a cheap place, nor somewhere to go if you're in a hurry. We went as a celebration for our last night in Singapore and loved...\n\n\n\nIf you're fond of Itallian cuisine, this is the place to be. I was surprised by the delicious courses and wonderful service. Will be back again with more customers for you!\nKeep it up!!\n\nMy first time to dine in this restaurant, the food are really good, I like the cappuccino soup, and will return for it.\n\nCame for dinner...went home with an absolutely new experience in Italian fine dining! Got a well surprise menu. Thanks to u!!\n\nWe had a great experience here with lovely food and great service. Particularly like the concept with no menu, but yet the possibility to adjust in case certain things on the menu that day isn't preferred\n\nThe service was excellent throughout. The food was very good; some dishes were better than others. The pasta at the end was great. The rest of the courses were all well made, but none of them were memorable. The amount of food provided over the entire dinner was not enough for me. I left wanting for more. But in the...\n\n\n\n\n\nWhat a fantastic restaurant. Food was magnificent. Service was equally so. One of the owners also explained every dish and the Italian origins of the dish.\nSo good we booked the restaurant for a large group as a treat for an upcoming trade show.\nI believe it is one of the best restaurants in Singapore.\nAbsolutely fabulous.\n\nI was greeted with a smile by one of their staff the moment I entered. We were led to our table which was neatly set and the vibe we get from the environment was very homely.\nAs their concept doesn't have a menu (the anticipation between dishes was really exciting), the crew were very attentive to our needs, explicit as...\n\n\n\n\n\nIn many ways just repeating what others have said. This is an outstanding restaurant. From the initial booking - which was followed by a whatsapp message asking if we had any special requests - through to the table outside, the quality of the food, the presentation and explanations and the overall service standards. It really was impossible to fault. One...\n\n\n\n\n\nI had dinner here last Friday night, based on the Trip Advisor #2 ranking, and found the ranking was off - I can't believe there's a better restaurant in Singapore than Fratini La Trattoria. I had one of the best meals ever, anywhere, and I think that's saying a lot for a New Yorker who's spent multiple times in Paris,...\n\n\n\n\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d4930299-Reviews-Fratini_La_Trattoria-Singapore.html", "title": "Fratini La Trattoria", "type": "restaurant", "channel": "", "category": "event", "location": "10 Greenwood Avenue | Hillcrest Park, Singapore 289201, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/96/eb/52/appetisers.jpg"}, {"description": "Entre-nous crêperie is a little piece of France, or better Brittany, in Singapore. Their sweet crêpes and savoury galettes are well-made and very tasty. The menu offers a wide choice of toppings. In addition, they offer typical French bistro drinks like menthe à l'eau (still water with peppermint syrup), and if you fall in love with their salted caramel, you...\n\n\n\nThe crepes were the best I have ever eaten, even though the lady which greeted us was not very friendly. We had 3 of the crepes title favourites and 1 with ice cream. They were all fantastic, each having a unique and delectable taste. I would definitely visit again since it is value for money. (Around 15-20 dollars per pax)\n\nCreperie Entre-Nous is a cafe-like restaurant with hipster vibes. The menu boasts a wide range of both sweet and savoury crepes. Great for all ages!\nI recommend the Crepe Suzette.\n\nWhenever I come to Singapore I make a point to add a few extra hours to my transit to visit Entre-Nous. A trip to Singapore is not a good online unless I have visited.\nThey serve both sweet and savoury crepes and I still cannot decide which is my favourite - but I make sure to have one of each...\n\n\n\n\n\nFinding suitable food for 2 coeliacs in Singapore has not proved easy, so discovering a little Breton creperie where pancakes can be made either with wheat or pure buckwheat (NOT related to wheat) was a joy. Although we were the only diners early on a Wednesday evening, the place is obviously busy at lunchtimes. Great choice of authentic Breton ciders...\n\n\n\n\n\nI tried a savory and a sweet crepe. The savory one was with cheese and ham and egg, and it was really nothing special. The cheese they use for it was not ideal, the egg and ham were only average quality, and the final taste was fairly bland. The sweet crepe on the other hand was wonderful. I chose one...\n\n\n\n\n\nStopped by for a late afternoon snack. We ordered a ham and mushroom savoury crepe and a whipped cream dessert crepe to share. They were delicious and not a disappointment at all. If I were to nitpick, the savoury was just a tad salty and the dessert crepe a tad sweet. But it was tasty and we are likely to...\n\n\n\n\n\nWe went for dinner here this evening. It was fantastic from start to finish. From excellent service to delicious food all round.\nReally attentive staff who made great recommendations on menu choices. Salted butter caramel was just delightful!\nWill definitely be back. Just wish I'd found it sooner.\nIf you can a chance - go! You'll not be disappointed\n\nThe manager running this restaurant, French, is the real deal. She is awesome, and worked with me to assure gluten free and zero risk of cross-contamination. Gluten free or not, this place is great, delicious, and authentic Crapes. I would put this in the MUST VISIT category while in Singapore. Oh, and don't forget the cider. They have a great...\n\n\n\n\n\nThe crêpes we had, were delicious . Although filled with cheese, chicken, vegetables, the crêpes themselves were still crispy. Finally we got some real good cheese in Signapore! The service was very nice and friendly.\n", "price": "", "link": "https://www.tripadvisor.com/Restaurant_Review-g294265-d1193730-Reviews-Creperie_Entre_Nous-Singapore.html", "title": "Creperie Entre-Nous", "type": "restaurant", "channel": "", "category": "event", "location": "27 Seah Street | Suite 01-01, Singapore 188383, Singapore ", "time": "", "image": "https://media-cdn.tripadvisor.com/media/photo-s/0c/a6/3d/45/creperie-entre-nous.jpg"}]