{"item": [{"title": "ESPN Forecast: Predicting winners for first round of NBA playoffs", "category": "news", "type": "sports", "channel": "ESPN", "time": "Sat, 15 Apr 2017 02:38:23 EST", "location": "United States", "price": 0, "image": "", "description": "Tom Haberstroh goes inside the numbers to reveal why it will be very difficult for Cleveland to repeat as NBA champions. (1:15)Who will advance to the second round of the NBA playoffs? We polled the ESPN Forecast panel of experts.Here are the results, displaying each team's chances to win the series, along with predictions from ESPN's Basketball Power Index (BPI), FiveThirtyEight and a fan poll.ESPN Forecast and the fan panel predictions were conducted in coordination with Microsoft Research.", "link": "http://www.espn.com/nba/story/_/id/19157195/2017-nba-playoffs-predicting-winners-round-1"}, {"title": "Having fun yet? Cavs hoping to make joyful noise in playoffs", "category": "news", "type": "sports", "channel": "ESPN", "time": "Sat, 15 Apr 2017 02:35:20 EST", "location": "United States", "price": 0, "image": "", "description": "The playoffs are here, and Cleveland has its share of detractors. But LeBron James has shown the competitive fire to silence doubters before. (0:19)Thursday night the Cleveland Cavaliers planned a team dinner, an annual event on the eve of the playoffs meant to boost camaraderie and usher in togetherness before the grind of the second season begins.They might need it.There have been a handful of thorns in the defending champs' side during the regular season. They have had some technical issues and they have had some health issues -- but what has been unexpected is some spiritual issues. The Cavs haven't been having much fun lately.", "link": "http://www.espn.com/nba/story/_/id/19154818/2017-nba-playoffs-cleveland-cavaliers-hoping-make-joyful-noise"}, {"title": "Heap hits, kills daughter in driveway accident", "category": "news", "type": "sports", "channel": "ESPN", "time": "Sat, 15 Apr 2017 00:38:32 EST", "location": "United States", "price": 0, "image": "", "description": "Retired Pro Bowl tight end Todd Heap accidentally struck and killed his 3-year-old daughter Friday afternoon while moving his truck, according to Mesa, Arizona, police.The incident happened in the driveway of a home in the gated community of Las Sendas. Police responded to a car/pedestrian accident about 3:45 p.m. and were told the girl was on the driveway when Heap moved the truck forward and hit her.She was taken to a local hospital, where she died, police said.Heap exhibited no signs of impairment, according to officials. The investigation into the incident is ongoing.", "link": "http://www.espn.com/nfl/story/_/id/19161911/todd-heap-accidentally-hits-kills-3-year-old-daughter-moving-truck"}, {"title": "Sources: Frustrated Porzingis skips meetings", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 20:28:37 EST", "location": "United States", "price": 0, "image": "", "description": "Ian Begley says Phil Jackson should have immense concern about Kristaps Porzingis skipping an exit meeting out of frustration with the lack of direction for the franchise. (1:44)Kristaps Porzingis skipped exit meetings with New York Knicks management due to frustration over what he perceives as the dysfunction and drama surrounding the organization, team sources told ESPN.com.Under team president Phil Jackson, the Knicks have struggled in Porzingis' two seasons in New York, losing a combined 101 games.Porzingis, according to team sources, is frustrated with the Knicks' lack of direction. The team missed out on the playoffs for the fourth straight season.", "link": "http://www.espn.com/nba/story/_/id/19160908/frustrated-kristaps-porzingis-skips-exit-meetings-new-york-knicks-management"}, {"title": "Jury: Hernandez not guilty in double murder", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 16:32:06 EST", "location": "United States", "price": 0, "image": "", "description": "BOSTON -- Ex-NFL star Aaron Hernandez, who is already serving a life sentence for a 2013 murder, was acquitted Friday in a 2012 double slaying prosecutors said was fueled by his anger over a spilled drink.The former tight end for the New England Patriots wept quietly as the verdicts were read in Boston. A few moments later, he looked back at his fiancée and nodded somberly as relatives of the victims sobbed loudly. A defense attorney hugged him.After six days of deliberations, the jury found Hernandez not guilty of first-degree murder in the killings of Daniel de Abreu and Safiro Furtado. It convicted him of a single charge: unlawful possession of a gun. The judge sentenced him to an additional four to five years in prison, separate from his existing life sentence.Aaron Hernandez, 27, is currently serving a life sentence for a 2013 murder. AP Photo/Stephan SavoiaSuffolk County District Attorney Daniel Conley said the victims' families were devastated by the verdicts as well as by the defense's portrayal of the men as \"gang bangers\" and \"drug dealers.\"\"These were two hardworking, humble, Cape Verdean immigrants,\" Conley said. \"It was unnecessary and it was wrong, and it shouldn't have been done.\"Conley said prosecutors and the families take solace in the fact that Hernandez is serving a life sentence in the 2013 killing of Odin Lloyd, a semi-professional football player who was dating the sister of Hernandez's fiancée. Prosecutors in the double-murder trial weren't allowed to mention his conviction in Lloyd's case.\"One of the victims' relatives said, 'At least he's not walking out the door today,'\" Conley said.But Jose Baez, one member of Hernandez's defense team, told ESPN's Ian O'Connor that he sees a path for the Lloyd conviction to be overturned.\"I wish he'd called me (for the first trial),\" said Baez, who was not in court Friday because of a back issue. \"I think there are plenty of flaws in that (Lloyd) conviction. If they are exposed properly, he certainly can and should get a new trial.\"The defense team in the double-murder case had pointed the finger at Alexander Bradley, an admitted drug dealer and a close friend of Hernandez who was with him the night of the shootings. The defense hammered at Bradley's credibility, citing his immunity deal with prosecutors to testify against Hernandez, his role as the driver of the car the night of the shootings and his criminal record. Bradley is serving a five-year prison term in Connecticut for firing shots at a Hartford nightclub in 2014.Bradley testified that Hernandez became enraged after de Abreu bumped into him while dancing, spilling his drink at a Boston nightclub. He said Hernandez later opened fire on the men's car as they waited at a stoplight.Prosecutors charged Hernandez with shooting Bradley in the face months after the double slaying to try to silence him as a witness. Bradley lost his right eye; Hernandez was acquitted of witness intimidation.Defense attorney Ronald Sullivan Jr. said the jury was able to see through the \"smoke and mirrors\" that made up the state's case. He described Hernandez as a \"very good young man who happened to hang out with a very bad guy in Alexander Bradley.\"Conley said Friday that prosecutors would not go after Bradley in the killings because they believe they already charged the right person.\"Our theory of the case stands,\" Conley said. \"In our minds, [the evidence] points inescapably to Aaron Hernandez.\"Jury forewoman Lindsey Stringer read a statement outside court, noting the more than 70 witnesses and over 380 exhibits presented in the case.\"We based our decision on the evidence presented and the law,\" Stringer said. She took no questions.Prosecutors introduced evidence at trial that Hernandez got a tattoo that memorialized the double slaying. California tattoo artist David Nelson testified that Hernandez requested an image of a revolver with the gun barrel facing forward. Hernandez wanted five bullets visible in the cylinder of the gun and one cylinder empty, Nelson said.Authorities said Hernandez fired five shots from a revolver into the car carrying de Abreu and Furtado.Hernandez, 27, grew up in Bristol, Connecticut, and played for the Patriots from 2010 to 2012. About six weeks after Furtado and de Abreu were killed, Hernandez signed a five-year, $40 million contract with the Patriots and went on to play another season before Lloyd was killed. He was cut from the team shortly after he was arrested in Lloyd's killing in June 2013. He was not charged in the 2012 killings until 2014.Baez, the attorney known for winning an acquittal for Florida mom Casey Anthony in the death of her daughter, told ESPN that \"(Hernandez) is one step closer to being reunited with his family. He still has the appeal (of the Lloyd conviction), and those appeals can be overturned.\"The Associated Press contributed to this report.\nSuffolk County District Attorney Daniel Conley said the victims' families were devastated by the verdicts as well as by the defense's portrayal of the men as \"gang bangers\" and \"drug dealers.\"", "link": "http://www.espn.com/nfl/story/_/id/19159319/jury-acquits-ex-new-england-patriots-tight-end-aaron-hernandez-double-murder-trial"}, {"title": "Jackson says Melo 'better off somewhere else'", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 15:10:58 EST", "location": "United States", "price": 0, "image": "", "description": "Phil Jackson talks about the exit meeting he and Carmelo Anthony shared and the new direction he hopes to take New York. (1:19)Phil Jackson indicated that the New York Knicks will continue to explore trade options for Carmelo Anthony, saying the All-Star forward \"would be better off somewhere else.\"Jackson, the Knicks team president, addressed reporters Friday, two days after the team completed its fourth straight losing season. New York went 31-51, falling well short of preseason expectations bolstered by the offseason additions of Derrick Rose and Joakim Noah.\"We've not been able to win with [Anthony] on the court at this time,\" Jackson said. \"I think the direction with our team is that he's a player that would be better off somewhere else and using his talent somewhere where he can win or chase that championship.\"", "link": "http://www.espn.com/nba/story/_/id/19159149/carmelo-anthony-better-somewhere-else-phil-jackson-says"}, {"title": "Celtics fully expect to face 'National TV Rondo'", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 21:04:35 EST", "location": "United States", "price": 0, "image": "", "description": "WALTHAM, Mass. -- There are only a handful of players remaining on the Boston Celtics' roster who played alongside Rajon Rondo and only one -- Avery Bradley -- who was there before the ACL tear that slowed Rondo after four consecutive All-Star appearances.And yet the legend of \"National TV Rondo\" has been passed on to a new generation of Celtics, including Isaiah Thomas, who emerged as the new face of the franchise in the aftermath of Rondo's being dealt to the Dallas Mavericks in December 2014. As the top-seeded Celtics prepare for their first-round matchup with the eighth-seeded Chicago Bulls, they are well aware of Rondo's propensity to elevate his play when the games matter most.Bulls guard Rajon Rondo is known for stepping up his game when it matters most, something not lost on his former Boston teammates. John E. Sokolowski/USA TODAY Sports\"I'm a fan of the game. I know, whether he tries it or not, those big games he's always gonna be ready for them,\" Thomas said Friday after the Celtics went through their first workout of the postseason. The Celtics host the Bulls in Game 1 on Sunday night at TD Garden.\"He's always gonna play his best [in big games],\" said Thomas. \"And that's just me watching him when I was younger and before I got in the NBA. You know, when it counts, he's gonna be ready and he's gonna perform. So we've got to slow him down and eliminate what he does best, and that's getting everyone involved.\"If there's one obvious advantage the Bulls possess in this first-round matchup, it's playoff experience. Rondo and teammate Dwyane Wade have combined to play in 260 postseason games and win four NBA championships. Yes, both are different players in the latter stages of their careers, but they know how to win on the big stage.This young Celtics core, helmed by Thomas, has been eliminated in the first round of the playoffs in each of the past two seasons.\"Rondo's a hell of a guard and then you've got Dwyane Wade and Jimmy Butler and you've just got to make it hard for them, make it tough for them,\" Thomas said. \"Don't let them see anything easy. It's not just gonna be an individual defensive matchup. As a team, as a collective group, we've got to let them see five guys every time down. I mean Dwyane Wade is a guy that's won championships, so he knows what to expect. We've got to be ready and I think we're ready for the opportunity.\"Said Celtics coach Brad Stevens: \"I've watched [Rondo and Wade] for way before I was in the NBA. I'm pretty sure we're going to get great shots from both of them.\"Thomas is also certain that Boston fans are going to shower Rondo with affection for what he meant to the 2008 championship team and Boston's playoff success in the years that followed, including deep postseason runs in 2010 and 2012.\"He won a championship here so they love the guy,\" said Thomas. \"It won't be no bad feelings. I've heard if you win a championship here they're gonna love you forever, so he's earned that and he's one of the best guards to ever play.\"Thomas hasn't proved himself as a winner in the postseason, but he's highly motivated to do so this year, especially after a regular season in which he put himself in the MVP conversation with his offensive wizardry.When asked about what to expect from Thomas in the postseason, he smiled and said, \"I'm ready for it.\"Bradley, easily the longest-tenured player on Boston's roster despite being only 26 years old, fondly recalled what Rondo meant to him as a younger player.\"Rondo's like my brother. On the court, off the court, we're brothers,\" said Bradley. \"It's weird playing against him, going up against him, but I think I said it last game: I know he's a true competitor and he's going to bring his best game in the playoffs. So it's going to be fun playing against him. Weird but fun.\"I grew as a player and as a man. He's helped me out in a lot of different ways. And I appreciate him. All his time here I feel like he was one of the best teammates that I've had. And he was a true competitor, one of the hardest-playing teammates I played with.\"His desire to win, I don't know that many people (like that). He's so competitive. It doesn't matter what we're playing. If we're playing tic-tac-toe he wants to win every single game. So I respect that about him.\"Bradley said it was hard to watch Rondo struggle to perform like the franchise player he was in Boston during combustible stints in Dallas and Sacramento. And, from afar, Bradley remained supportive of Boston's former captain.\"It was hard hearing all the negative things about him,\" said Bradley. \"But I just prayed for him. I wished him well. I would send him texts every now and then like, 'Bro, it doesn't matter.' We've all been there before. He's been the underdog before. He came into the NBA, people not thinking he could play. Everybody's been there. It's just their job to continue to work and prove people wrong. I feel like every year he's been trying to do that.\"\n\"I'm a fan of the game. I know, whether he tries it or not, those big games he's always gonna be ready for them,\" Thomas said Friday after the Celtics went through their first workout of the postseason. The Celtics host the Bulls in Game 1 on Sunday night at TD Garden.\"He's always gonna play his best [in big games],\" said Thomas. \"And that's just me watching him when I was younger and before I got in the NBA. You know, when it counts, he's gonna be ready and he's gonna perform. So we've got to slow him down and eliminate what he does best, and that's getting everyone involved.\"", "link": "http://www.espn.com/nba/story/_/id/19160505/boston-celtics-expect-chicago-bulls-rajon-rondo-elevate-game-playoffs"}, {"title": "Jackets have no answer for Pens stars", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 21:47:10 EST", "location": "United States", "price": 0, "image": "", "description": "Sidney Crosby records a goal and two assists in Pittsburgh's 4-1 victory over Columbus to take a 2-0 series lead. (1:05)PITTSBURGH -- Some coaches call them bump shifts. They are the shifts right after an opposing goal is scored that are so crucial to try to reclaim momentum. Give the team a bump.In crucial moments, nobody is better than Pittsburgh Penguins captain Sidney Crosby. You saw it on display in a big way during the Penguins' 4-1 win over the Columbus Blue Jackets in Game 2 on Friday, just 51 seconds after Columbus' Brandon Saad scored to pull the Blue Jackets even in the second period.Less than a minute later, Crosby was streaking down the ice on a 2-on-1 with Jake Guentzel feeding him at just the right time for a one-timer that beat Sergei Bobrovsky.", "link": "http://www.espn.com/nhl/story/_/id/19161081/nhl-2017-stanley-cup-no-answer-sidney-crosby"}, {"title": "Daniel Murphy delivers walk-off as ridiculous run continues for Nats", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 22:33:21 EST", "location": "United States", "price": 0, "image": "", "description": "Daniel Murphy's double chases Bryce Harper in from first base to help the Nationals walk off against the Phillies in their 3-2 win. (0:49)WASHINGTON -- To quote Ice Cube, it was a good day for Daniel Murphy. Again.The Washington Nationals slugger led his squad to a 3-2 victory over the Philadelphia Phillies on Friday with a 10th-inning, walk-off double down the left-field line that drove in a headfirst-sliding Bryce Harper all the way from first. It was Murphy’s second hit of the day, giving him seven multi-hit outings already, most in the majors. It also extended his hitting streak to an MLB-best 10 games. As if that weren’t enough, it was Daniel Murphy Bobblehead Day in D.C. For Washington’s cleanup hitter, big days like that are starting to become a case of wash, rinse, repeat.“That guy’s special,” said pitcher Shawn Kelley, who picked up the win and combined with fellow relievers Koda Glover and Blake Treinen to toss three scoreless innings of one-hit ball. “He might do better than he did last year, which is hard to believe.”", "link": "http://www.espn.com/blog/washington-nationals/post/_/id/2346/daniel-murphy-delivers-walk-off-as-ridiculous-run-continues-for-nationals"}, {"title": "Braves' new world is an experiment in baseball and business", "category": "news", "type": "sports", "channel": "ESPN", "time": "Sat, 15 Apr 2017 01:39:06 EST", "location": "United States", "price": 0, "image": "", "description": "Ender Inciarte christens SunTrust Park with a homer to right in a 5-2 win over the Padres. (0:21)ATLANTA -- The last time I saw so many people slow-walking on bridges over an Atlanta highway it was on “The Walking Dead.”They spilled in from everywhere Friday, on concrete bridges slung over highways they had successfully traversed to get to SunTrust Park. They crowded in a wide line, on concrete suspensions, above a morass of multilaned freeways. They found their way into the New Urbanist neighborhood. Then they crowded into the brand-new stadium for the first regular-season game. There were 41,149 of them, and they mostly appeared to settle into their seats in time for the pregame ceremonies.", "link": "http://www.espn.com/blog/sweetspot/post/_/id/78701/braves-new-world-is-an-experiment-in-baseball-and-business"}, {"title": "The night baseball stopped to retire No. 42 forever", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 07:59:08 EST", "location": "United States", "price": 0, "image": "", "description": "Bud Selig and MLB took the unprecedented step of retiring the No. 42 jersey on April 15, 1997 on the 50th anniversary of Jackie Robinson's first game in the majors. (2:29)Twenty years ago, a baseball game froze in time. And out onto the lush green grass of Shea Stadium, in the middle of the fifth inning, walked three people.One was Rachel Robinson, wife of the late, great Jackie Robinson. One was the commissioner of baseball, Bud Selig. The third? It was merely the president of the United States, William Jefferson Clinton.They were there to do something that had never been done before: retire a number, Jackie Robinson's 42, across an entire sport. And to do their part to ensure that the power of Robinson's major league debut, 50 years earlier to the day, would keep resonating through history.", "link": "http://www.espn.com/mlb/story/_/id/19141070/an-oral-history-night-baseball-retired-jackie-robinson-no-42"}, {"title": "Red Sox have the star power to keep Jackie Robinson's legacy alive", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 08:01:05 EST", "location": "United States", "price": 0, "image": "", "description": "Doug Glanville says Jackie Robinson reminds us that our past reflects how we embrace our greatest future. (1:11)The way Chris Young always told it, he decided in high school to focus on the sport he played best. It was as simple as that. Looking back now, though, the Boston Red Sox outfielder says another factor pulled him toward baseball while all his friends were busy with football and basketball.\"Griffey,\" Young says. \"He was who I looked up to. He was the guy I tried to emulate, even as a right-handed hitter. I had his cleats. I had his tennis shoes. To me, he was just super cool -- and he was a baseball player.\"In the 1990s, the desire to be like Ken Griffey Jr. -- a transcendent athlete with a youthful enthusiasm that came through in his backward-cap style and gigawatt smile -- was powerful enough to compel a black teenager from southwest Houston to attend a high school known for its powerhouse baseball program rather than go to the school nearest his neighborhood. That was the choice Young made when he enrolled at Bellaire High in 1997, and it served as a springboard to a professional baseball career that has lasted for 16 years, the past 12 in the big leagues.", "link": "http://www.espn.com/mlb/story/_/id/19141100/red-sox-star-power-keep-jackie-robinson-legacy-alive"}, {"title": "Baker Mayfield's new inspiration: Russell Westbrook", "category": "news", "type": "sports", "channel": "ESPN", "time": "Thu, 13 Apr 2017 17:04:26 EST", "location": "United States", "price": 0, "image": "", "description": "Jake Trotter joins SportsCenter to explain why Oklahoma's star QB has so much in common with Russell Westbrook. (1:29)NORMAN, Okla. -- Shortly after agreeing to an extension to remain with the Oklahoma City Thunder, Russell Westbrook showed up on the University of Oklahoma sidelines last fall sporting a No. 44 Sooners jersey, the number of former OU great Brian Bosworth.By coincidence, Sooners quarterback Baker Mayfield exited the locker room after the game donning an \"In Russ We Trust\" Thunder T-shirt.It was a fascinating juxtaposition.", "link": "http://www.espn.com/college-football/story/_/id/19152525/how-ou-qb-baker-mayfield-channeled-how-hopes-channel-russell-westbrook"}, {"title": "Takk's great escape: A pass-rusher's remarkable path to the NFL", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 7 Apr 2017 01:49:07 EST", "location": "United States", "price": 0, "image": "", "description": "UCLA outside linebacker Takkarist McKinley has a focused approach that Mel Kiper Jr. believes makes him one of the best outside pass rushers in the 2017 NFL draft. (0:32)This story appears in ESPN The Magazine's April 24 NFL Draft Issue. Subscribe today!THE CALLS KEEP coming in the middle of the night, the voice on the other end hushed, pleading. Peggy Wiggins, living in West Oakland, California, doesn't know what to do. From what she can gather, her younger sister Tedjulla and Tedjulla's three children are being held against their will in Mississippi. Really, the baby boy is the problem, Tedjulla eventually explains in one of the calls. The man who thinks he is the child's father won't let him go. Tedjulla and her two other kids are free to leave, but the baby stays.Peggy finally decides it's time to get them. She gathers her mother, Myrtle Collins, and her adult son, Sylvester, and they cobble together enough money to fly across the country. They rent a car and drive deep into the Mississippi backcountry with nothing to go on except Tedjulla's patchy, whispered directions. After a few hours, they close in on the isolated country house and wait until the man leaves.", "link": "http://www.espn.com/nfl/draft2017/story/_/id/19098661/ucla-pass-rusher-takk-mckinley-remarkable-path-nfl-2017-nfl-draft"}, {"title": "Biggest draft bust ever for all 32 NFL teams", "category": "news", "type": "sports", "channel": "ESPN", "time": "Thu, 13 Apr 2017 08:40:51 EST", "location": "United States", "price": 0, "image": "", "description": "Hindsight is 20-20, but NFL teams are still kicking themselves after making these selections. (0:53)What you see in the pre-draft process isn't always what you get. There's always a player who goes from potential star to post-draft bust, but who among each franchise's history is the biggest bust of them all?NFL Nation reporters have gone back as far as 1979 to find every team's draft dud.AFC East | AFC North| AFC South | AFC West\nNFC East | NFC North | NFC South | NFC West", "link": "http://www.espn.com/nfl/story/_/page/32for32x170413/biggest-nfl-draft-bust-evers-all-32-teams-all-flops-modern-era"}, {"title": "UFC Fight Night predictions: Demetrious Johnson vs. Wilson Reis", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 12:59:23 EST", "location": "United States", "price": 0, "image": "", "description": "UFC flyweight champion Demetrious Johnson will attempt to tie Anderson Silva's record of 10 consecutive title defenses Saturday when he meets Wilson Reis at UFC Fight Night in Kansas City, Missouri.It's a historic opportunity for Johnson. For Reis, it's a first crack at UFC gold and something he has eyed closely since last summer, when an initial meeting with Johnson fell through due to injury.Who will prevail in Saturday night's attractive lineup of fights inside Sprint Center? MMA analyst Brett Okamoto (@bokamotoESPN) makes his predictions for the top matchups.Odds: Johnson -840; Reis +660", "link": "http://www.espn.com/mma/story/_/id/19158176/ufc-fight-night-predictions-demetrious-johnson-versus-wilson-reis"}, {"title": "After missing NCAA title run, Coates' name called early in WNBA draft", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 01:02:54 EST", "location": "United States", "price": 0, "image": "", "description": "Alaina Coates may be injured but is excited to be a part of the Chicago Sky as she explains her process of being game ready. (1:42)NEW YORK -- Alaina Coates and her family made a long drive to the Big Apple for the WNBA draft, leaving their home in South Carolina late Wednesday night and arriving Thursday morning. But once the draft got started, Coates had a very short wait for her name to be called.She was the No. 2 pick by Chicago, somewhat of a surprise only because the Sky already have so much size, including their top selection last year, 6-foot-7 Imani Boyette, and 6-4 Stefanie Dolson, one of the players the Sky got in trading Elena Delle Donne.But in a draft that the league's observers found extremely difficult to project, it seemed Chicago went with the best available player, regardless of position.", "link": "http://www.espn.com/wnba/story/_/id/19154132/south-carolina-gamecocks-alaina-coates-hears-name-called-early-wnba-draft"}, {"title": "Five observations from the 2017 WNBA draft", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 02:52:12 EST", "location": "United States", "price": 0, "image": "", "description": "She may have been selected No. 1 overall, but Kelsey Plum is humble in discussing her skill sets and looks to her areas of improvement. (1:11)NEW YORK -- It was sort of odd that with the WNBA draft taking place at Samsung 837 in Manhattan, just a little over a mile from Madison Square Garden, the Liberty were not a draft story.New York didn't have a first-round pick, and neither did Indiana, Phoenix or Seattle. Instead, three teams -- San Antonio, Chicago and Dallas -- had seven of the 12 picks and set the tone for the draft. There were rumors right up until the draft started that there would be a trade or two, but as of the evening's end, none had happened.The shadow of next year's blockbuster draft loomed a little over this one; teams are wary of trading away a 2018 first-round pick because the field will be so good. That might have ultimately hindered trades, at least for now.", "link": "http://www.espn.com/wnba/story/_/id/19154003/five-observations-2017-wnba-draft"}, {"title": "A race to honor the girl 'everyone fell in love with'", "category": "news", "type": "sports", "channel": "ESPN", "time": "Thu, 13 Apr 2017 17:07:33 EST", "location": "United States", "price": 0, "image": "", "description": "Siblings Peter, Kate and Charlotte Cipolletti have never run a marathon before, but when they take the starting line for the Boston Marathon, it will be personal.Just over a year ago, they lost their sister, Emily, to hypoplastic left heart syndrome (HLHS), a congenital condition that affects normal blood flow through the heart due to underdevelopment.\"I thought that, for me, a way to honor Emmy, and pick up, move on and channel her, was to do something courageous and really difficult,\" said Charlotte, 23, who works in portfolio management for an asset management firm in New York.The siblings were raised in Boston as part of a family of 12, 10 siblings and their parents. They reminisced about living in a large family, and said they'd never have it any other way. For Peter, the third-oldest, the chaos is something he loved and on which he thrived. For Kate and Charlotte, growing up with eight other siblings meant having nine best friends for life. They wondered what it would be like to have only one sibling and not get along with them, or what dinner would be like without the noise.", "link": "http://www.espn.com/sports/endurance/story/_/id/19151731/boston-marathon-2017-cipolletti-siblings-take-starting-line-honor-their-sister-emily"}, {"title": "Runner Jordan Hasay's stride into 26.1 miles", "category": "news", "type": "sports", "channel": "ESPN", "time": "Thu, 13 Apr 2017 17:07:25 EST", "location": "United States", "price": 0, "image": "", "description": "Running always has come easy for Jordan Hasay. While other kids thought of it as punishment, it was her joy. Her daily highlight in fifth grade was running laps to start PE class. \"I would be literally sitting on the edge of my seat in class,\" she says, \"just waiting for the bell to ring so I could be the first person out the door. I had to win that little two-lapper.\" Even then, she loved the freedom and challenge of running. \"I loved pushing myself,\" she recalls.Hasay became a high school phenom in San Luis Obispo, California, and a star at the University of Oregon, where she was a 15-time All-American and two-time NCAA indoor champion in the mile and 3,000 meters. Though she's only 25, she's been in the national running spotlight for a dozen years.Since graduating from college, Hasay -- known for her hard-charging style and long, blond braid -- has been coached by Alberto Salazar as part of the Nike Oregon Project, with her focus on the 5,000 and 10,000 meters.However, Hasay has changed course since the 2016 Olympic trials, where she was a disappointing ninth in the 10K and 13th in the 5K after recovering from plantar fasciitis in 2015. She's taken to the roads and stretched her distance. In October she won the USATF 10 Mile Championship. In her half-marathon debut in Houston in January, she finished fourth, running 1 hour, 8 minutes, 40 seconds, the sixth-fastest time ever for an American woman. She topped that April 1 with a 1:07.55 at the Prague Half Marathon, the third-best time ever for an American, while finishing sixth. She also won the USATF 15K championship in March with a fierce finishing kick.", "link": "http://www.espn.com/sports/endurance/story/_/id/19092276/boston-marathon-2017-runner-jordan-hasay-stride-261-miles"}, {"title": "The UFC new star and a forgotten NBA pioneer", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 07:17:14 EST", "location": "United States", "price": 0, "image": "", "description": "sports + biz + culture + life\nGet REDEF delivered to your inboxrantnrave:// Mike Oz's opening 25-year-old baseball cards series is consistently entertaining. In each episode, he opens a pack of baseball cards with someone in baseball and has a few minutes of fun and a walk down memory lane. In this episode, Reds pitcher Bronson Arroyo calls out a former teammate for his, umm, adult entertainment preferences. It's a peek into the sport's personalities talking about a piece of their childhood or about their peers. ... The NHL playoffs will provide great theater for the next two months. How will the league's young stars adjust to the postseason? Can Sidney Crosby take the Penguins back to back? Or will this be Connor McDavid's time? Will a Canadian team win the Stanley Cup for the first time since 1993? ... Don Van Natta and Seth Wickersham produced a spectacular story on how the Raiders left Oakland and put together their move to Las Vegas. It's a tale of competing interests, billionaire battles and a wily underdog. Too bad it has to end with a fan base left behind. ...  Can science help runners run a sub-two-hour marathon? ... SportsREDEF is taking a long weekend so there will be no newsletter Monday. But don't worry, it'll be back in your inbox Tuesday morning. Use the free time to go for a run.Yair Rodriguez looks ready to take over the UFC. Is a fight with Conor McGregor on the horizon?\nMatt Foley | OZYSports leagues that target the public with DMCA takedowns are engaging in a self-defeating practice -- and trampling on our fair use rights.\nAndrew Jerell Jones | The Guardian", "link": "http://www.espn.com/redef/story/_/id/19155900/the-ufc-new-star-forgotten-nba-pioneer-cycling-obsession"}, {"title": "El Top 10: Lo mejor (y lo peor) de la temporada", "category": "news", "type": "sports", "channel": "ESPN", "time": "Fri, 14 Apr 2017 01:22:00 EST", "location": "United States", "price": 0, "image": "", "description": "Has llegado a la edición de ESPN Deportes. Quedarse en el sitio actual o ir a edición preferida.La de 2016-17 fue la campaña de los triple-dobles, en el que esa rara combinación de números se transformó en una costumbre. (0:47)El Top 10 de la Semana de la NBA ha sido el \"espacio seguro\" de todo aficionado a la mejor liga de básquetbol del planeta esta temporada. Hemos reído, soñado, ¿llorado? y disfrutado de una de las mejores temporadas regulares de la historia.Vimos a Russell Westbrook promediar un triple-doble en la temporada y sobrepasar el récord de una leyenda como Oscar Robertson con 42 de ellos para dejarnos a todos boquiabiertos.", "link": "http://espndeportes.espn.com/basquetbol/nota/_/id/3083286/top-10-de-la-semana-de-la-nba-recuento-de-una-temporada-fascinante"}]}