[
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d4355521-Reviews-Jacob_Ballas_Children_s_Garden-Singapore.html",
    "location": "Address: 1 Cluny Road National Parks Board, Singapore 259569, Singapore ",
    "description": "\nWent with a group of 7 children ranging from 2 to 7 yr old. It was suitable for them as there were many age appropriate activities, such as suspension bridge, water play, sand...\nread more \nWent with a group of 7 children ranging from 2 to 7 yr old. It was suitable for them as there were many age appropriate activities, such as suspension bridge, water play, sand pits and slides. The children enjoyed themselves thoroughly. There is also a washroom in the middle of the park.\nEntrance is free! However, it is about a...\n\n\nMoreÂ  \n\n\n\nI brought my 5 year old to this garden and he is very happy! Cos there are a lot of things to play and little adventure such as walking on a log across the stream and the tree house! Will bring him there any time!\n\nWe spent about 2.5 hours with our two preschoolers. They really enjoyed exploring the space, finding little hidden paths and spots to activate their imagination. And what better way than to end with a cool splash in the waterplay area!\n\nJacob Ballas Gardens is part of the Singapore Botanical Gardens but is separate and made specifically for children. It has a great 'tree' slide and plenty of educational hands on attractions for little ones. The Gardens include a playground, mini waterfall and a seed planting areas where kids can see where rice, chilies and other common foods come from first...\n\n\nMoreÂ  \n\n\n\nWe went to botanical garden on our last day in Singapore and spent most of our time in the Jacob Ballas Children's garden. If you are going by taxi, there is a car park/ taxi drop right outside the garden. However, if you are going by MRT; there is a decent amount of walk. A part of the garden is...\n\n\nMoreÂ  \n\n\n\nWe have been there several times . A nice place to take our 4 year old. Several different things to do including a small little water play area where the kids can run about and get wet. We usually take a back pack along with food and drink. You have to go out of the park to eat your own...\n\n\nMoreÂ  \n\n\n\nThe approach to this part of the botanical gardens is now very close from the metro exit. There is still a fair amount to walk though. We went on a day when there was close to no one there and it was a pretty rainy day. Armed with an umbrella and a raincoat, we loved the logs, the bridge and...\n\n\nMoreÂ  \n\n\n\nJacob Ballas Children's Garden is an attraction which is free of charge and great fun for kids. They should be able to walk, at least, in order to fully enjoy the garden. Main attractions are the water playground and sandy playground. There is a parking lot right in front of the entrance. No nappy changing station at the bathrooms at...\n\n\nMoreÂ  \n\n\n\nIt's a fantastic garden with lot of activities for kids. A separate water section for kids, sand pit, a hanging bridge and big slides.\nIt's also have an amphitheater for conducting private parties such as birthdays.\nIt's a lovely garden for kids.\n\nMy 3yo girl and her buddy enjoy the garden so much. There are water playground, sandpit, tree for climbing, tube slides, mazes, a big hollow tree and even cloud, rain machine for kids. Our kids also enjoyed walking back and fort the hanging bridge. A great place for those who wants to connect their kids with nature.\n",
    "type": "attractions",
    "title": "\n\nJacob Ballas Children's Garden\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/07/7b/23/f8/children-s-heaven.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d3459679-Reviews-Changi_Beach-Singapore.html",
    "location": "Address: Near Changi Village, Singapore, Singapore ",
    "description": "\nIts a nice place to visit towards the east end of Singapore. You can smell sea water, if the breeze blows. Most of the time its hot and humid, but at evenings you can expect some...\nread more \nBack here today for the third time this year as part of the standard East Coast cycling route out to Changi Village. Not as busy as East Coast Park and therefore much better for cycling. Didn't go swimming this time, and to be honest the water really wasn't looking so clean. Remains a good option for cycling though.\n\nI was shocked. In Uber Tidy S'pore this beach stands out for the amount of trash of all kinds. I hope they get it cleaned up. It could be a pleasant little beach, nice for families. It has nice a view of the Strait.\n\nIts a nice place to visit towards the east end of Singapore. You can smell sea water, if the breeze blows. Most of the time its hot and humid, but at evenings you can expect some light breeze. Do not expect waves. Very less to no waves.\nWater is not really clean and you can often find dead fishes and...\n\n\nMoreÂ  \n\n\n\nHaving visited both the beach sides now, This is how I see the uniqueness of each!\n- Changi beach has a beach side restaurant that makes a good difference\n- Pasir Ris has a lot of barbecue points which I couldn't see much in Changi\nThe sandy surface in Changi is not very wide\n- Lot of benches facing the...\n\n\nMoreÂ  \n\n\n\nSo many food stalls (Malay, Chinese, Indian cuisine) at Hawker price\n.\nBest satays, best nasi lemak, best of the bests can be found here.\nRental of bikes, Water Venture (canoeing), Bird watching.\nToilet facilities - please please please use the ones nearer the beach. Skip the toilet near the bus interchange (have to pay for usage and pay for...\n\n\nMoreÂ  \n\n\n\nChangi Beach is a fun place to hang out with friends and family during holidays. Changi Beach is a clean park with many Bbq pits to enjoy. There is a nice view of ships and planes as it is close to the airport. Bring along some friends, some snacks and your swimwear and have a wonderful day there.. This place...\n\n\nMoreÂ  \n\n\n\nThis is one of the beached in Singapore. There are no tides which doesn't excite you. When we visited there was no breeze and my wife started feeling suffocating. So we left in few minutes. Its a good place for kids to enjoy as it is very safe with low tides.\n\nThis is just opposite to the Hotel Changi Village. Just relax and enjoy the beauty of nature. Have a walk and enjoy a relaxing day by sitting by the beach.\n\nTook a lovely stroll to Changi Beach just before dawn today and saw many joggers, dog walkers and a few families of Pokemon hunters. There were also many campers, some preparing breakfast and others playing on the sandy beach. Feels great to begin a Sunday morning early like this. We are next off to nearby Changi Village for a nice...\n\n\nMoreÂ  \n\n\n\nVisited during an afternoon and found it to be a very nice and relaxing place for a walk. Very nice views and a good place for those that like planespotting.\n",
    "type": "attractions",
    "title": "\n\nChangi Beach\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/bc/fd/dc/changi-beach.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d2344355-Reviews-Hort_Park-Singapore.html",
    "location": "Address: 33 Hyderabad Road, Singapore 119578, Singapore ",
    "description": "\nI enjoyed Hort Park. It has a range of themed gardens, a small aquaponics system and a community growing space too. When we stopped to look at the aquaponics one of the staff who...\nread more \nI enjoyed Hort Park. It has a range of themed gardens, a small aquaponics system and a community growing space too. When we stopped to look at the aquaponics one of the staff who was passing stopped to explain how it worked to the kids and to shoe them the fish which they loved. There are a couple of places...\n\n\nMoreÂ  \n\n\n\ni thought ah i go there ah can have alot of fun one leh but no lehh very lame place to visit. wah no good ah\n\nIt is a nice place to hang out if you are a garden enthusiast. Otherwise, the day can get really hot. You can just take a walk around the park to see all the spices, vegetables and orchids being planted before moving on to the Alexandra Arches & Henderson wave if you are on the southern ridge trail for a...\n\n\nMoreÂ  \n\n\n\nThe Hort Park is a small park that connects from Mount Faber Park, Southern Ridges, The Singing Forest, Anderson Arch and finally the Hort Park.\nThe park has multiple exhibits and activities for those with green fingers!\nAlso, it's a nice and safe place for parents to bring their kids to play at the various play areas and for couples...\n\n\nMoreÂ  \n\n\n\nItÂ´s an absolutly peacefull environment. When you walk thru the HortPark to next one - Kent Ridge Park, maybe you can see monkees and birds and have a nice view to the city. There are some brifges between the trees. So, you here the jungle voices and you donÂ´t believe, that you are still in Singapore!!\n\nReally nice jogging track in the lush green environment. There are variety of flowers and plants that you can learn about. Interestingly there is barcode reader using which you can learn more about the variety of plant and its technical name. It connects to hyderabad road on the other side of it and also to Kent ridge further down the...\n\n\nMoreÂ  \n\n\n\nTook my kids here for the playground and thought the gardens and facilities were really beautiful.\nMany different themes to the gardens, from English to Balinese but all very lovely.\nThe playground was good, better suited to the 3-8 year olds.\nButterflies and flowers everywhere.\n\nWas nice in the rain but a lot better in the dry. Lots of neat gardening ideas to look at and some gorgeous plants, including orchids.\nVegetable areas and indoor gardening ideas can be found in this lovely free garden. Perfect picnic area or start to a walk from here to Mt Faber.\n\nGreat area to wander and enjoy the tranquility of the gardens that also leads on to the Forest Walk.\n\nI didn't know this place existed until reading the local paper one day. It's now become one of my favourite gardens of all time around the world! Filled with plants, sculptures, water features, inspiration boards, community garden plots and plenty of shady spots to contemplate the view or soak up the serenity. You'd never know you were in the middle...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nHort Park\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/77/71/b4/hortpark.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d2344142-Reviews-Labrador_Nature_Reserve-Singapore.html",
    "location": "Address: Along Labrador Villa Road off Pasir Panjang Road, Singapore 119187, Singapore ",
    "description": "\nTravel to Labrador MRT station on the Circle Line. At Labrador station. Turn Right out of the station and and follow the path to the right. The walk takes about 35-45 minutes...\nread more \nNice boardwalk but really not that much to see and not much shade. Mostly a big open field on the water.\n\nTravel to Labrador MRT station on the Circle Line. At Labrador station. Turn Right out of the station and and follow the path to the right. The walk takes about 35-45 minutes along the river and past the Yacht Marina. When you reach the end of the path, (In the future the path will continue to Harbour Front Cruise Centre)...\n\n\nMoreÂ  \n\n\n\nFor those who love to walk, this is one beautiful park they can enjoy in the south.\nYou can start the walk from the hill and then wind down to the park below alongside the shore. The jetty on the right side has been developed and opened recently so anglers now have more choice.\nIf you walk to the left...\n\n\nMoreÂ  \n\n\n\nThis park is not well known to tourists or even locals unless you live or work around this area. Nearest MRT is Labrador but the park itself is quite a long walk from the station (it's about 8 mins drive, estimate 30 mins walk). The scenery is boring while walking there but when you reached the park, you will be...\n\n\nMoreÂ  \n\n\n\nIt was an artillery garrison during World War II built by the British Army against Japanese invasion but it turned out to be an ineffective defense. As the big guns were installed on hills, the entire installation has been converted into a nature park. The view is nice when visitors look out to the sea. With breezes ruffling the leaves,...\n\n\nMoreÂ  \n\n\n\nSingapore does not stop to amaze you . Great view of the sea and nice breeze and sunset . Easily accessible by MRT .\n\nIf you don't mind the long boring walk from the MRT station you will find a nice forest and seaside walk at the end. The place is a bit underdeveloped lacking some food stalls, cold drink and ice cream vendors at the sea side as well as an electric cart service zipping visitors between the MRT station and the sea...\n\n\nMoreÂ  \n\n\n\nIf you're a solo traveller looking for a nice walk, go to Labrador Nature Reserve. From Labrador Park MRT, take Exit A, turn left, walk a bit and turn right, and just follow the sidewalk. There will be some signs that help you reach the nature reserve. You will be greeted by loud beetles' voice, the shadows of trees... Walk...\n\n\nMoreÂ  \n\n\n\nLots of walking and hiking, though not so large area. There were some history notes along the forest track, explaining the way Singapore was in the war era, on how they arranged the defending cannons along the coast. Just before the beach, better turn right to the brick wall way, so you could go from forest area, down on the...\n\n\nMoreÂ  \n\n\n\nOne can take a nature walk up the hill or broad walk along the shore, for us we opted for the broad walk as we want to enjoy the sea breeze and the sunset view.\nThis is a favorite place to go for family, couples and friends to hang out in the weekend.\nIt was kind of crowded when we...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nLabrador Nature Reserve\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/0e/06/3d/b0/photo4jpg.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d2149128-Reviews-Gardens_by_the_Bay-Singapore.html",
    "location": "Address: 18 Marina Gardens Drive, Singapore 018953, Singapore ",
    "description": "\nVery beautiful and well done. In the major humidity it's a nice place to cool down. Also, a very spectacular and picturesque location. We used their shuttle and it's well worth it...\nread more \nVery beautiful and well done. In the major humidity it's a nice place to cool down. Also, a very spectacular and picturesque location. We used their shuttle and it's well worth it in the heat.\n\nWe visited the Gardens as part of our pre-cruise land tour. We had a couple of hours there and visited the conservatories which were excellent. We were able to return 2 days later and went around the outside themed gardens, which were really good. To go around the outside, you do not need to pay. You pay to go into...\n\n\nMoreÂ  \n\n\n\nGardens By The Bay is an iconic landmark and must visit if you are in Singapore. I have never seen anything like it before. The Flower dome is filled with just that--with rotating displays throughout the year that never fail to impress. The Cloud Forest is also a wonder--like stepping into a real one. In addition to the domes, there...\n\n\nMoreÂ  \n\n\n\nAnother attraction accessed using the Singapore Pass, we stayed until after sunset to watch the trees light up. Thoroughly enjoyed the two greenhouses, we're both different in presentation but well worth the visit.\n\nClose to Marina Bay Sands, this is a nice place for a walk. There are some interesting shops and atractions as well.\n\nSpent hours In here definitely food value for money display from around th world amazing. Would Def recommend\n\nWe had originally planned our last stopover day to go to Sentosa Island but our son how lovely this place was so we went there instead. So pleased we did , it is enchanting and so much to see. One tip though even though it is red hot outside in Singapore , it is very cool in here so make...\n\n\nMoreÂ  \n\n\n\nSimply love the environments! Good to bring the whole family and walk around for holidays. Nice view!\n\nGardens by the Bay is just a beautiful pearl in the citycentre of Singapore. It's large with lots of things to do. I would recommend to stay till sunset as at 7:45pm they have a spectaculair music and light show at the trees. Very impressive.\n\na must see if u visit this great city !\nespecially the night tour is amazing and u can catch some nice pictures for home.\n",
    "type": "attractions",
    "title": "\n\nGardens by the Bay\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/0d/db/2c/1b/gardens-in-the-city-singapore.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d2587912-Reviews-West_Coast_Park-Singapore.html",
    "location": "Address: West Coast Highway, Singapore 117867, Singapore ",
    "description": "\nOur regular park is one of the best in Singapore... We used to train for half marathons.. it has a good 4 km running track and a nice 0.5 km walking tracking adjoining the coast...\nread more \nOur regular park is one of the best in Singapore... We used to train for half marathons.. it has a good 4 km running track and a nice 0.5 km walking tracking adjoining the coast ...\n\nThe west coast park is very ideal for picnics, gatherings and a time of bonding through games and activities that you can arrange while you are there.\nThere is a jogging and cycling path as well as for those who wants to learn roller blading or learn to ride a bicycle.\nYou can also use the AXS machines to get...\n\n\nMoreÂ  \n\n\n\nThis is similar to east coast park, a beach park. There is a huge playground where my children enjoyed every time when we were there. There's however only one eatery at this park, which is macdonalds. Parking spaces can be found throughout the park and there is a dog run right at the end of the park.\n\nWCP is known to have very breezy space with the sea just infront of you. Nearby, the yacht club. A huge space good for kite flying and playing with your drones. Share the space with sporting visitors too though. Macdonalds is nearby. BBQ pits are available in the inner side of the park with toilets nearby. What a pity its...\n\n\nMoreÂ  \n\n\n\nVisited West Coast Park today. (Last visit was 2004)\nThe evening stroll saw so many changes. More condos reached up to the sky. Many more families, friends gathered to picnic and make merries in the park. Some families strolled with their dogs except one who brought their parrots. Some kids playing with sparkling fireworks. Many sat by the seaside watching...\n\n\nMoreÂ  \n\n\n\nI love West Coast Park. It is lovely and calm, peaceful and just nice to have a daily walk. You can do lots of activities here, although not as much as East Coast Park. There is also an area than you can see boats which is cool. You can bike or scoot here. It is suitable for all ages.\n\nAmazing park, in Singapore! Amazing for Children! Lovely fresh air, whilst your kids run around in the big playground!\n\nWe love to walk or cycle the perimeter of this park, it's about 5km. If you plan to cycle its best to go off peak as it's gets busy or just take it slow along the busy area. There is a fantastic dog run, really big and it has a drinker for the dogs too. There are two playgrounds, both...\n\n\nMoreÂ  \n\n\n\nBesides Labrador, the other park near the sea on the west side of Spore. Not ideal for Swimming, no real beach but you get to be close to the sea. The park has winding pathways Abd a few children playground and a huge field - good for group games and kite flying. Can be windy even in the afternoon. Accessible...\n\n\nMoreÂ  \n\n\n\nTook the kids here today for some play in the playground facilities. There are a few climbing stations, some flying foxes and a few other things of interest. Not too busy on a Sunday morning. If you're into walking there are a few paths to follow through the park.\n",
    "type": "attractions",
    "title": "\n\nWest Coast Park\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/b9/eb/e0/west-coast-park.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d591382-Reviews-Pasir_Ris_Town_Park-Singapore.html",
    "location": "Address: Pasir Ris Road, Singapore, Singapore ",
    "description": "\nBack again after a long hiatus. This time, focusing on the eastern corner of PRP, where there is a lovely (circular) boardwalk that encompasses the mangrove tidal flats. It's...\nread more \nBack again after a long hiatus. This time, focusing on the eastern corner of PRP, where there is a lovely (circular) boardwalk that encompasses the mangrove tidal flats. It's relatively shady even at 10 am in the morning. There is a bird-watching tower along the boardwalk, for those that need more exercise. It's a relatively quiet part of the park,...\n\n\nMoreÂ  \n\n\n\nIt's a must visit place for nature lovers and those people who love to walk. The path ways cleverly mapped between the mangroves into the forest and river side. It's also a good place for bird watching, you will generally see people with cameras hoping a capture the perfect picture of a rare bird\n\nTook the kids here today for the first time. Much less busy than East Coast, so for young kids it's quite good (don't have to stress about them on the cycle paths quite so much). Quite well maintained with a playground towards one end. A small strip of beach, although not much sand.\n\nLocated near Pasir Ris MRT (around 5 mins walk), the place is very beautiful, has a great water area, play area for kids and nice surroundings for a family get together. Kids can enjoy playing across vast tracts of greenery and small hills, people can fish around the pond ( you have some fees for this) or just enjoy the...\n\n\nMoreÂ  \n\n\n\nWas very beautiful place to visit and explore! But bring mosquito spray. Bugs can be annoying. There is a maze but took me awhile to get out.\n\nI loved this park more than the East coast, though its less popular n quieter compared to the latter. The connectivity is better as this one is just walking distance from the pasir ris mrt station and the bus interchange. I would recommend renting a bicycle to explore the park as it's quite large. One can rent a bike either...\n\n\nMoreÂ  \n\n\n\n5 mins walk from Pasir Ris MRT. Much better than over crowded East Coast Park. That is a mangrove here, and you can see some wild animals here frequently. I have seen otters rolling & playing on the grass, wild chickens, hornbills stopping by the trees while I am doing Yoga, & of course the little Egret residing on the...\n\n\nMoreÂ  \n\n\n\n1. I went to Singapore for official work. After finishing my work at 5 pm, I decided to visit Pasir Ris Town Park for one hour on 24th Aug 2016.\n2. I took a MRT to Pasir Ris station and walked about 10 minutes to reach the park. I reached the park around 6 pm and the sun sets around...\n\n\nMoreÂ  \n\n\n\nGood place to calm down, bike around, have a BBQ or camp overnight. Park could be a little bigger in my point of view. George by the bay is a nice spot to go and have a drink/eat when you're there.\n\nPasir Ris Park is a great place for families to have a fun day out. Aside from modern park activities such as pony rides, water sports, cycling, inline skating and barbeque rental, it also features a carefully preserved six-hectare mangrove forest.\nWith a Mangrove Boardwalk, you can explore the beauty of the mangrove forest and get close to its inhabitants....\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nPasir Ris Town Park\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/08/e4/2d/singapore.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d315472-Reviews-Bukit_Timah_Nature_Reserve-Singapore.html",
    "location": "Address: 177 Hindhede Drive Bukit Timah Vhf Station, Singapore 589333, Singapore ",
    "description": "\nWe started from the Railway Track at King Albert Park as an alternative entrance. Nice photo spots along this 30min stroll to the visitor centre. At the Reserve, we chose the...\nread more \nEscape modernity, get your hike on and come to this place! Was tricky to find, locals within 200m of the place didn't know where it was but take MRT to Beauty World (haha) then walk towards the jungle covered hills with telecommunication poles onot top. Come equipped with plenty of water and a camera. Within joy of trekking in virgin...\n\n\nMoreÂ  \n\n\n\nBUKIT TIMAH NATURE RESERVE.\nIn the heart (center) of the island of Singspore and in the catchment area lies the Bukit Timah Nature Reserve.\nI have been waiting for the Nature Reserve to reopen for more than a year's closure for intensive repairs. The Park & Trees Board finally declare the opening two months ago. But I still find an...\n\n\nMoreÂ  \n\n\n\nWanna find nature in a small place like Singapore, this is where you should visit!!! (It's Free!!!) It has been a long time since I last visit this place...& I always forgot the steep slope in the beginning of the path that makes me breathless!!! But it is a nice experience & a great exercise!!! I was a bit lost...\n\n\nMoreÂ  \n\n\n\nWe started from the Railway Track at King Albert Park as an alternative entrance. Nice photo spots along this 30min stroll to the visitor centre. At the Reserve, we chose the moderate path (South View Path-Cave Path). Full of steps! but the newly revamped steps make the climb nicer. We then ended off our hike at the Hindhede Quarry. A...\n\n\nMoreÂ  \n\n\n\nAt 163.63m, this is Singapore's tallest \"mountain\". I last visited it 34 years ago. Went there twice in the last 3 weeks.\nIf you are parking at the public carpark at the Visitor centre below on weekends, you need to be there by 7 am or the carpark will be full. Then you have to park your car along one...\n\n\nMoreÂ  \n\n\n\nTo the summit is a quick hike but a challenging one.\nWe took the loops to the diary farm which was about 10km. It was well signed and well maintained.\n\nWe hiked around the nature reserve. It was nice, I expected to see some more sights of the city but the trail recommended to us was closed. It was still a nice hike through the jungle and we seen a few monkeys.\n\nI started trekking from Bangkit using the Zhenghua Nature Park Trail. It leads to Pipeline Trail. Do look out for the obscure sign to turn into Catchment Trail.\nIt was an easy trek on Pipeline Trail but it started getting difficult once I was on the Catchment Trail and Cave Path. Steps can be as high as your knee. Catchment...\n\n\nMoreÂ  \n\n\n\na good physical workout, to walk to the top of the hill, difficult to spot the bird life that I went to see, but did managed to see the long tailed drongo !\n\nAs Singaporeâ€™s highest hill, Bukit Timah Hill, which stands at 163 meters tall, it sits in a 163 hectares of primary rainforest in the country. This nature reserve, established in 1883, has been a botanical collection ground for more than a century, and the first known specimens of many species of Malayan plants have been obtained here.\nBukit Timah Nature...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nBukit Timah Nature Reserve\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/1b/97/59/a-reservoir-on-one-of.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d315468-Reviews-Sungei_Buloh_Wetland_Reserve-Singapore.html",
    "location": "Address: 301 Neo Tiew Crescent Sungei Buloh Wetland Reserve, Singapore 718925, Singapore ",
    "description": "\nIt's really nice and educational. You get to see mangroves and mudskippers. It can be really relaxing if you love the nature but there are many mosquitoes so do bring along insect...\nread more \nIt's really nice and educational. You get to see mangroves and mudskippers. It can be really relaxing if you love the nature but there are many mosquitoes so do bring along insect repellent!\n\na bit out of the beaten path so best to get MRT to Kranji and then a bus or taxi to reserve. Once here you will find an amazing nature reserve.\n\nWent there for the first time with friends. It's at the North Western tip of Singapore, so it was quite a drive there (by Singapore standards). The only high rise buildings you see are those from Malaysia across the sea.\nThis is a natural wetland reserve. Do not expect to see lots of creatures like in a zoo. You need...\n\n\nMoreÂ  \n\n\n\nSituated at the north western corner of Singapore. This is an eco attraction that nature lovers must visit. Do apply plenty of mosquito repellent. Watch out for tree climbing crabs, mudskippers, monitor lizards, otters, migratory birds and crocodiles. They are in their nature habitat so be ready to back off track if they encounter a suntanning croc.\nNot safe to...\n\n\nMoreÂ  \n\n\n\nLike all attractions in Singapore, this is well thought out and maintained. A little off the beaten tourist track, we met only a handful of other visitors as we walked the trails. Monitor Lizards, exotic birds, turtles and a few crocodiles were spotted amongst the landscape with views across the water to Malaysia. A nice as to spend a few...\n\n\nMoreÂ  \n\n\n\nHad a couple of hours spare before my flight so visited this reserve by taxi.\nVery well maintained with good signed trails through the reserve.\nLots of local fauna to see including salt water crocodiles so best not to leave the paths!\n\nI arrived just before dawn on Sunday. Well before other visitors showed up. I had the entire place to myself for 2 hours or so and listened to it \"wake up\". There is something for everyone here. Trails specifically for children, interactive exhibits and lots and lots of nature. On my morning hike I saw crocodiles, egrets, herons, monitor lizards,...\n\n\nMoreÂ  \n\n\n\nCongrats to NParks and the nature supporting public who created a first-rate wetlands preserve at the edge of modern, bustling Singapore. You won't believe you are indeed in Singapore, watching hornbills, migratory and resident birds (shorebirds, songbirds), water monitors, giant mudskippers, and mangroves all around you. Plus beautiful park architecture, esp. dark wood wildlife viewing blinds and towers. Support the...\n\n\nMoreÂ  \n\n\n\nGreat day out, you see Snakes, spiders, King Fishers, Salt Water Crocodiles!!! And of course Monkeys ðŸ’\nIt's a good idea to take food and drinks with you, and spend time in the big Hide, binoculars are very advantageous. Be careful of marauding Monkeys ðŸ’ who will steal your glasses, cameras, phones, etc. Don't leave anything unattended, and keep a...\n\n\nMoreÂ  \n\n\n\nWe enjoyed a really interesting Mangrove walk here on 18th February. We read about the various walks offered - 9.30 start on Saturdays - in the excellent New Straits Times. You register online and then get details emailed to you. It is all so easy and efficient and we could not believe the walk was free! Our volunteer guide was...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nSungei Buloh Wetland Reserve\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/5d/5d/98/sungei-buloh-wetlands.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d1823698-Reviews-Marina_Barrage-Singapore.html",
    "location": "Address: 8 Marina Gardens Drive Marina Barrage, Singapore 018951, Singapore ",
    "description": "\nThis is a remarkable building, with the barrage dividing the sea from the river and the gently sloping grassy walkway atop the building itself. The views towards Marina Bay Sands...\nread more \nbeen here multiple times, chilling, having a picnic, kite flying, and even walking the dog. a great place to be with accessible toilets and cafes nearby.\n\nIf you want to get a view like a refrigerator door magnetic souvenir Singapore you shoul go here. From the rooftop you can look the best Singapore skyline with all famous Singapore icon completely there. Use bus number 400 to get directly to there.\nDont forget to give ur thumb if my review is helful for you. Thank you\n\nThis is a remarkable building, with the barrage dividing the sea from the river and the gently sloping grassy walkway atop the building itself. The views towards Marina Bay Sands and the city centre are incredible and there is also a good look out to sea and the countless cargo ships waiting to come and go from the port (I...\n\n\nMoreÂ  \n\n\n\nSo one day we got a really interesting and numerous taxi driver to take us to Gardens by the Bay. En route he showed us the Marina Barrage and explained how by building the structure the Singapore authorities have created a huge fresh water reservoir. This is in order no to be reliant on Malaysia for their water supplies.\n\nGreat place for kite flying with strong breezes. Have a nice picnic under the stars on the rooftop garden of the barrage with the views of the ocean as well as a backdrop.\n\nGreat place for kite flying, photoshoot & picnic. Done my wedding shoot here on Sept 2016 because of the awesome view. Been here quite a few times. There's also restaurant and you can also learn about NeWater here too!\n\nThis is a great spot for a relaxation view especially for sunset view. A great place to simply take a stroll, flying a kite, or just for the view. It is also a short walk to Garden By the Bay as well as the Cloud Dome and the Flower Dome. Along the way, there is a water park which is...\n\n\nMoreÂ  \n\n\n\nIf you can choose a clear sunny day (normally the mornings are best as it rains in the afternoons) you can get a marvellous view across Singapore with a view across the Business and Financial district. allow a couple of hours and you will find your visit worthwhile\n\nIt's great to come here on a sunny day. The view is amazing! This was the highlight of a whole day in the bay area for me\n\nMarina Barrage is probably one of the best place to see the city skyline and one which is not often featured in tourist guides.\nAbsolutely love this place especially on weekdays evening when it's not too crowded. Bring a mat, drinks & a book to chill or a camera to capture beautiful sunset or the city skyline.\n",
    "type": "attractions",
    "title": "\n\nMarina Barrage\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/73/6b/7b/marina-barrage.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d379346-Reviews-Chinese_and_Japanese_Gardens-Singapore.html",
    "location": "Address: 1 Chinese Garden Road Chinese Garden, Singapore 619795, Singapore ",
    "description": "\nThe garden was located just outside the Chinese Garden MRT station. At first, I was unsure about the place since it was not crowded at all (there were only some locals exercising...\nread more \nEasy to visit due to the train station but the wide open spaces, typical Singapore trees, screaming schoolkids and lawn mowers make it more like an attractive park for suburbanites. Climb the 7-storey pagoda and you can see how it's a green island amid residential sprawl. However, the bonsai and rock garden is beautiful and quieter. The Japanese garden is...\n\n\nMoreÂ  \n\n\n\nAfter visiting some of Singapore's more popular locations, the Singapore Zoo and Universal Studios, my girlfriend and I wanted a break from it all, so we visited the Chinese and Japanese Gardens. The two gardens did not disappoint. The area was absolutely gorgeous. The architecture was stunning and did a great job balancing with nature. It truly felt tranquil, specifically...\n\n\nMoreÂ  \n\n\n\nIt's a hidden gem located at Jurong East. There are nice architectures and structures. It's really quiet and if you love walking, you can enter Chinese Garden and walk all the way to Japanese garden and back. It's just located outside the Chinese Garden MRT station and it's free!\n\nThe garden was located just outside the Chinese Garden MRT station. At first, I was unsure about the place since it was not crowded at all (there were only some locals exercising there, maybe because it was weekday). To my surprise, the Chinese Garden is actually a very nice place. The seven-storey pagoda, Chinese heroes statues, twin pagodas by the...\n\n\nMoreÂ  \n\n\n\nWe were looking for a break from the excellent, but very crowded, better known attractions of Singapore so headed for Chinese Garden on the MRT (EW line) where there is an exit leading through a park right to the eastern entrance to the Jurong Lake Gardens, incorporating Chinese and Japanese Gardens.\nThe 13.5 hectare park was built in 1975 and...\n\n\nMoreÂ  \n\n\n\nI enjoyed walking around the Gardens and taking photos. I saw lots of large monitor lizards. Lots of interesting areas to look at, and it was a pleasant way to spend a couple of hours.\nI wanted to visit the Bonsai Garden but it was shut and locked. The sign says it opens 9am but on the morning I visited...\n\n\nMoreÂ  \n\n\n\nI have been staying around this place for more then 10 years,, as walking distance from my place.\nMorning jogging to the park, very refreshing and you saw many people exercise there, some working out with tai chi, some groups exercise.\nYou can also climb up the tower about 7 story high to have a good view of the HDB...\n\n\nMoreÂ  \n\n\n\nWe took our small kids there and had a lovely afternoon. The garden is incredibly beautiful and much nicer than a lot of other more advertised places in Singapore. The outdoor Turtle Museum was heaps of fun for the kids. They could feed the turtles and even saw a monitor lizzard. A must see in Singapore as it also reflects...\n\n\nMoreÂ  \n\n\n\nNot a must see, but if you have the time, it is worth the visit. Nice park with a great bonsai exhibit. Stop by the turtle museum - so many turtles!\n\nEnjoy a visit to a place like no other, This big place is very beautiful to walk and see. The gardens, the small buildings like temples and statues, lakes and birds flying around make it a very nice place to stay and walk for a while.\n",
    "type": "attractions",
    "title": "\n\nChinese and Japanese Gardens\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/c6/2a/e9/chinese-garden.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d9580678-Reviews-Punggol_Waterway_Park-Singapore.html",
    "location": "Address: 10 Sentul Crescent Road, Singapore 828851, Singapore ",
    "description": "\nPunggol Watergate park is easy reachable by MRT. From the Shopping-Center Waterway point you can take the LRT into the park, or you can walk from the Center. It is a nice an quiet...\nread more \nPunggol Watergate park is easy reachable by MRT. From the Shopping-Center Waterway point you can take the LRT into the park, or you can walk from the Center. It is a nice an quiet park and very different from central Singapore. The mall is in no way packed with tourists, so you get a good picture of local shopping in...\n\n\nMoreÂ  \n\n\n\nBeen living in the area for more than 14 years now and each year, a walk down the waterway throws up something new. Pathways are still being improved and cycling tracks are well constructed to cater to both pedestrians and cyclists. The only grouse is the trees planted cannot grow as fast to provide better shades. Links to Coney Island...\n\n\nMoreÂ  \n\n\n\nWe love this beautiful park. Bikes can be rented from \"Waterway and Wheels\" at the new Safra Punggol which also has eateries like Pizza Hut and Mcds. A great place for cycling, nature walks or family picnic. There's even a water play area for kids at one end of the park. Just a precaution, we came across a pack of...\n\n\nMoreÂ  \n\n\n\nBeautiful place to visit at night with your family to chill out. Sat here while waiting for the new year. Simple and priceless moments with my family. You can even bring a picnic mat and have one around that area. Singapore does have nice calming place.\n\nDo make time to come here and chill with friends or even cycle wit family.. definitely one awesome view especially during the evening time.. its windy too.. by wary of dogs loitering around as well... I was lucky was 3 dogs were sleeing.. hehehe.. had a good walk from the entrance of Coney Island all the way up to Punggol...\n\n\nMoreÂ  \n\n\n\nTry out the IMAX in Waterway point, exceptional and great value for money, the whole mall is family friendly and food is great! Impressive to enjoy Star Wars Rogue One with all the latest IMAX experience. Highly recommended\n\nThis is one of free things to do in Singapore. Walk along the waterway. Or sitting on the bench enjoying the wind. The garden is neat and lovely. Visit to have a relaxing late afternoon! To get here: From MRT Punggol take bus#84. Stop at the 3rd shelter. Start there, walk along until you arrive at MRT Punggol again (Waterway...\n\n\nMoreÂ  \n\n\n\nThe best ever way to relax and get away from the cosmopolitan.\nGreat for solo, couples both young and old, families, friends to walk, jog, run, cycle or even a picnic!\nFantastic place to just unwind. For free! My love to go place at least once a week;)\nOne can bike along the waterway to Waterway Point at No cost!\n\nWe walked from Punggol Waterway Point through Punggol waterway park to Punggol Park which is opp Hougang Ave 10. We walked really slow and took short breaks in between and it took us >2 hours to complete the >4km. But the walk was nice with nice views along the way. Its really popular with joggers n cyclists and there's destinated...\n\n\nMoreÂ  \n\n\n\nPunggol Park is one that has more scenic views compare to the rest of the parks in Singapore. This park serves the entire Punggol Waterway and there are alot of designated places to take photos or simply laze around.\n",
    "type": "attractions",
    "title": "\n\nPunggol Waterway Park\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/09/d2/77/8a/punggol-waterway-park.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d4089881-Reviews-River_Safari-Singapore.html",
    "location": "Address: 80 Mandai Lake Road Singapore Zoological Gardens, Singapore 729826, Singapore ",
    "description": "\nWe have visited Singapore Zoo couple years ago, but just recently we visited River Safari.\nWe stroll down the river with the boat so we could see some animals (mostly from...\nread more \nI have a boy who loves animals but doesn't enjoy seeing them in cages or close quarters. The river safari was a great option. I also have another boy who likes animals but doesn't want to spend an entire day in a zoo, so this work out very well. The major highlight for us was the Amazon river ride. It's...\n\n\nMoreÂ  \n\n\n\nGreat undercover location to wander if it's raining or super hot especially. Manatees are an absolute highlight and a must see. Great baby facilities for discrete breastfeeding and changing. Don't necessarily do by itself and do with a zoo visit for a full day (49 SGD for both).\n\nLoved this experience, especially in comparison to the actual zoo also. Extremely relaxing & soothing. Vast array of animals & freshwater life. In my experience, even better than sea aquarium at Sentosa (different, yes, I'm aware). A very very pleasant & happy experience overall. Well done.\n\nWe have visited Singapore Zoo couple years ago, but just recently we visited River Safari.\nWe stroll down the river with the boat so we could see some animals (mostly from Amazon forest) on our left and right side.\nVery interesting\n\nArrived just after 10.00 opening and besides a couple of school groups was very quiet which really made a difference. We wanted to visit animals but didn't want a whole day traipsing around a zoo so chose the river safari. It's essentially a trail with a bunch of fish tanks along the way with animals and fish from various river...\n\n\nMoreÂ  \n\n\n\nWe personally prefer singapore river safari than singapore zoo.cozy and quite organized.got two pandas inside besides the animal in waters.we also get an experience with smal boat and can see few animals along like jaguar etc.few restaurants available.we only got chance to try one restaurant near pandas exit.dont forget to try panda's pao.so cute and delicious at the same time.over...\n\n\nMoreÂ  \n\n\n\nWe visited the Riverside Safari on a Sunday, we arrived at 10:30, queued to get the tickets for Riverside Safari. The queue was rather long and took approximately 20mins.\nTickets were sold at the main ticketing booth so you are in the same queue as visitors going to the zoo.\nRiverside safari was not as busy as the main zoo....\n\n\nMoreÂ  \n\n\n\nRiver Safari, sandwiched between the famous Singapore Zoo and Night Safari, houses one of the worldâ€™s largest collections of freshwater fauna, with over 6,000 animals including 40 threatened species and is worth a visit not only because of \"Kai Kai\" and \"Jia Jia\" - the two Giant Pandas and probably the most famous animal attraction of Singapore - but also...\n\n\nMoreÂ  \n\n\n\nVery gud maintenance...But nothing so attractive... It's like combination of aquarium , zoo and bird park...I think all remaining creatures are put into this ..\nThere was river Safari cruise .Just 10-15 min ride.. Waste of time.. u see little view of rhino , giraffe from cruise ...Which was kept actually in zoo...\nBoat Safari is another waste of money......\n\n\nMoreÂ  \n\n\n\nIt was a rainy day throughout our visit here but with the covered walkway it wasn't too much of a problem. We still enjoyed ourselves thoroughly with many great exhibitions of exotic fresh water animals. The red panda was not in the mood for an audience while we only managed to see Kai Kai the panda for less than 5...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nRiver Safari\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/08/12/47/ce/river-safari.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d324755-Reviews-Fort_Canning_Park-Singapore.html",
    "location": "Address: Cox Terrace Fort Canning Cultural Centre, Singapore 179618, Singapore ",
    "description": "\nIt's hot so wear a hat and sunnies, try and head over earlier or later in the day. Good for a family trip to walk around get a mini hike in going up the stairs.\n\nI was there 5days and it looked nice but room service was really poor.\nWhen I came out from room hotel smelled like grandmothers kitchen.\nWhen I asked for umbrella, They didn't have.\nThere is LONG way to be on \" Good \" hotels list!\nWe spent 600 SGD for room service and 2 days later they came back with...\n\n\nMoreÂ  \n\n\n\nIt is so lush and green, absolutely beautiful! There are so many huge trees, that must have taken years and years to grow to that size. Yet all this in the middle of the city.\n\nIt's hot so wear a hat and sunnies, try and head over earlier or later in the day. Good for a family trip to walk around get a mini hike in going up the stairs.\n\nThis area was one of the key strongholds for the British army when they were fighting against Japan for sovereignty of Singapore. There are information boards which tell you about the history and some relics such as canons and lighthouses. The park is free to enter.\nThe real attraction around this area is the Battlebox museum, so if you want...\n\n\nMoreÂ  \n\n\n\nA nice tranquil park to walk around in the midst of a bustling commercial zone. A venue for open air concerts as well.\n\nSo close it is from Clare Quay but a beautiful garden walk. A hour walk was extended to more than 2 hours due to some nice showers. Like any other location in Singapore, we could manage the visit using the map that was self explanatory. It was amazing to see a few left-over Madras thorn trees. We had been to...\n\n\nMoreÂ  \n\n\n\nvisit this area for peace and tranquillity. situated in the heart of city hall, accessible at various points. take a leisurely walk around the hill and enjoy.\n\nWe arrived about 9.50 and setting in the Colonial self guided tour (downloaded the pdf). It said 45 mins but we spent 2 hrs wandering around ... it was great. Then we walked on down to the Raffles shopping centre and had lunch at the food court - $21 for 4 lunches!\n\nWalked from the hotel and a wee bit hot and sweaty around noon. Nice and quiet area showing part of Singapore's heritage in the early 1900's.\nGood area for jogging.\n\nFort Canning Park is a quiet oasis atop a hill immediately to the north of Clarke Quay. There are soaring rainforest trees, a spice garden, well sign-posted leafy walks and views over the city, and to Marina Bay. there are also fortifications, an underground former command centre and a characterless cafe deep inside the main building. The park is the...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nFort Canning Park\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/48/25/79/fort-canning-centre-picture.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d2344356-Reviews-Mount_Faber-Singapore.html",
    "location": "Address: 109 Mount Faber Road Faber Peak, Singapore 099203, Singapore ",
    "description": "\nWe visited Mt. Faber as we had a day to kill and thankfully we were not disappointed. It gives a different view of Singapore and it houses the Faber Peak from where you can get...\nread more \nWe visited Mt. Faber as we had a day to kill and thankfully we were not disappointed. It gives a different view of Singapore and it houses the Faber Peak from where you can get cable cars to Sentosa, Bell of Happiness and also small bells which are tied there. You can also see a small Merlion there and visit...\n\n\nMoreÂ  \n\n\n\nThere's not much to do on Mount Faber, but the views are great. It warrants a quick stop through to get the views, but I wouldn't plan much time here. The cable cars are a great way to connect this with a trip to Sentosa.\n\nMount Faber Peak is where you can find an old bridge full of little bells with wishes written on them. The bell of happiness is then rang to answer your wishes. This was a great experience and yes I definitely made a wish on a bell. This is located just behind the cable cars so you cannot miss it.\n\nFriends took us at night, which I would say is best. Otherwise you can get the Faber/Sentosa cable car and get off at the top before you go back across to Sentosa. Cooler up there as well.\n\nThe highest point of Singapore. And the third is Singapore Cable car station. The mountains around trees. And be careful there are no taxis in\n\nUse the cable car to reach the peak after that take a walk to faber point and downhill to hudson wave boardwalk. Best if you arrive in the morning.\n\nKids loved the cable car rides and views from the top... This is a must go on your way to Sentosa and gives a good view of the entire theme park...!!!\n\nRomantic mount for all ages you can see Singapore from up with nice road teaching the TOP enjoying the beauty of the nature and sea view\nGood experience\n\nYou can see the city from above. It's a nice place to walk, you'll need a lot of stamina, because it's kinda steep to walk to.\n\nTake a stroll on Mount Faber and see the fabulous Henderson Waves boardwalk. A really nice and tranquil walk in height with the treetops.\n",
    "type": "attractions",
    "title": "\n\nMount Faber\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/5a/d0/64/view-of-the-waterfront.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d324758-Reviews-Haw_Par_Villa-Singapore.html",
    "location": "Address: 262 Pasir Panjang Road Haw Par Villa, Singapore 118628, Singapore ",
    "description": "\nThis park is a bit run down but the detail of the sculptures is jsut stunning. If you take some time to marvel at the depictions of gods and even everyday situations you will...\nread more \nIf your into the odd and quirky then this place will put a smile on your face. personally I thought the concept and style of art / architecture were great and a visual relief from the every day Singapore bling. Its kind of Gaudi esque kind of place. I dont think its for kids as it has a touch of...\n\n\nMoreÂ  \n\n\n\nThis is my favorite place that I want to visit during my trip because their show the myth of Chinese folk tales along with scary picture but their also add knowledge and idea of the story and the best thing is the place is free tourists not have to pay to enter the place.\n\nWe have passed this place so many times that we needed to visited. It may depict much Chinese history and folklore, but for outsiders is an absurd and freaky place. Once is enough!!\n\nThis park is a collection of crude and primitive figurines depicting scenes in Chinese folklore and mythology. For those familiar with the subject and the language, the collection of diorama is fun to look at. For the uninitiated, the Court of Hell is quite a shocker, with its depiction of decapacitated heads near the entrance and various scenes of torture...\n\n\nMoreÂ  \n\n\n\nA park created to depict scenes of Chinese Mythology and a magical underworld of death torture and reincarnation.\nThe park is free having been donated by the creator to the city but has deteriorated over the years. I am glad to say that it is undergoing a refurb just now but is well worth a visit in anyone's book.\nGet...\n\n\nMoreÂ  \n\n\n\nAbsolutely Amazing place but nothing to buy.\nWe travelled to the Haw Par Villa station on the MRT and found the entry only feet away to the right.\nThe entry is free at the moment and i would have still paid something as it is worth it.\nOne of the local schools should do a gold coin donation to raise...\n\n\nMoreÂ  \n\n\n\nFilled with statues that have evidently seen better days, this park nevertheless provides some outdoor entertainment if you don't mind walking in the heat. Easy to get to, as it's a short stumble from the MRT station. Children may be a bit frightened by some of the imagery.\n\nI recommend this place for all of tourists. It have big statue,green environment and great ambience. You learn a lot from this place. Respect!\n\nThis park is a bit run down but the detail of the sculptures is jsut stunning. If you take some time to marvel at the depictions of gods and even everyday situations you will catch a glimpse at the old Singapore. The 10 courts of hell are not for weak stomachs or small kids.\n\nThis place is like absolutely nowhere else. Huge statues in an enormous park depicting Chinese legends, mythology and folklore. The Ten Courts of Hell are the highlight. Gruesome but fascinating. Entrance is free. At the moment there is a big restoration project going on so if you can visit from late April/May onwards that would be better as some of...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nHaw Par Villa\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/33/21/22/quan-yin-goddess-of-mercy.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d317426-Reviews-East_Coast_Park-Singapore.html",
    "location": "Address: Along East Coast Parkway and East Coast Park Service Road (Bedok), Singapore 455486, Singapore ",
    "description": "\nThe best beach I have been so far. Its little further away from all the noise, very clean and well maintained beach.\n\nThe best beach I have been so far. Its little further away from all the noise, very clean and well maintained beach.\n\nA place for you to do a myriad of things like walking, jogging, running, cycling, bbqs, picnics, water sports, etc. Also available are food outlets and a hawkers' centre for those eating-in as well as for take-aways.\n\nEast Coast Park is a great way to get a nature feel close to the city. There's bike rental places, or one can simply walk or run the path. There's lots of great places to picnic, but there's also plenty of food options along the way (from fast food to great chili crab places). You also get a pretty awesome...\n\n\nMoreÂ  \n\n\n\nFull of activities you can do at the park. You can rent a bicycle and cycle all the way to the jetty. It's a clean park, with clean beach. You can choose to picnic there and BBQ. There are many restaurants and cafes, as well as fast food restaurants so you will never have to worry about getting hungry!\n\nVery busy park - full of walkers, cyclists and people having picnics. Lots of convenient BBQ points and shops as well - so you can always stop off and eat - everything from starbucks to jumbo seafood. Great to stop into the reservoir and watch the jet skiing goign round on a wire!\n\nPerfect place to spend a day. Every 1km or so there are bike rental places with super reasonable rates. Separate cycle paths and walking paths mean you can cycle really safely all the way from Changi down to Gardens by The Bay.\nThere are also large BBQ pits that can be rented out - always looks so fun when big...\n\n\nMoreÂ  \n\n\n\nAn excellent place to visit when in Singapore. Lots to do if you spend the morning, afternoon or a full day here with beaches, lush flora and bike and walking paths. Recommend hiring a bike and the hawker centre here. Good attraction!\n\nEast Coast park is a great place for locals and visitors to Singapore. The park connects all the way from Gardens by the bay to round the back of the airport and eventually Changi beach. I often cycle the full length of it at the weekend.\nYou can rent bicycles from many different places in the park and ride along...\n\n\nMoreÂ  \n\n\n\nMy kids wanted the beach during our short trip into Singapore from Johor. And East Coast Park provided a nice relaxing breezy afternoon. Beach was decent in cleanliness and water clean enough for play. Convenient parking site and foodcourt a few steps away.\n\nThe East Coast Park is a tremendous facility for locals, particularly on the weekend with families and friends picnicking, walking, running, cycling, fishing, and even swimming. For visitors who want a low key break from the busy city, plus a cooling breeze, the park provides a pleasant interlude, and more shipping to look at than you can shake a stick...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nEast Coast Park\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/6c/9c/c0/east-coast.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d1527627-Reviews-MacRitchie_Reservoir-Singapore.html",
    "location": "Address: Off Lornie Road, Singapore, Singapore ",
    "description": "\nIf you are an Expat in Singapore and need a rest from city crowds and noise, look no further than MacRitchie Reservoir/Park.\nThere are fantastic walks or runs here to while a day...\nread more \nIf you are an Expat in Singapore and need a rest from city crowds and noise, look no further than MacRitchie Reservoir/Park.\nThere are fantastic walks or runs here to while a day away, along with an assortment of animals and birds.\nA real Oasis in Singapore\n\nA popular place with some nice quiet corners to hide a away. The path round the lake is decent and gives you the impression at times of being outside Singapore's concrete jungle.\n\nCan't believe that there's a kind of place which is truly natural in Singapore.Many people think that there're only concrete jungle in this city but they're totally wrong!! This place can guarantee all tourists that there are nice,pleasant jungle in the city.Moreover, there's an amazing free-standing suspension bridge among this forest. I can tell you that I was quite impressed...\n\n\nMoreÂ  \n\n\n\nYes one can see the thinking that went into this area. While the iron works speak of a craftsmanship not often seen today the practicality and the natural landscaping of this preserve and reservoir is second to none. Bring the family, a hat and some water.\n\nWe always do a 10 km trail run here with my friends. I see people also taking their walks here. The place gives you like forest adventure ambiance. The tree top hill view is a definitely a place to see when you are here. It has a hanging bridge which gives you a different view of Singapore, that its not...\n\n\nMoreÂ  \n\n\n\nOver the years weâ€™ve visited quite a few times. Love the scenery, and a rare chance in Singapore to see rainforest.\nThis time we came on a Sunday, and found everything very crowded. Both cafÃ© and toilets were adequate for the visitors, but paths were difficult. The park was fine, but the walk into the forest was difficult. Seeing any...\n\n\nMoreÂ  \n\n\n\nWent on weekend Saturday morning and place was crowded with lots of people jogging, running or simply taking a walk. There were Kayaking lessons going on.\nOne can see beautiful mist while walking on tracks. Excellent place.\n\nWell worth taking a taxi from your hotel if you have a half-day to spare. This is about 20 minutes by taxi from Orchard Road. There is no nearby MRT station. This is a delightful way to stretch your legs after a long flight or before you leave Singapore.\nYou soon leave the bustle of the city behind and walk...\n\n\nMoreÂ  \n\n\n\nThere are many trails around the MacRitchie Reservoir - one will bring you to the Tree Top Bridge. It is a very lush and green experience, best done on weekdays since there are no crowds. Remember to bring water since it will be a very hot hike through the rainforest and around the lake.\n\nA tranquil virgin rainforest. Good place for short walk and take in the tranquil view of the lake and nature. For the more sporty they can enjoy a goo walking trail around the nature reserve.\n",
    "type": "attractions",
    "title": "\n\nMacRitchie Reservoir\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/2b/5f/bd/les-fameux-singes.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d317427-Reviews-Esplanade_Park-Singapore.html",
    "location": "Address: Connaught Drive, Singapore, Singapore ",
    "description": "\nVisited twice, once at night and another one at noon. It is obviously better to visit at night, as the weather will be more friendly, and you can take better picture.\nPS: Bring...\nread more \nVisited twice, once at night and another one at noon. It is obviously better to visit at night, as the weather will be more friendly, and you can take better picture.\nPS: Bring a tripod if you have SLR cameras.\n\nSingapore is really alive and colourful at night - and safe! Don't miss this evening walk, and enjoy the illuminations.\n\nTake a walk anyway in Singapore at night and it's a great delight. Lit up across the city it's great to just walk and take in the marvellous views.\n\nSimple pleasure â€“ a lovely relaxing night walk at Esplanade to discover the splendour Skyline of the City. So safe and convenient to go out at night in Singapore, even alone.\nThe historic buildings and the contemporary buildings co-exist so beautifully.\nSavouring the walk, no need to rush and hurry, stop to rest or linger at certain point a little...\n\n\nMoreÂ  \n\n\n\nEnjoy a walk along the river and capture Singapore illuminated. Stop off at a bar and enjoy the view.\n\nSingapore is designed with people in mind and this is no exception. The Esplanade Walk is better in the evening when the temperature is slightly cooler. The surrounding areas are lit up beautifully especially for the light show in the evening.\nYou are close to many attraction, so get your walking shoes on and enjoy the journey.\n\nWonderful way to end your visit to Singapore especially after a sumptous dinner in the nearby eateries! You can also view the beautiful landscape\n\nThe contrast of electric lights from the city buildings and the laser show seem all that much brighter against the back drop of a pitch black sky.\n\nThis is a perfect walk to experience many of the Singapore Icons, and allows one to view the light show in the evening too! Being CNY it was very popular with families and tourists alike, but most enjoyable.\n\nGreat place for a stroll and awesome place for photography buffs where various Singapore icons can be easily seen and photographed.\nLook out for the Merlion Park where you can spot the mythical creature spouting water and its little cousin near by. The Marina Bay Sands hotel is another much photographed building with a ship-like sky deck. Do not miss...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nEsplanade Park\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/35/5c/6c/another-shot-of-the-esplanade.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d4283466-Reviews-Singapore_River-Singapore.html",
    "location": "Address: Boat, Clarke, Robertson Quays, Singapore, Singapore ",
    "description": "\nWe stopped by Hooters for lunch on the banks of the Singapore river we ended up staying for a while just chilling out and watching the boats go by . Great stuff\n\nWe stopped by Hooters for lunch on the banks of the Singapore river we ended up staying for a while just chilling out and watching the boats go by . Great stuff\n\nAlong Boat Quay there are many places to eat and drink with excellent pubs and really good food, alcohol is not however particularly cheap. Boat Quay is very popular with the workers from the nearby offices and can get busy at lunchtimes so aim to get there before 1pm. It is very lively in the evenings and is a pleasant...\n\n\nMoreÂ  \n\n\n\nAnother freebee for us on the Singapore Stopover, caught the hop on hop off bus to catch the boat. Great way to see the city, got some great photos en route.\n\nThere are lots of important sights that surround the Singapore River, so it's well worth going down to have a look. The re are lovely flat walks and good views of the Singapore. Heaps of places to stop and eat too.\n\nIt's really pretty at night and you can choose to take a river cruise down the river, where there will be audio tour on the boat to introduce you to the places along the river. It's really cooling to sit at the deck outside. Alternatively, you can choose to sit by the river at Clarke Quay, just outside The Central....\n\n\nMoreÂ  \n\n\n\nDefinitely there are many places along the rive like Robertson Quay and Clarke Quay that have tons of restaurants and bars.\nGreat selection and choices for dining and drinking.\nAt night on the weekends both are packed.\nThere is a very nice walkway on the river.\n\nI have stayed at the Park Regis, close to Clarke Quay, 3 times now. I love Clarke Quay, in particular, and Boat Quay. As far as I am concerned they are the place to be in the evening. It is a beautiful area. There are numerous restaurants and bars to choose from. Some of these are vibrant with live music....\n\n\nMoreÂ  \n\n\n\nNice and peaceful. Lots of eateries. People are allowed to get their own drinks to the bridge and spend time. Very lively and vibrant.\n\nWe did a Singapore river cruise on a dry warm night which was absolutely spectacular especially at sunset! The river is almost the \"hub of Singapore\" .. the water was so clean and there were many Singapore highlights to see along the way.\n\nThe bum Boats on the Singapore river and a very relaxing way to see the sights, full commentary is given which was very interesting on singapores history, you can sit inside or outside, a camera is a must, You can get on the boat at several stops but I prefered Clarke QuayGood for kids, a little hard for wheelchair people...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nSingapore River\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/22/98/82/singapore-river.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d4400781-Reviews-Cloud_Forest-Singapore.html",
    "location": "Address: Gardens by the Bay | 18 Marina Gardens Drive, Singapore 018953, Singapore ",
    "description": "\nWe were very impressed with this attraction, and were amazed by how it was all put together. Is certainly a must see as part of the Gardens by the Bay.\n\nWe were very impressed with this attraction, and were amazed by how it was all put together. Is certainly a must see as part of the Gardens by the Bay.\n\nBeautiful structure and we were really impressed. Great to be in here in the heat of the day and easily wasted an hour and a half wandering around.\nWell worth the entry fee of 28SGD with the Flower Dome too. And Gardens by the Bay have great baby rooms for discrete breastfeeding and changing.\n\nCant belive how big this was and how interesting the visit was would definitely recommend a visit here\n\nWas on my bucket list and was not disappointed, well worth it, we went later in the day so not so crowed and then stayed for the sound and light show in the super tree grove.\n\nWas more or less draged to this place. Lovely building and nice with the cool air there.\nOtherwise not worth it.\n\nPart of the Gardens By the bay in front of Marina bay sands. The Man made waterfall is huge. You actually take a elevator to the top of the Mountain within the dome and walk down each level as you see different things.\nPurchasing tickets beforehand is advisable to avoid long ques at the ticketing booth, especially on holidays\n1...\n\n\nMoreÂ  \n\n\n\nWe found it very unique... they have made it so beautiful and can found lots of different trees and shrubs the waterfall is good and they provide lifts to go up and then can come down by slope... good... they taken care of everything also they shown a model which says how this garden is helpful for decreasing the pollution...\n\n\nMoreÂ  \n\n\n\nThis was one of the highlights to our trip to Gardens by the Bay. Very stunning and just refreshing in a crowded city.\n\nThe entire water cycle is re-created in front of us by this attraction. The interiors are cooled by the continuously churning water. There are 6 floors to this attraction and elevators are provided. The walkways offer fabulous views of the bay\n\nNothing beats being out there in nature but this place does an okay job to simulate the mountains and the rainforest experience at least for a few minutes. Come here and talk to your kids about the beautiful nature that we all need to preserve, and then please find time and take your kids to real mountains somewhere because this...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nCloud Forest\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/07/ef/a4/41/cloud-forest.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d1177497-Reviews-Marina_Bay-Singapore.html",
    "location": "Address: Marina Boulevard, Singapore 018980, Singapore ",
    "description": "\nA perfect view of Singapore's great skyline, ocean views and a purpose built walking path. If you can, view it at night for an even better photo opportunity! And as a bonus, if...\nread more \nA perfect view of Singapore's great skyline, ocean views and a purpose built walking path. If you can, view it at night for an even better photo opportunity! And as a bonus, if you're lucky you might even catch the mechanical light show.\n\nStrolling in the evening and have dinner is a wonderful experience... after coming out from garden by the bay this place can be usedfor evening\n\nthis is one of the most fascinating skylines to see.\nby night or by day its just beautiful and peaceful.\nlove it there\n\nWe could see the bay from our hotel during the day but we only went here at night because of the heat during the day. We preferred a spot near the Esplanade Mall to soak in the skyline, the Merlion and the Marina Bay Sands area. Brilliantly lit, this place can make hours look like minutes. One can enjoy a...\n\n\nMoreÂ  \n\n\n\nPlace is accessible on foot. But walk around the area and you will find really nice angles of Singapore on foot. Explore! It's worth it!\n\nas someone that been here in Singapore for many years, always like to spend my evening there enjoying the city skyline ...\n\nWalked around Marina Bay twice during my 5 day stay, every time you see another angle of modern architecture partly combined with colonial architecture from late 19th or early 20th century.\n\nThere is so much to see and do at the Marina Bay. Shop at the Shoppes, eat at one of the great restaurants, admire the most beautiful views of Singapore, walk on the Double Helix bridge, visit Gardens by the Bay, enjoy fantastic light shows after dark. There is something for everyone at the Marina Bay. My favourite place in...\n\n\nMoreÂ  \n\n\n\nMarina Bay is a highlights of Singapore. Great area for promenade. The star is the Marina Bay Sands Hotel.\n\nA lovely place to get a great view of the skyline of the city. From here one can take the boat ride that takes you to beautiful iconic buildings along the river\n",
    "type": "attractions",
    "title": "\n\nMarina Bay\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/1c/10/7e/marina-bay-view-from.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d324761-Reviews-Night_Safari-Singapore.html",
    "location": "Address: 80 Mandai Lake Road, Singapore 729826, Singapore ",
    "description": "\nWas there on Wednesday during the Mar school holiday.\nThere are tourist crowds and need to wait in queue the watch the only show of the night, so be there at least 30 mins before...\nread more \nNice enough, though quite a short ride on the safari train. You can however, walk through the park on foot after the ride which is good.\n\nWe combined our visit to the Night safari along with River safari. We saw the River safari during the day then had food at the foodcourt and then headed to the Night safari. Being the peak season of last week in December, it was very crowded.\nYou have to book slots in advance ant tickets may not be available at...\n\n\nMoreÂ  \n\n\n\nWas there on Wednesday during the Mar school holiday.\nThere are tourist crowds and need to wait in queue the watch the only show of the night, so be there at least 30 mins before the show start. We enjoy the tram ride and when for the Wallaby side walk which is new and interesting. Do expect not to see...\n\n\nMoreÂ  \n\n\n\nWe loved this. Although it was a bit busy and chaotic getting sorted. Onve on the tram and doing the trip it was excellent. Most animals we out. Some free to roam and other in exibits. Also because it is night, some animals are hard to see, make this part of your adventure. We then did the walking trails, also...\n\n\nMoreÂ  \n\n\n\nPlace is awesome We visited at 9pm\nThey take u on a tram to see animals that was really nice and after that there was a show that was really awesome The host in the show is a girl who speaks all the languages that i really like I will never forget that charming girl\nAfter that we see fire...\n\n\nMoreÂ  \n\n\n\nHow is it that I'm Singaporean and yet it took me 20-odd years to visit the Night Safari? I actually enjoyed it, especially the tram ride, where you get to see the animals up close and feel the cool breeze of the night against your face. Love the informative commentary that feeds you with interesting nuggets along the ride.\n\nGood for a trip with family, friends\nChildren can enjoy by seeing animals at a near distance\nMust for tourist\n\n\"Creatures of the night\" show was very good. Take a tram to get an insight of the safari at night. Spot the animals in night when they are the most active. Also do take the walking trails.\nTip: If you are going to visit zoo, night safari, river safari and jurong park, take 4 in one pass and save around...\n\n\nMoreÂ  \n\n\n\nIf you have ever been to Africa on a real safari you might be slightly disappointed. Here you are guaranteed to see plenty of animals but in their enclosures apart from some antelopes and tapirs that roam freely. We had everything booked ahead time and thus did not have to wait anywhere. The show \"creatures of the night\" is rather...\n\n\nMoreÂ  \n\n\n\nHigh expectations probably didn't help our visit. Quite a long wait for the 'Creatures Of The Night' presentation was rewarded with 6 fairly bored-looking animals - presenter did his best with limited material before the real reason for going - the tram ride.\nHalf the animals (at least the visible ones) were asleep or looked like they were quite bored...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nNight Safari\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/bf/b2/1e/night-safari.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d310900-Reviews-Singapore_Botanic_Gardens-Singapore.html",
    "location": "Address: 1 Cluny Road, Singapore 259569, Singapore ",
    "description": "\nDue to the high humidity we didn't get to visit all of these gardens, but the orchid section is a must see. Lots of different colours and sights, the orchids are rotated through...\nread more \nDue to the high humidity we didn't get to visit all of these gardens, but the orchid section is a must see. Lots of different colours and sights, the orchids are rotated through what is flowering at the time. There were a number of schools visiting at the same time, but generally the area is big enough for all, definitely...\n\n\nMoreÂ  \n\n\n\nIt is sheer bliss to walk around this beautiful gardens. Well maintained, the gardens are spread over a huge area. Involves a lot of walking around so be sure to wear comfortable footwear. Not to be missed is a visit to the National Orchid Garden which requires a entrance fee to be paid. Couple of hours required to leisurely walk...\n\n\nMoreÂ  \n\n\n\nWe read in NZ before our trip to Singapore that the Botanical Gardens had recently opened a new tropical forest area called The Learning Forest - what an experience. The gardens are very easy to get to via very reasonable taxis and the gardens are free to enter. The new Learning Forest is amazing and includes many tropical jungle trees,...\n\n\nMoreÂ  \n\n\n\nThis place is very relaxing. Lots to see and do. There is a large grass area where you kids and run around and sometimes you can see lizards wondering around. You can buy food and a sitting area. Dogs are permitted.\n\nMy friends live in walking distance of the gardens so I visit every time I go and see them. I always love walking around the gardens and seeing what new elements or exhibitions are currently on.\n\nO' yes very nice to get some sweet smells and to see some green tropical flora and fauna.\nYou must see the Orchids !\n\nGreat eatery at the Botanic Garden (Casa Verde) with nice ambient listening to the sound of water fountain. Perfect place to walk the dog after sumptuous meal and enjoy the botany in the surrounding of the Garden.\n\nWe visited the Gardens really to see the orchids but the grounds are extensive and wanted to check out more, especially the fragrant garden but the signage directions were non existent and we never found it. Meant to go back as we'd run out of time but other attractions took over. The floating band stand has to be seen. Lots...\n\n\nMoreÂ  \n\n\n\nThese are very large gardens, with many trees to see rather than flowers. Everything is spotless, and beautifully looked after. Well signposted.\n\nWent with my wife and loved the almost 6 hours we spent there. The best place to spend a day (well this one and Gardens by the Bay). The spaces are beautiful, Orchid Garden is a blast and even if you are not a huge fan of plants, you will love this place. So peaceful, so much variety. Totally recommended.\n",
    "type": "attractions",
    "title": "\n\nSingapore Botanic Gardens\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/09/76/7b/2b/singapore-botanic-gardens.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d315466-Reviews-Jurong_Bird_Park-Singapore.html",
    "location": "Address: 2 Jurong Hill Jurong Bird Park, Singapore 628925, Singapore ",
    "description": "\nEven though Bird park quite far away from the city center, it is worth a visit. Plan to reach early so that you can catch all the shows during the first half of the day and can...\nread more \nEven though Bird park quite far away from the city center, it is worth a visit. Plan to reach early so that you can catch all the shows during the first half of the day and can easily finish seeing the park by 2-3 PM.\nWe traveled by the MRT and then took a bus from the Boon lay bus...\n\n\nMoreÂ  \n\n\n\nIt is birthday trip for my 5 years old nephew. He enjoyed see the birds shows and different species of the birds. Unfortunately at the children play, which is the pool that we forgotten to bring his swimming trunk that he cant play with water. He is upset with it. For parents or aunties/uncles that wan the kids to have...\n\n\nMoreÂ  \n\n\n\nNice to see the birds in there and experience on feeding the parrots by yourself but make sure to bear with pains due to bird's crawl\n\nGet good photos, like a Natgeo photographer. Birds sit on you to take photo. Get a good camera , get a set of lenses and you are on your trail to be no 1 bird photographer ! Best of luck--- visit it !\n\nIt was raining when we visited the place early morning. The park was currently having a Smurf event until end of the month at the waterfall area. One could take the tram to third stop or walk there. Besides having 300 smurf figures around the place, there was also egg hunt, egg decoration activities for kids to enjoy.\nA tab...\n\n\nMoreÂ  \n\n\n\nThe grounds are beautiful, the birds spectacular, the shows cheesily entertaining. Great day with kids.\n\nHuge varieties of animals. One can checkout Pengiuns too here. Bird shows were simply marvelous. Spent 5 hours.\n\nWide variety of birds, informative and nicely maintained. You have to walk a lot, there is tram available but it is recommended to walk through park to not miss anything. Best place for kids. Check timings of shows and plan accordingly. Visit park as early as possible.\n\nAnother jem of a place in Singapore to interact & learn a bit about the animal kingdom, which we city dwellers have no time for. To see them up close & touch them at times can be very exciting esp for the kids.\nIf you are travelling with kids remember to take the tram & pay for it in advance....\n\n\nMoreÂ  \n\n\n\nWhilst a serious attempt has been made to present these birds sympathetically it is a little sad to see majestic birds in cages that are really not large enough for some of the larger vultures and eagles etc. Children will probably love the smaller birds flying free which can be fed by hand on the walkways. This bird park. Bird...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nJurong Bird Park\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/03/d5/ce/5f/jurong-bird-park.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d386880-Reviews-MacRitchie_Nature_Trail-Singapore.html",
    "location": "Address: MacRitchie Reservoir Park, Singapore 298717, Singapore ",
    "description": "\nHave a great time with friends and family as one walks the entire trail that could take between 2 to 5 hours!\n\nHave a great time with friends and family as one walks the entire trail that could take between 2 to 5 hours!\n\nWonderful place to see different plants and animals, including monkeys. Just be careful where you're walking because snakes have been spotted here. The treetop walk has a stunning view of the forest.\n\nGo get some exercise by enjoying a nice 7 km or longer walk in the woods. You will sweat of you push the pace and expect some stairs and some mud due to construction.\nDON'T stare at the monkeys. They will take a swipe at you!\n\nIt was nice but short. I was hoping to find some sort of exotic animal or see an interesting bird. We only saw squirrels.\nGood for kids. Lots of warning signs. Not sure it they are just to give you the feel that you are in a jungle.\n\nA nice change of pace from the business of Singapore. Great views, great hike love the place. I will definitely go back to jog or hike here on a regular basis.\n\nWho would think that the busy Singapore has it's loving and peaceful park. I guess this one is best for relieving stress from work. And at the same time good place for jogging and exercises.\n\nThe park offers an easy hike - the trail is clearly marked out so getting lost is unlikely, and the tree-top walk is really nice. There are info plaques all along the bridge and the breeze from above the trees is lovely!\n\nReally lovely! We enjoyed the suspension bridge very much. And the welcomed site of monkeys everywhere!\n\ngreat area to experience a walk or run outside of building forest.\nMonkeys, bats, squirrels, butterflies and other animals can easily been spotted. Very relax and quiet area.\nyou can reach tree top walk which is quite nice place too.\nfavorite place of Singapore\n\nSomeone here ends up bloated as one of us simply cannot refrain from laughing while hiking!\nGood job, juniors. We completed 25,000 steps this morning. Trekking trails up and down the slopes and weaving our way through the vegetation, and we managed to get up-close to the crowns of the trees.\n",
    "type": "attractions",
    "title": "\n\nMacRitchie Nature Trail\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/02/48/f9/c4/tree-top-walk-suspension.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d4400784-Reviews-Flower_Dome-Singapore.html",
    "location": "Address: 18 Marina Gardens Drive Gardens By the Bay, Singapore 018953, Singapore ",
    "description": "\nWell worth a visit - the Cloud Forest and Flower Dome great to visit in the heat of the day and a welcome relief. A lot for flower and plant lovers to admire within a beautiful...\nread more \nWell worth a visit - the Cloud Forest and Flower Dome great to visit in the heat of the day and a welcome relief. A lot for flower and plant lovers to admire within a beautiful structure for those who love architecture!\n\nVisit to the Gardens by the bay cannot be complete without visiting the 2 Air conditioned domes. There is a good collection of flowers which can be a photographers delight. The Air conditioning also provides a welcome respite from the sultry Singapore heat outside. There were a lot of Christmas related decorations during our visit.\nNice place to visit\n\nWe really wish we went when it was not so busy. This conservatory was stunning, Tulipmania at the moment, but we were put off by how many people wanted photos in with the flowers or selfies more than just admiring the flowers themselves.\n\nThis place offers stunning flora for viewing pleasure. We were lucky enough to experience the Tulip Festival over here. There were loads of Tulips and my my! What lovely creations they are. Was amazed at the engineering of the dome as the temperature was low and it was cool for some of the plants to survive coming from a hot...\n\n\nMoreÂ  \n\n\n\nVisited in August with my sister. We got our tickets from busonlinetickets (portal) and paid only $22 per person for entry to Cloud Forest & Flower Dome (which was cheaper than booking from the official website or buying at the entrance). Getting there was pretty easy, its 100-200m walk from the MRT at Marina Bay. The walking track to the...\n\n\nMoreÂ  \n\n\n\nThe flowers were been changed with the season so it will look different. I loved this as well and great for all ages. I come here when sakura blossom. Its very nice :)\nLoved every moment I was there and can't rave enough about this garden. A must see if it's the one thing you do in Singapore.\n\nAll the flowers and plants are well taken care of. The building was quite comfortably air conditioned.\n\nAs we are in Garden by the Bay, we visited all the surrounding attractions and though a bit pricy but it is worth it. We see all the different flowers and it is like basking in the flowers as we are surround by the flowers. Refreshing trip\n\nThe beauty of this place takes you away from the troubles of the world. There is such a variety of habitats and plants that you will want to go back and look again.\n\nThe flower dome very interesting and Very Very Very beautiful especially Tulip garden that's colorful. There are many kind of flowers too. Don't miss it if you are in Singapore.\n",
    "type": "attractions",
    "title": "\n\nFlower Dome\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/0a/3b/de/47/flower-field.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d324542-Reviews-Singapore_Zoo-Singapore.html",
    "location": "Address: 80 Mandai Lake Road, Singapore 729826, Singapore ",
    "description": "\nThe open spaces and cage-free enclosures make this zoo seem as natural an environment as a zoo can achieve. The rainforest area has free-ranging animals (lemurs, bats, mouse deer...\nread more \nThe open spaces and cage-free enclosures make this zoo seem as natural an environment as a zoo can achieve. The rainforest area has free-ranging animals (lemurs, bats, mouse deer, squirrels, and huge numbers of birds) that offer countless opportunities for amazing up-close photos. Token feedings (SG$5) are an excellent means of interacting with the animals (rhinos, elephants, giraffes,...) and are...\n\n\nMoreÂ  \n\n\n\nZoo never fascinates me and especially after coming back from Safari trip in Masai Mara. On my first trip to Singapore I skipped the zoo for the same reason but this time based on the reviews and considering I had a 4 years old daughter with me I took a chance and wow it did not disappoint me a bit....\n\n\nMoreÂ  \n\n\n\nHad a wonderful time here with friends and our 5 month old baby. Such a beautiful Zoo (really lush!) and, although they make you pay for the different parts separately (the zoo, river safari and night zoo), it is worth it. The food was quite reasonable by Singapore standards and really good. Take your umbrella just in case through!\nHighlights...\n\n\nMoreÂ  \n\n\n\nAll of the animals appeared to be in excellent health considering, the high humidity did detract from the visit somewhat, however there were a couple of exhibits that were popular due to the air conditioning (namely where the polar bear was!) so it was a good time. I would expect it to be busy at peak times though. We visited...\n\n\nMoreÂ  \n\n\n\nSingapore has much to choose from, so the question was whether spending half a day of our short layover would be time well spent. For us it definitely was. There is a lot of diversity with respect to animal species and the fact that monkeys are roaming around added in different places made it extra special. A great day out,...\n\n\nMoreÂ  \n\n\n\nSingapore Zoo is one of the better I have seen. The grounds are well maintained and they are very nice to walk around. The Zoo is split into different Zones to easily group the animals. Like all zoo animals, they are well fed so unless you watch a show, they don't really move a lot.\nThe Zoo was easy to...\n\n\nMoreÂ  \n\n\n\nWe spent a whole day in the Singapore zoo. Involves a lot of walking around so be sure to wear comfortable footwear.\nPurchase of tickets before you come here is advisable, so that time is not wasted standing in Que for tickets, especially on holidays.\nIt is quite far from the city and most convinent travel is by Special buses...\n\n\nMoreÂ  \n\n\n\nThe Singapore Zoo got lots of animals to see and explore with children. The place it's clean, got cafe to take a break and eat. There's a place where the children and adults to play with water so do bring your swimming costume. Overall I love the the place to spend time together with family, do bring umbrellas, wear your...\n\n\nMoreÂ  \n\n\n\nWe were lucky with the weather which was quite a cool day , easy walking around though there is a train type thing you can ride on\n\nOne of the best zoos ever. It is well managed and clean. If you have the choice then please avoid going on weekends, school and public holidays because it gets really crowded. Take the tramp if your have weak legs or are with some elderly folks. Yes, I forget...NEVER ON A RAINY DAY! Catch the live shows and feeding times....\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nSingapore Zoo\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/0b/23/75/36/20160327-100839-largejpg.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d317453-Reviews-National_Orchid_Garden-Singapore.html",
    "location": "Address: 1 Cluny Rd | Within the Singapore Botanic Gardens, Singapore 259569, Singapore ",
    "description": "\nDefinitely worth a visit if you like plants, flowers and gardening. You can spend a pleasant afternoon here no problems and have a good long walk as well.\n\nDefinitely worth a visit if you like plants, flowers and gardening. You can spend a pleasant afternoon here no problems and have a good long walk as well.\n\nWell worth the visit just to see the wide range of colours. There is a cool room that you can visit if you are finding the heat and humidity a little too much. We also bought some ceramic orchids to stick on our fridge to remember it by. The number of orchids on display was overwhealming.\n\nI was shocked on the amount of different kinds of Orchids here. 1000 kinds and 2000 hybrids is impressive. The whole garden is beautiful and if you like Orchids you can't leave Singapore without visiting this place.\n\nIf you are a garden lover the National Orchid Garden is worth a walk around, the displays are amazing, it was very hot when we were there but you can always stop and one of the cafes for a cold drink.\n\nIt is just amazing to see all the different types of orchids in one garden. The place is extremely well maintained. Photography buffs will have a field day shooting all the flowers.\n\nThis orchid garden is exquisite, a must see for orchid lovers. So many varieties on display. Take a hat and some water as it can be very warm walking around.\n\nA must if you love orchids as it has many species and the landscape is beautiful .\nEntrance fee is S$2.00 and during school holidays it can be FREE\n\nDo not miss this site, especially if you like orchids. The grounds are breathtakingly beautiful! The gift shop carries some unique items as well.\n\nIt was my first time there. Had expected a small garden but the orchid garden was quite big but lots of varieties. It Wil be a great place for tourists as the entry fee is very very low.\n\nWasn't sure what to expect but this was brilliant. I never thought there were so many different orchids in the world. It takes quite a while to walk round and see everything but well worth the time taken.\n",
    "type": "attractions",
    "title": "\n\nNational Orchid Garden\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/04/00/3a/fb/national-orchid-garden.jpg",
    "time": "",
    "price": ""
  },
  {
    "channel": "",
    "link": "https://www.tripadvisor.com/Attraction_Review-g294265-d1523862-Reviews-The_Southern_Ridges-Singapore.html",
    "location": "Address: Alexandra Road | Mount Faber Park; Telok Blangah Hill Park; or Kent Ridge Park, Singapore 099203, Singapore ",
    "description": "\nInitially I was put off because I have a fear of heights. But once after 5 minutes, the fear turned into fun!\n\nInitially I was put off because I have a fear of heights. But once after 5 minutes, the fear turned into fun!\n\nIts an almost 3 km walk above the tree line. It was quite fascinating to get an aerial view of the forest. Also noticed an earth trail which takes down closer to the forest. Not sure where the entrance was. Nothing out of the ordinary to see but the walk was quite fun in itself. Once you enter there is...\n\n\nMoreÂ  \n\n\n\nSouthern ridges are known for their beautiful views. Good for Long walks to enjoy the beauty of nature. Must visit for all nature lovers.\n\nWould do this again and again. The Southern ridges have various individual trails and each unique and offers a different experience. It is suitable for a slow walk and except for the stairs climb to Mount Faber (Which you can also avoid by taking the cable from Harbourfront to FaberPeak) it is not intensive. One can also attempt a part...\n\n\nMoreÂ  \n\n\n\nA peaceful walk away from the sound of buzzing cities and cars. Enjoy the scenery of trees and natures while you are doing your workout..\n\nVery enjoyable walk, with a steep ascent from the Harbourfront end leading to great views, followed by a pleasant stroll down well maintained walking paths. A number of shady spots that's good for resting, bring your own picnic basket.\n\nA gorgeous walk to go on when in Singapore! We got a taxi and asked to be taken to the Southern Ridges not knowing where was the best place to start. He literally dropped us off in the middle of the road and told us itâ€™s a good place to start! We later found out it was Alexandra Arch. We...\n\n\nMoreÂ  \n\n\n\nA cool place where you can relax and have a jog. It has an interesting architecture but it's not very accessible for everyone.\n\nDepart at Kent Ridge MRT to get to the start of this tour (which I found in Lonely Planet's Singapore guidebook), which takes you through Kent Ridge Park and the trail there, down to Hort Park, onto the Henderson Waves, and ending at Faber Peak. It is 8-9km in total I believe.\nThe walk from the MRT to the start...\n\n\nMoreÂ  \n\n\n\nThis is a great trail that takes you through a variety of different parks and forests with some spectacular views of Singapore. Several of the sections of this hike have long raised walkways which make it quite unique.\nYou can pick the trail up near Vivo City and walk all the way to Clementi if you like. We started at...\n\n\nMoreÂ  \n\n\n",
    "type": "attractions",
    "title": "\n\nThe Southern Ridges\n",
    "category": "event",
    "image": "https://media-cdn.tripadvisor.com/media/photo-s/01/a0/19/d8/forest-walk.jpg",
    "time": "",
    "price": ""
  }
]